# Все слова

from fill_names import names, names_hir

a = {
    # Местоимения
'uk':{'これ':'это','それ':'то -','あれ':'вон то - '},
'uno' : {'この':'этот','その':'тот','あの':'вон тот'},
'uno_end':{'この':'этой','その':'той','あの':'вон той'},
'koko' : {'ここ':'здесь','そこ':'там','あそこ':'вон там'},
'desu' : {'です':'','ではありません':'не '},

'me_and_them':{'私':'я','私たち':'мы','あなた':'ты','あなたたち':'вы','彼':'он','彼女':'она','彼ら':'они','彼女ら':'они'},
'me_and_them_hir':{'私':'わたし','私たち':'わたしたち','あなた':'あなた','あなたたち':'あなたたち','彼':'かれ','彼女':'かのじょ','彼ら':'かれら','彼女ら':'かのじょら'},
'rod_mest':{'私の':'мой','私たちの':'наш','あなたの':'твой','あなたたちの':'ваш','彼の':'его','彼女の':'её','彼らの':'их','彼女らの':'их'},

# существительные и люди
'names':names,
'names_hir':names_hir,

'profession':{'先生':'преподаватель','医者':'врач','教授':'профессор','社長':'директор','店員':'продавец','中学校の教師':'учитель средней школы','大学生':'студент университета','技師':'инженер'},
'profession_hir':{'先生':'せんせい','医者':'いしゃ','教授':'きょうじゅ','社長':'しゃちょう','店員':'てんいん','中学校の教師':'ちゅうがっこうのきょうし','大学生':'だいがくせい','技師':'ぎし'},

'character':{    'やさしい':'добрый','わかい':'молодой','きびしい':'строгий','しんせつ':'вежливый'},
'character_hir':{    'やさしい':'やさしい','わかい':'わかい','きびしい':'きびしい','しんせつ':'しんせつ'},

'family' : {'お父さん':'отец','お母さん':'мать','お兄さん':'брат','お姉さん':'сестра','妹':'младшая сестра','弟':'младший брат',
            'おばあさん':'бабушка','おじいさん':'дедушка','おじさん':'дядя','おばさん':'тетя'},
'family_hur':{'お父さん':'おとうさん','お母さん':'おかあさん','お兄さん':'おにいさん','お姉さん':'おねえさん','妹':'いもうと','弟':'おとうと',
              'おばあさん':'おばあさん','おじいさん':'おじいさん','おじさん':'おじさん','おばさん':'おばさん'},
'know_people':{'友達':'приятель','しりあい':'знакомый','友人': 'друг'},
'know_people_hir':{'友達':'ともだち','しりあい':'しりあい','友人': 'ゆうじん'},
'people':{'友達':'друзья','子供':'дети','中学生たち':'ученики'},
'people_hir':{'友達':'ともだち','子供':'こども','人々':'ひとびと', '中学生たち':'ちゅうがくせいたち'},
'food':{'ご飯':'рис','パン':'хлеб','肉':'мясо','魚':'рыбу','野菜':'овощи','果物':'фрукты','りんご':'яблоко','みかん':'мандарин','バナナ':'банан','かき':'хурма','なし':'груша','お茶':'чай','コーヒー':'кофе','おかし':'сладости','みそしる':'мисо суп','たまご':'яйца','さくらんぼう':'вишня','ジャム': 'джем'},
'food_hir':{'ご飯':'ごはん','パン':'パン','肉':'にく','魚':'さかな','野菜':'やさい','果物':'くだもの','りんご':'りんご','みかん':'みかん','バナナ':'バナナ','かき':'かき','なし':'なし','お茶':'おちゃ','コーヒー':'コーヒー','おかし':'おかし','みそしる':'みそしる','たまご':'たまご','さくらんぼう':'さくらんぼう','ジャム': 'ジャム'},
'animals':{'ねこ':'кошки','いぬ':'собаки', '魚':'рыбы','鳥':'птицы','こい':'карпы','からす':'вороны','白鳥':'лебеди',},
'animals_hir':{'ねこ':'ねこ','いぬ':'いぬ', '魚':'さかな','鳥':'とり','こい':'こい','からす':'からす','白鳥':'はくちょう',},

'small object':{'ざっし':'журнал','はこ':'короб','辞典':'словарь','辞書':'словарь','本':'книга','鉛筆':'карандаш','教科書':'учебник',
                'かばん':'портфель','映画':'фильм','しゃしん':'фотография', '新聞':'газета', '傘':'зонтик', '電話':'телефон','靴':'обувь','時計':'часы',
                'おかし':'сладости','果物':'фрукты','地図':'карта','絵':'картина','着物':'кимоно'},
'small object_hir':{'ざっし':'ざっし','はこ':'はこ','辞典':'じてん','本':'ほん','鉛筆':'えんぴつ','教科書':'きょうかしょ','辞書':'じしょ',
                    'かばん':'かばん','映画':'えいが','しゃしん':'しゃしん', '新聞':'しんぶん', '傘':'かさ', '電話':'でんわ','靴':'くつ','時計':'とけい',
                    'おかし':'おかし','果物':'くだもの','地図':'ちず','絵':'え','着物':'きもの'},

'suffix for quantity':{'ざっし':'冊', 'はこ':'箱','辞典':'冊','辞書':'冊','本':'冊','鉛筆':'本','教科書':'冊',
                       'かばん':'個','映画':'本','しゃしん':'枚', '新聞':'冊', '傘':'本', '電話':'台','靴':'足','時計':'個',
                          'おかし':'個','果物':'個','地図':'枚','絵':'枚','着物':'着'},
'suffix for quantity_hir':{'ざっし':'さつ', 'はこ':'はこ','辞典':'さつ','辞書':'さつ','本':'さつ','鉛筆':'ほん','教科書':'さつ',
                           'かばん':'こ','映画':'ほん','しゃしん':'まい', '新聞':'さつ', '傘':'ほん', '電話':'だい','靴':'そく','時計':'こ',
                           'おかし':'こ','果物':'こ','地図':'まい','絵':'まい','着物':'ちゃく'},

'furniture':{'いす':'стул','机':'стол','布団':'футон','タンス':'комод','洋服ダンス':'шкаф','階段':'лестница','畳':'татами','電とう':'лампа','れいぞころ': 'холодильник','流し台': 'раковина','電子レンジ':'микроволновка'},
'furniture_hir':{'いす':'いす','机':'つくえ','布団':'ふとん','タンス':'タンス','洋服ダンス':'ようふくだんす','階段':'かいだん','畳':'たたみ','電とう':'でんとう','れいぞころ': 'れいぞころ','流し台': 'ながしだい','電子レンジ':'でんしれんじ'},

# Здания и страны, города

'buildings' : {'学校':'школа','駅':'станция','家':'дом','公園':'парк','図書館':'библиотека','大学':'университет','パン屋':'булочная','銀行':'банк','デパート':'универмаг','喫茶店':'кафе','店':'магазин','博物館':'музей','寮':'общежитие','寺':'буддийский храм','動物園': 'зоопарк'},
'buildings_hir': {'学校': 'がっこう', '駅': 'えき', '家': 'いえ', '公園': 'こうえん', '図書館': 'としょかん', '大学': 'だいがく', 'パン屋': 'ぱんや', '銀行': 'ぎんこう', 'デパート': 'デパート','喫茶店':'きっさてん','店':'みせ','博物館':'はくぶつかん','寮':'りょう','寺':'てら','動物園': 'どうぶつえん'},

'street':{'公園':'парк','道':'дорога','橋':'мост','駅':'станция', 'とおり':'улица'},
'street_hir':{'公園':'こうえん','道':'みち','橋':'はし','駅':'えき','とおり':'とおり'},
'room':{ '教室':'класс','食堂':'столовая','図書館':'библиотека','部屋':'комната','台所':'кухня','茶の間':'японск. гостиная','おうせつ間':'японск. гостиная'},
'room_hir':{'教室':'きょうしつ','食堂':'しょくどう','図書館':'としょかん','部屋':'へや','台所':'だいどころ','茶の間':'ちゃのま','おうせつ間':'おうせつま'},
'room_objects':{'まど':'окно','かべ':'стены','てんじょう':'потолок','カーテン':'занавески','ドア':'дверь','床':'пол'},
'room_objects_hir':{'まど':'まど','かべ':'かべ','てんじょう':'てんじょう','カーテン':'カーテン','ドア':'ドア','床':'ゆか'},
'outsides':{'門限':'ворота', '松の木':'сосна', '桜の木':'сакура', '池':'пруд', '庭':'садик','はし':'мостик','竹':'бамбук','花':'цветы'},
'outsides_hir':{'門限':'もんげん', '松の木':'まつのき', '桜の木':'さくらのき', '池':'いけ', '庭':'にわ','はし':'はし','竹':'たけ','花':'はな'},
'insides':{'部屋':'комната','台所':'кухня','お風呂':'ванна','廊下':'коридор','茶の間':'японск. гостиная','おうせつ間':'гостиная','日本間':'японская комната','げんかん':'прихожая'},
'insides_hir':{'部屋':'へや','台所':'だいどころ','お風呂':'おふろ','廊下':'ろうか','茶の間':'ちゃのま','おうせつ間':'おうせつま','日本間':'にほんま','げんかん':'げんかん'},
'cities' : {'東京':'Токио','大阪':'Осака','京都':'Киото','名古屋':'Нагоя','神戸':'Кобе'},    
'cities_hir': {'東京': 'とうきょう', '大阪': 'おおさか', '京都': 'きょうと', '名古屋': 'なごや', '神戸': 'こうべ'},
'countries' : {'日本':'Япония','アメリカ':'США','イギリス':'Великобритания','フランス':'Франция','ロシア':'Россия'},
'countries_hir': {'日本': 'にほん', 'アメリカ': 'あめりか', 'イギリス': 'いぎりす', 'フランス': 'ふらんす', 'ロシア': 'ろしあ'},
'nationality':{    '日本人':'японец','アメリカ人':'американец','イギリス人':'англичанин','フランス人':'француз','ロシア人':'русский'},
'nationality_hir':{    '日本人':'にほんじん','アメリカ人':'アメリカじん','イギリス人':'イギリスじん','フランス人':'フランスじん','ロシア人':'ロシアじん'},

'nowhere_no_one' : {'も':{'どこに':'нигде','だれ':'никто','何':'ничего'},
                    'か':{'どこ':'где-то','だれ':'кто-то','何':'что-то'},
                    'でも':{'どこ':'где угодно','だれ':'кто угодно','何':'что угодно'}
                    }, 
'nowhere_no_one_hir' : {'も':{'どこに':'どこに','だれ':'だれ','何':'なに'},
                         'か':{'どこ':'どこ','だれ':'だれ','何':'なに'},
                        'でも':{'どこ':'どこ','だれ':'だれ','何':'なに'}
                        },

# События, явления
'events' : {'授業':"урок",'散歩': "прогулка",'昼ごはん':"обед",'朝ごはん':"завтрак",'晩ごはん':"ужин",'映画':'фильм', '昼休み':'перерыв ','講義': 'лекция','あつまり':'собрание','コンサート':'концерт','パーティ':'вечеринка','たん生日':'день рождения','お祭り':'фестиваль','お花見':'цветение сакуры','お正月':'Новый год','見物':'Экскурсия', '旅行':'путешествие','みあわせ':'встреча'},
'events_hir': {'授業': "じゅぎょう", '散歩': "さんぽ", '昼ごはん': "ひるごはん", '朝ごはん': "あさごはん", '晩ごはん': "ばんごはん", '映画': 'えいが', '昼休み': 'ひるやすみ','講義': 'こうぎ','あつまり':'あつまり','コンサート':'コンサート','パーティ':'パーティ','たん生日':'たんじょうび','お祭り':'おまつり','お花見':'おはなみ','お正月':'おしょうがつ','見物':'けんぶつ', '旅行':'りょこう', 'みあわせ':'みあわせ',},

'name_of_buildings_duct':{'コスモス':'Космос','サンダー':'Гром','アクアマリン':'Аквамарин','ミラージュ':'Мираж','フェニックス':'Феникс','オーロラ':'Аврора','ミストラル':'Мистраль'},
'name_of_buildings_duct_hir':{'コスモス':'コスモス','サンダー':'サンダー','アクアマリン':'アクアマリン','ミラージュ':'ミラージュ','フェニックス':'フェニックス','オーロラ':'オーロラ','ミストラル':'ミストラル'},

'seasons':{'春':'весна','夏':'лето','秋':'осень','冬':'зима'},
'seasons_hir':{'春':'はる','夏':'なつ','秋':'あき','冬':'ふゆ'},

'temperature':{'寒':'холодно','暖か':'тепло','涼し':'прохладно','暑':'жарко'},
'temperature_hir':{'寒':'さむ','暖か':'あたたか','涼し':'すずし','暑':'あつ'},

'can_do':{'料理':'готовка','歌':'пение','スポーツ':'спорт','ゲーム':'игры','漢字':'кандзи','文法':'грамматика','発音':'произношение','文化':'культура','写真':'фотография','ピアノをひく':'игра на пианино','ギターをひく':'игра на гитаре','およぐ':'плавание'},
'can_do_hir':{'料理':'りょうり','歌':'うた','スポーツ':'スポーツ','ゲーム':'ゲーム','漢字':'かんじ','文法':'ぶんぽう','発音':'はつおん','文化':'ぶんか','写真':'しゃしん','ピアノをひく':'ピアノをひく','ギターをひく':'ギターをひく','およぐ':'およぐ'},

'senmon':{'歴史': 'история','文化': 'культура','けいざい':'экономика','文学':'литература'},
'senmon_hir':{'歴史': 'れきし','文化': 'ぶんか','けいざい':'けいざい','文学':'ぶんがく'},
'proffession':{'先生':'учитель','医者':'врач','教授':'профессор','社長':'директор','店員':'продавец','中学校の教師':'учитель средней школы','大学生':'студент университета','技師':'инженер'},
'proffession_hir':{'先生':'せんせい','医者':'いしゃ','教授':'きょうじゅ','社長':'しゃちょう','店員':'てんいん','中学校の教師':'ちゅうがっこうのきょうし','大学生':'だいがくせい','技師':'ぎし'},

'telling':{
'日本の文学':'японская литература','日本の歴史': 'история Японии','日本の文化': 'культура Японии','漢字':'кандзи','日本事情': 'японские ситуации','日本文法':'японская грамматика','漫画':'манга'
},
'telling_hir':{
'日本の文学':'にほんのぶんがく','日本の歴史': 'にほんのれきし','日本の文化': 'にほんのぶんか','漢字':'かんじ','日本事情': 'にほんじじょう','日本文法':'にほんぶんぽう','漫画':'まんが'
},

'languages':{    '日本語':'японский язык','英語':'английский язык','ロシア語':'русский язык'},
'languages_hir':{    '日本語':'にほんご','英語':'えいご','ロシア語':'ろしあご'},
'end_lang':{    '日本語':'по-японски','英語':'по-английски','ロシア語':'по-русски'},

'reasons':{
    'ひどい雨が降っていました':'шел ужасный дождь','天気がひどいでした':'погода была ужасная','風が強いでした':'был сильный ветер',
    '頭が痛くなりました':'голова заболела','気分が悪いでした':'состояние было плохое','忙しいでした':'я был занят','疲れていました':'я устал','たくさんの仕事があります':' много работы'
},
'reasons_hir':{
    'ひどい雨が降っていました':'ひどいあめがふっていました','天気がひどいでした':'てんきがひどいでした','風が強いでした':'かぜがつよいでした',
    '頭が痛くなりました':'あたまがいたくなりました','気分が悪いでした':'きぶんがわるいでした','忙しいでした':'いそがしいでした','疲れていました':'つかれていました','たくさんの仕事があります':'たくさんの仕事があります'
},

'reasons_without_copula':{
    'ひどい雨が降って':'будет ужасный дождь','天気がひどくて':'погода будет ужасная','風が強くて':'будет сильный ветер',
    '頭が痛くなって':'голова заболит','気分が悪くて':'состояние будет плохое','忙しくて':'я буду занят','疲れて':'я устану','たくさんの仕事があって':' будет много работы'
},
'reasons_without_copula_hir':{
    'ひどい雨が降って':'ひどいあめがふって','天気がひどくて':'てんきがひどくて','風が強くて':'かぜがつよくて',
    '頭が痛くなって':'あたまがいたくなって','気分が悪くて':'きぶんがわるくて','忙しくて':'いそがしくて','疲れて':'つかれて','たくさんの仕事があって':'たくさんの仕事があって'
},

'reasone_node':{
    'ひどい雨が降る':'ужасный дождь','天気がひどい':'погода ужасная','風が強い':'сильный ветер',
    '頭が痛い':'голова болит','気分が悪い':'состояние плохое','忙しい':'я занят','疲れている':'я устал','たくさんの仕事がある':'много работы',
    '母は病気な':'мама болеет','父は病気な':'папа болеет','そこににぎやかな':'там шумно'},

'reasone_node_hir':{
    'ひどい雨が降る':'ひどいあめがふる','天気がひどい':'てんきがひどい','風が強い':'かぜがつよい',
    '頭が痛い':'あたまがいたい','気分が悪い':'きぶんがわるい','忙しい':'いそがしい','疲れている':'つかれている','たくさんの仕事がある':'たくさんのしごとがある',
    '母は病気な':'はははびょうきな','父は病気な':'ちちはびょうきな','そこににぎやかな':'そこににぎやかな'},

'reason_3_form':{
     'ひどい雨が降る':'шел ужасный дождь','天気がひどい':'погода была ужасная','風が強い':'был сильный ветер',
    '頭が痛い':'голова заболела','気分が悪い':'состояние было плохое','忙しい':'я был занят','疲れている':'я устал','たくさんの仕事がある':'было много работы',
    '天気がいい':'хорошая погода','気分がいい':'хорошее настроение','仕事が少ない':'мало работы','ひまな時間がある':'было свободное время',
    '道は空いている':'дорога была свободна','空が青い':'небо стало синим','雨が止まる':'дождь закончился'},

'reason_3_form_hir':{
        'ひどい雨が降る':'ひどいあめがふる','天気がひどい':'てんきがひどい','風が強い':'かぜがつよい',
    '頭が痛い':'あたまがいたい','気分が悪い':'きぶんがわるい','忙しい':'いそがしい','疲れている':'つかれている','たくさんの仕事がある':'たくさんのしごとがある',
    '天気がいい':'てんきがいい','気分がいい':'きぶんがいい','仕事が少ない':'しごとがすくない','ひまな時間がある':'ひまなじかんがある',
    '道は空いている':'みちはあいている','空が青い':'そらがあおい','雨が止まる':'あめがやむ'},

'reasons_naru':{ # наступила причина или состояние
    '天気がひどくなりました':'погода стала ужасной','風が強くなりました':'ветер стал сильным','頭が痛くなりました':'голова стала болеть','気分が悪くなりました':'состояние стало плохим','忙しくなりました':'я стал занят','疲れてなりました':'я устал',
    '母は病気になりました':'мама заболела','父は病気になりました':'папа заболел','にぎやかになりました':'стало шумно','しずかになりました':'стало тихо','明るくなりました':'стало светло','寒くなりました':'стало холодно','暑くなりました':'стало жарко',
},

'reasons_naru_hir':{ # наступила причина или состояние
    '天気がひどくなりました':'てんきがひどくなりました','風が強くなりました':'かぜがつよくなりました','頭が痛くなりました':'あたまがいたくなりました','気分が悪くなりました':'きぶんがわるくなりました','忙しくなりました':'いそがしくなりました','疲れてなりました':'つかれてなりました',
    '母は病気になりました':'はははびょうきになりました','父は病気になりました':'ちちはびょうきになりました','にぎやかになりました':'にぎやかになりました','しずかになりました':'しずかになりました','明るくなりました':'あかるくなりました','寒くなりました':'さむくなりました','暑くなりました':'あつくなりました',
},

'reason_noun':{
    '病気':'болезни','私事':'личных дел','ストレス':'стресса','大雨':'сильного дождя'},

'reason_noun_hir':{
    '病気':'びょうき','私事':'しじ','ストレス':'ストレス','大雨':'おおあめ'},

'reasons_pos':{
    '休みです':'выходной','天気がいいです':'хорошая погода','気分がいいです':'хорошее настроение','仕事が少ないです':'мало работы','ひまな時間があります':'есть свободное время',
    '道は空いています':'дорога свободна','空が青くなった':'небо стало синим','雨が止まりました':'дождь закончился',
},
'reasons_pos_hir':{
    '休みです':'やすみです','天気がいいです':'てんきがいいです','気分がいいです':'きぶんがいいです','仕事が少ないです':'しごとがすくないです','ひまな時間があります':'ひまなじかんがあります',
    '道は空いています':'みちはあいています','空が青くなった':'そらがあおくなった','雨が止まりました':'あめがやみました',
},

'reason_simple':{
    '休み':'выходной','天気がいい':'хорошая погода','気分がいい':'хорошее настроение','仕事が少ない':'мало работы','ひまな時間がある':'есть свободное время',
    '道は空いている':'дорога свободна','空が青くなる':'небо становится синим','雨が止まる':'дождь заканчивается',
},

'reason_simple_hir':{
    '休み':'やすみ','天気がいい':'てんきがいい','気分がいい':'きぶんがいい','仕事が少ない':'しごとがすくない','ひまな時間がある':'ひまなじかんがある',
    '道は空いている':'みちはあいている','空が青くなる':'そらがあおくなる','雨が止まる':'あめがやむ',
},


'at_work':{'間違っている': 'ошибается','言葉を忘れている':'забывает слова','間違いをなおしている':'исправляет ошибки','言葉をふく習している':'повторяет слова',},
'at_work_hir':{'間違っている': 'まちがっている','言葉を忘れている':'ことばをわすれている','間違いをなおしている':'まちがいをなおしている','言葉をふく習している':'ことばをふくしゅうしている'},

'conditions':{'天気':'погоды','気温':'отопления','周辺':'окрестности','景色':'пейзажа','名所':'достопримечательности'},
'conditions_hir':{'天気':'てんき','気温':'きおん','周辺':'しゅうへん','景色':'けしき','名所':'めいしょ'},

# что будет после события
'after_event':{'楽しむ':'наслаждаться','練習する':'тренироваться','勉強する':'учиться','休む':'отдыхать','寝る':'спать','食べる':'есть',
               '飲む':'пить','歩く':'гулять пешком','遊ぶ':'играть','話す':'говорить','読む':'читать','書く':'писать','聞く':'слушать',
               '見る':'смотреть','行く':'идти','来る':'приходить','出かける':'выходить','買い物する':'делать покупки',
               '料理する':'готовить','掃除する':'убираться','洗濯する':'стирать','運動する':'заниматься спортом',
               '飲む':'пить',
               },

# Пространственные послеслоги
'area':{'上':'над','下':'под','前':'перед','後ろ':'за','右側':'справа от','左側':'слева от ','中':'внутри','外':'снаружи','隣':'по соседству c','間':'между',
        'そば':'рядом с ','近く':'близко к ','遠く':'отдаленно от'},
'area_hir':{'上':'うえ','下':'した','前':'まえ','後ろ':'うしろ','右側':'みぎがわ','左側':'ひだりがわ','中':'なか','外':'そと','隣':'となり','間':'あいだ',
            'そば':'そば','近く':'ちかく','遠く':'とおく'},

# Окончания ко всему
'end_predicative':{'しずか':'тихим','きれい':'чистым','にぎやか':'оживленным','りっぱ':'отличным','すてき':'прекрасным','ゆう名':'знаменитым','けっこう':'превосходным'},
'end_telling':{'歴史':'об истории Японии','日本の文学':'о японской литературе','日本の歴史': 'об истории Японии','日本の文化': 'о японской культуре','漢字':'о кандзи','日本事情': 'о японских ситуациях','日本文法':'о японской грамматике','漫画':'о манге'},
'end_me1':{'私に':'мне','私たちに':'нам','あなたに':'тебе','あなたたちに':'вам','彼に':'ему','彼女に':'ей','彼らに':'им','彼女らに':'им'},
'end_me2':{'私に':'меня','私たちに':'нас','あなたに':'тебя','あなたたちに':'вас','彼に':'его','彼女に':'её','彼らに':'их','彼女らに':'их'},
'end_proffesion':{'先生':'преподавателем','医者':'врачом','教授':'профессором','社長':'директором','店員':'продавцом','中学校の教師':'учителем средней школы','大学生':'студентом университета','技師':'инженером'},
'end_proffesion2':{'先生':'преподавателей','医者':'врачей','教授':'профессоров','社長':'директоров','店員':'продавцов','中学校の教師':'учителей средней школы','大学生':'студентов университета','技師':'инженеров'},
'end_adverbs':{'近く':'ближайшему/ей','遠く':'отдаленному/ой'},
'end_can':{'料理':'готовке','歌':'пении','スポーツ':'спорте','ゲーム':'играх','漢字':'кандзи','文法':'грамматике','発音':'произношении','文化':'культуре','写真':'фотографии','ピアノをひく':'игре на пианино','ギターをひく':'игре на гитаре','およぐ':'плавании'},
'end_street':{'公園':'парку','道':'дороге','橋':'мосту','駅':'станции', 'とおり':'улице'},
'end_animals':{'ねこ':'кошек','いぬ':'собак','魚':'рыб','鳥':'птиц','こい':'карпов','からす':'ворон','白鳥':'лебедей'},
'end_food':{'ご飯':'рис','パン':'хлеб','肉':'мясо','魚':'рыбу','野菜':'овощи','果物':'фрукты','りんご':'яблоки','みかん':'мандарины','バナナ':'бананы','かき':'хурму','なし':'груши','お茶':'чай','コーヒー':'кофе','おかし':'сладости','みそしる':'мисо суп','たまご':'яйца','さくらんぼう':'вишни','ジャム': 'джем'},
'end_events':{'授業':'урока','散歩':'прогулки','昼ごはん':'обеда','朝ごはん':'завтрака','晩ごはん':'ужина','映画':'фильма','昼休み':'перерыва','講義':'лекции','あつまり':'собрания','コンサート':'концерта','パーティ':'вечеринки','たん生日':'дня рождения','お祭り':'фестиваля','お花見':'цветения сакуры',
              'お正月':'Нового года','見物':'экскурсии','旅行':'путешествия','みあわせ':'встречи'},
'end_events2':{'授業':'урок','散歩':'прогулку','昼ごはん':'обед','朝ごはん':'завтрак','晩ごはん':'ужин','映画':'фильм','昼休み':'перерыв','講義':'лекцию','あつまり':'собрание','コンサート':'концерт','パーティ':'вечеринку','たん生日':'день рождения','お祭り':'фестиваль','お花見':'цветение сакуры',
                'お正月':'Новый год','見物':'экскурсию','旅行':'путешествие','みあわせ':'встречу'},
'end_events3':{'授業':'уроке','散歩':'прогулке','昼ごはん':'обеде','朝ごはん':'завтраке','晩ごはん':'ужине','映画':'фильме','昼休み':'перерыве','講義':'лекции','あつまり':'собрании','コンサート':'концерте','パーティ':'вечеринке','たん生日':'дне рождения','お祭り':'фестивале','お花見':'цветении сакуры',
    'お正月':'Новом годе','見物':'экскурсии',   '旅行':'путешествии','みあわせ':'встрече'},
'end_build' : {'学校':'школы','駅':'станции','家':'дома','公園':'парка','図書館':'библиотеки','大学':'университета','パン屋':'булочной','銀行':'банка','デパート':'универмага','喫茶店':'кафе','店':'магазина','博物館':'музея','寮':'общежития','寺':'буддийского храма','動物園': 'зоопарка'},
'end_build2' : {'学校':'школу','駅':'станцию','家':'домой','公園':'парк','図書館':'библиотеку','大学':'университет','パン屋':'булочную','銀行':'банк','デパート':'универмаг','喫茶店':'кафе','店':'магазин','博物館':'музей','寮':'общежитие','寺':'буддийский храм','動物園': 'зоопарк'},
'end_build3':{ '学校': 'школе', '駅': 'станции', '家': 'дому', '公園': 'парку', '図書館': 'библиотеке', '大学': 'университету','パン屋':'булочной','銀行':'банку','デパート':'универмагу','喫茶店':'кафе','店':'магазину','博物館':'музею','寮':'общежитию','寺':'буддийскому храму','動物園': 'зоопарку'},
'end_build4':{ '学校': 'школе', '駅': 'станции', '家': 'дома', '公園': 'парке', '図書館': 'библиотеке', '大学': 'университете','パン屋':'булочной','銀行':'банке','デパート':'универмаге','喫茶店':'кафе','店':'магазине','博物館':'музее','寮':'общежитии','寺':'буддийском храме','動物園': 'зоопарке'},
'end_build5':{'学校': 'школой', '駅': 'станцией', '家': 'домом', '公園': 'парком', '図書館': 'библиотекой', '大学': 'университетом','パン屋':'булочной','銀行':'банком','デパート':'универмагом','喫茶店':'кафе','店':'магазином','博物館':'музеем','寮':'общежитием','寺':'буддийским храмом','動物園': 'зоопарком'},
'end_room' : {'教室':'классе','食堂':'столовой','図書館':'библиотеке','部屋':'комнате','台所':'кухне','茶の間':'японск. гостиной','おうせつ間':'гостиной'},
'end_outsides':{'門限':'воротами', '松の木':'сосной', '桜の木':'сакурой', '池':'прудом', '庭':'садиком','はし':'мостиком','竹':'бамбуком','花':'цветами'},
'end_outsides_2':{'門限':'ворот', '松の木':'сосны', '桜の木':'сакуры', '池':'пруда', '庭':'садика','はし':'мостика','竹':'бамбука','花':'цветов'},
'end_insides':{'部屋':'комнате','台所':'кухне','お風呂':'ванне','廊下':'коридоре','茶の間':'японск. гостиной','おうせつ間':'гостиной','日本間':'японской комнате','げんかん':'прихожей'},
'end_insides2':{'部屋':'комнаты','台所':'кухни','お風呂':'ванны','廊下':'коридора','茶の間':'японск. гостиной','おうせつ間':'гостиной','日本間':'японской комнате','げんかん':'прихожей'},
'end_insides3':{'部屋':'комнатой','台所':'кухней','お風呂':'ванной','廊下':'коридором','茶の間':'японск. гостиной','おうせつ間':'гостиной','日本間':'японской комнатой','げんかん':'прихожей'},
'end_insides4':{'部屋':'комнату','台所':'кухню','お風呂':'ванну','廊下':'коридор','茶の間':'японск. гостиную','おうせつ間':'гостиную','日本間':'японскую комнату','げんかん':'прихожую'},
'end_countries' : {'日本':'Японии','アメリカ':'США','イギリス':'Великобритании','フランス':'Франции','ロシア':'России'},
'end_countries2' : {'日本':'Японию','アメリカ':'США','イギリス':'Великобританию','フランス':'Францию','ロシア':'Россию'},
'end_family' : {'お父さん':'отца','お母さん':'мать','お兄さん':'брата','お姉さん':'сестру','妹':'младшую сестру','弟':'младшего брата',
                 'おばあさん':'бабушку','おじいさん':'дедушку','おじさん':'дядю','おばさん':'тетю'},
'end_family2' : {'お父さん':'отцу','お母さん':'матери','お兄さん':'брату','お姉さん':'сестре','妹':'младшей сестре','弟':'младшему брату',
                 'おばあさん':'бабушке','おじいさん':'дедушке','おじさん':'дяде','おばさん':'тете'},
'end_family3' : {'お父さん':'отцом','お母さん':'матерью','お兄さん':'братом','お姉さん':'сестрой','妹':'младшей сестрой','弟':'младшим братом',
                 'おばあさん':'бабушкой','おじいさん':'дедушкой','おじさん':'дядей','おばさん':'тетей'},
'end_family4' : {'お父さん':'отца','お母さん':'матери','お兄さん':'брата','お姉さん':'сестры','妹':'младшей сестры','弟':'младшего брата',
                 'おばあさん':'бабушки','おじいさん':'дедушки','おじさん':'дяди','おばさん':'тети'},
'end_know':{'友達':'приятеля','しりあい':'знакомого','友人': 'друга'},
'end_know2':{'友達':'приятелю','しりあい':'знакомому','友人': 'другу'},
'end_know3':{'友達':'приятелем','しりあい':'знакомым','友人': 'другом'},
'end_know4':{'友達':'приятеля','しりあい':'знакомого','友人': 'друга'},
'end_furniture':{
    '上':{'いす':'стуле','机':'столе','布団':'футоне','タンス':'комоде','洋服ダンス':'шкафу','階段':'лестнице','畳':'татами','電とう':'лампе','れいぞころ': 'холодильнике','流し台': 'раковине','電子レンジ':'микроволновке'},
    '下':{'いす':'стулом','机':'столом','布団':'футоном','タンス':'комодом','洋服ダンス':'шкафом','階段':'лестницей','畳':'татами','電とう':'лампой','れいぞころ': 'холодильником','流し台': 'раковиной','電子レンジ':'микроволновкой'},
    '右側':{'いす':'стула','机':'стола','布団':'футона','タンス':'комода','洋服ダンス':'шкафа','階段':'лестницы','畳':'татами','電とう':'лампы','れいぞころ': 'холодильника','流し台': 'раковины','電子レンジ':'микроволновки'},
    },
'end_cities':{'東京':'Токио','大阪':'Осаке','京都':'Киото','名古屋':'Нагое','神戸':'Кобе'},
'end_mounths':{
    '一月':'в январе','二月':'в феврале','三月':'в марте','四月':'в апреле','五月':'в мае','六月':'в июне','七月':'в июле','八月':'в августе','九月':'в сентябре','十月':'в октябре','十一月':'в ноябре','十二月':'в декабре'},

# Окончания к существительным с числительными
'end_small_1':{'いす':'стул','机':'стол','布団':'футон','タンス':'комод','洋服ダンス':'шкаф','階段':'лестница',
        'ざっし':'журнал','はこ':'короб','辞典':'словарь','本':'книга','鉛筆':'карандаш','教科書':'учебник','辞書':'словарь',
        'かばん':'портфель','映画':'фильм','しゃしん':'фотография','新聞':'газета','傘':'зонтик','電話':'телефон','靴':'обувь','時計':'часы',
        'おかし':'сладость','果物':'фрукт','地図':'карта','絵':'картина','着物':'кимоно'},
'end_small_2':{'いす':'стула','机':'стола','布団':'футона','タンス':'комода','洋服ダンス':'шкафа','階段':'лестницы','辞書':'словаря',
         'ざっし':'журнала','はこ':'короба','辞典':'словаря','本':'книги','鉛筆':'карандаша',
         '教科書':'учебника','かばん':'портфеля','映画':'фильма','しゃしん':'фотографии','新聞':'газеты','傘':'зонтика','電話':'телефона','靴':'обуви','時計':'часов',
         'おかし':'сладости','果物':'фрукта','地図':'карты','絵':'картины','着物':'кимоно'},
'end_small_5':{'いす':'стульев','机':'столов','布団':'футонов','タンス':'комодов','洋服ダンス':'шкафов','階段':'лестниц',
         'ざっし':'журналов','はこ':'коробов','辞典':'словарей','本':'книг','鉛筆':'карандашей', '辞書':'словарей',
         '教科書':'учебников','かばん':'портфелей','映画':'фильмов','しゃしん':'фотографий','新聞':'газет','傘':'зонтиков','電話':'телефонов','靴':'обуви','時計':'часов',
         'おかし':'сладостей','果物':'фруктов','地図':'карт','絵':'картин','着物':'кимоно'},
'end_small_address':{
    'いす':'стул','机':'стол','布団':'футон','タンス':'комод','洋服ダンス':'шкаф','階段':'лестницу',
        'ざっし':'журнал','はこ':'короб','辞典':'словарь','本':'книгу','鉛筆':'карандаш','教科書':'учебник','辞書':'словарь',
        'かばん':'портфель','映画':'фильм','しゃしん':'фотографию','新聞':'газету','傘':'зонтик','電話':'телефон','靴':'обувь','時計':'часы',
        'おかし':'сладость','果物':'фрукт','地図':'карту','絵':'картину','着物':'кимоно'},
'end_return_small_object':{
    'いす':'стула','机':'стола','布団':'футона','タンス':'комода','洋服ダンス':'шкафа','階段':'лестницы',
        'ざっし':'журнала','はこ':'короба','辞典':'словаря','本':'книги','鉛筆':'карандаша','教科書':'учебника','辞書':'словаря',   
        'かばん':'портфеля','映画':'фильма','しゃしん':'фотографии','新聞':'газеты','傘':'зонтика','電話':'телефона','靴':'обуви','時計':'часов',
        'おかし':'сладостей','果物':'фруктов','地図':'карт','絵':'картины','着物':'кимоно'},
'end_get_small_object':{
    'いす':'стул','机':'стол','布団':'футон','タンス':'комод','洋服ダンス':'шкаф','階段':'лестницу'
        ,'ざっし':'журнал','はこ':'короб','辞典':'словарь','本':'книгу','鉛筆':'карандаш','教科書':'учебник','辞書':'словарь',
        'かばん':'портфель','映画':'фильм','しゃしん':'фотографию','新聞':'газету','傘':'зонтик','電話':'телефон','靴':'обувь','時計':'часы',
        'おかし':'сладость','果物':'фрукт','地図':'карту','絵':'картину','着物':'кимоно'},

# Наречия
'adverbs':{
    'positiv':{
            'とても':'очень','本当に':'действительно'},
    'negativ':{'あまり':' не слишком','全然':'совсем не','そう':'не настолько', 'すこしも':'нисколько не'},
    'negativ2':{'たいへん':'очень(в плохом смысле)','ちょっと':'немного (в плохом смысле)'},
    'neutral':{'たいてい':'по большей части','ふつう':'обычно','時々':'иногда','めったに':'редко','もう':'уже','また':'опять', 'たった':'пока еще','いつも':'всегда','よく':'часто'},
    'person':{'ふだん':'обычно','しずかに':'тихо','早く':'быстро','ゆっくり':'не спеша','時々':'иногда','いつも':'всегда','よく':'часто','遠く':'долго','急いで':'поспешно', 'たいてい':'по большей части', '遅いで':'медленно'},
    'jyozu':{'上手に':'умело','下手に':'не умело',},
    'for_space':{'近く':'ближайший ','遠く':'отдаленный'},
    'numb':{'少ない':'немного','たくさん':'много','多い':'много','大ぜい':'немного'}
},
'adverbs_hir':{
    'positiv':{'とても':'とても','もう':'もう','本当に':'ほんとうに'},
    'negativ':{'あまり':'あまり','全然':'ぜんぜん','そう':'そう','すこしも':'すこしも'},
    'negativ2':{'たいへん':'たいへん','ちょっと':'ちょっと'},
    'neutral':{'たいてい':'たいてい','ふつう':'ふつう','時々':'ときどき','めったに':'めったに','もう':'もう','また':'また', 'たった':'たった','いつも':'いつも','よく':'よく'},
    'person':{'ふだん':'ふだん','しずかに':'しずかに','早く':'はやく','ゆっくり':'ゆっくり','時々':'ときどき','いつも':'いつも','よく':'よく','遠く':'とおく','急いで':'いそいで', 'たいてい':'たいてい', '遅いで':'おそいで'},
    'jyozu':{'上手に':'じょうずに','下手に':'へたに',},
    'for_space':{'近く':'ちかく','遠く':'とおく'},
    'numb':{'少ない':'すくない','たくさん':'たくさん','多い':'おおい','大ぜい':'おおぜい'}
    },

# Суффиксы
'suff':{'さん':'-сан','くん':'-кун'},
'suff_no':{'さん':'-сана','くん':'-куна'},
'suff_no2':{'さん':'-сану','くん':'-куну'},
'suff_no3':{'さん':'-саном','くん':'-куном'},

# Числа

'numbers':{'1':'一','2':'二','3':'三','4':'四','5':'五','6':'六','7':'七','8':'八','9':'九','10':'十'},
'numbers2':{'1':'いち','2':'に','3':'さん','4':'よん','5':'ご','6':'ろく','7':'なな','8':'はち','9':'きゅう','10':'じゅう'},
'numbers_hir':{'1':'ひと','2':'ふた','3':'みっ','4':'よっ','5':'いつ','6':'むっ','7':'なな','8':'やっ','9':'ここの','10':'じゅう','15':'じゅうご','20':'にじゅう','30':'さんじゅう','40':'よんじゅう','50':'ごじゅう','25':'にじゅうご','35':'さんじゅうご','45':'よんじゅうご',},
'numbers_rus':{'1':'один','2':'вдвоем','3':'втроем','4':'вчетвером','5':'впятером','6':'вшестером','7':'всемером','8':'ввосьмером','9':'вдевятером','10':'вдесятером'},
'minutes_hir':{'1':'いっぷん','2':'にふん','3':'さんぷん','4':'よんぷん','5':'ごふん','6':'ろっぷん','7':'ななふん','8':'はっぷん','9':'きゅうふん','10':'じゅっぷん','15':'じゅうごふん','20':'にじゅっぷん','30':'さんじゅっぷん','40':'よんじゅっぷん','50':'ごじゅっぷん','25':'にじゅうごふん','35':'さんじゅうごふん','45':'よんじゅうごふん',},

'階':{'read':{'1':'いっかい','2':'にかい','3':'さんがい','4':'よんかい','5':'ごかい','6':'ろっかい','7':'ななかい','8':'はっかい','9':'きゅうかい','10':'じゅっかい'},
    'ending':{'1':'этаж','2':'этажа','3':'этажа','4':'этажа','5':'этажей','6':'этажей','7':'этажей','8':'этажей','9':'этажей','10':'этажей'},
    'ending2':{'1':'первом','2':'втором','3':'третьем','4':'четвертом','5':'пятом','6':'шестом','7':'седьмом','8':'восьмом','9':'девятом','10':'десятом'},
    },

'numbers_months':{'1':'一', '2':'二', '3':'三', '4':'四', '5':'五', '6':'六', '7':'七', '8':'八', '9':'九', '10':'十', '11':'十一', '12':'十二'},
'numbers_day':{'1':'一日', '2':'二日', '3':'三日', '4':'四日', '5':'五日', '6':'六日', '7':'七日', '8':'八日', '9':'九日', '10':'十日', '11':'十一日', '12':'十二日', '13':'十三日', '14':'十四日', '15':'十五日', '16':'十六日', '17':'十七日', '18':'十八日', '19':'十九日', '20':'二十日', '21':'二十一日', '22':'二十二日', '23':'二十三日', '24':'二十四日', '25':'二十五日', '26':'二十六日', '27':'二十七日', '28':'二十八日', '29':'二十九日', '30':'三十日', '31':'三十一日'},
'numbers_for_year':{'1': '一', '2': '二', '3': '三', '4': '四', '5': '五', '6': '六', '7': '七', '8': '八', '9': '九', '10': '十', '0': '〇'},

# Глаголы и их формы
'glagol': {
    'move':{'行': "い", '歩いて行': 'あるいてい'},
    'move_through':{'とお':'とお','出かれ':'でかけ','入':'はい'},
    'not_trans_fast_men':{'寝': 'ね', '起': 'おき' },
    'not_trans_fast_ev':{'始ま': 'はじま', '終': 'おわ','つづけ':'つづけ'},
    'not_trans_slow':{ '勉強': 'べんきょう','読':'よ','休':'やす','そうじ':'そうじ','洗たく':'せんたく','練習':'れんしゅう','たいそう':'たいそう','遊':'あそ',
                      '散歩':'さんぽ','歌':'うた','料理':'りょうり','眠':'ね'},
    'accusative':{'習':'なら','読':'よ','書':'か','飲':'の','食':'たべ','見':'み','聞_1':'き','練習':'れんしゅう','そうじ':'そうじ','なお':'なお',
                  '買':'か','ちゅうもん':'ちゅうもん','しめ':'しめ','探':'さが','作':'つく','借り':'かり','かえ':'かえ','持って来':'もってき',
                  'しゃしんをと':'しゃしんをと','教え':'おしえ','飾':'かざ','包':'つつ','放':'はな','す':'す'},
    'address': {'書':'か','答え':'こたえ','電話':'でんわ','質問':'しつもん','聞_2':'き','言':'い'},
    'withs':{'話':'はな','会':'あ','勉強':'べんきょう','遊':'あそ','散歩':'さんぽ','やくそ':'やくそ','わかれ':'わかれ'},
    'hygiene':{'みが':'みが','洗':'あら','たいそう':'たいそう','走':'はし','着がえ':'きがえ','シャワーをあび':'シャワーをあび','着':'き'},
                    },

'glag_for_build':{
        '習':[ '学校','家','図書館','大学','寮'],
        'なお':[ '学校','家','図書館','大学','寮'],
        '練習':[ '学校','家','図書館','大学','寮'],
        '読':[ '図書館','家','寮','学校','大学'],
        '書':['学校','家','図書館','大学','寮'],
        '飲':['公園','喫茶店','動物園','家'],
        '食':['公園','喫茶店','動物園','家'],
        '見':['公園','喫茶店','動物園','家'],
        '聞_1':['学校','図書館','大学'],
        'そうじ':['家','寮'],
        '買':['デパート','店','パン屋','喫茶店',],
        'ちゅうもん':['デパート','店','喫茶店'],
        'しめ':[ '学校','家','図書館','大学','寮'],
        '探':['家','寮'],
        '作':['家','寮'],
        '放':['公園','家','寮'],
},


'glag_nast_post' : {'行':'едет','帰':'возвращается','歩いて行':'ходит пешком',
                    'とお':'проходит','出かれ':'выходит','入':'входит',
             '寝':'засыпает','起':'просыпается', '始ま':'начинается','終':'кончается','つづけ':'продолжает',
             '勉強':'занимается','読':'читает','休':'отдыхает','そうじ':'прибирает','練習':'делает задание','洗たく':'стирает','たいそう':'занимается гимнастикой','遊':'играет',
             '散歩':'гуляет','しゃしんをと':'фотографирует', '歌':'поет','料理':'готовит','眠':'спит',
             '習':'учит','読':'читает','書':'пишет','飲':'пьет','食':'ест','見':'смотрит','聞_1':'слушает','練習':'делает задание','なお':'исправляет',
             '買':'покупает','ちゅうもん':'заказывает','持って来':'приносит','しめ':'закрывает','探':'ищет','作':'делает','借り':'берет взаймы','かえ':'возвращает',
             'い':'находится','あ':'находится','飾':'украшает','包':'заворачивает','放':'отпускает',
             '答え':'отвечает','電話':'звонит','質問':'спрашивает','聞_2':'спрашивает','言':'говорит',
             '話':'говорит','会':'встречается','勉強':'занимается','遊':'играет','散歩':'гуляет','やくそ':'договаривается','わかれ':'расстается',
             'みが':'чистит','洗':'моется','走':'бегает','シャワーをあび':'обливается в душе','着がえ':'переодевается','着':'одевает',
             '教え':'объясняет', 'す':'делает'
             },

'glag_budush' : {'行':"поедет",'帰':'вернется','歩いて行':'пойдет пешком',
                 '出かれ':'выйдет','入':'войдет',
               '寝':'пойдет спать','起':'проснется','始ま':'начнется','終':'кончится','つづけ':'продолжит',
               '勉強':'будет заниматься', '読':'почитает','休':'отдохнет','そうじ':' приберется','洗たく':'постирает',
               '練習':'сделает задание','たいそう':'займётся гимнастикой','遊':'поиграет','散歩':'погуляет','しゃしんをと':'сфотографирует','歌':'споет','料理':'приготовит','眠':'поспит',
               '習':'будеть учить','読':'почитает','書':'напишет','飲':'будет пить','食':'поест','見':'посмотрит','聞_1':'послушает',
               '練習':'сделает задание', 'なお':'исправит','買':'купит','ちゅうもん':'закажет','持って来':'принесет','しめ':'закроет','探':'поищет', '作':'сделает','借り':'возьмет взаймы','かえ':'вернет',
               'い':'будет находиться','あ':'будет находиться','飾':'украсит','包':'завернет','放':'отпустит',
               '答え':'ответит','電話':'позвонит','質問':'спросит','聞_2':'спросит','言':'скажет',
               '話':'поговорит','会':'встретится','勉強':'займётся','遊':'поиграет','散歩':'погуляет','やくそ':'договорится','わかれ':'расстанется',
               'みが':'почистит','洗':'помоется','走':'побегает','シャワーをあび':'примет душ','着がえ':'переоденется','着':'оденет',
               '教え':'объяснит','す':'сделает'
               },

'glag_result':{
    '習':'выучен','読':'прочитан','書':'написан','飲':'выпит','食':'съеден','見':'посмотрен','聞_1':'прослушан',
    '練習':'выполнен (задание)', 'なお':'исправлен','買':'куплен','ちゅうもん':'заказан','持って来':'принесен','しめ':'закрыт','探':'найден',
    '作':'сделан (приготовлен)','借り':'взят взаймы','かえ':'возвращен','飾':'украшен','教え':'объяснен','そうじ':'убран','洗たく':'постиран',
    '包':'завернут','放':'отпущен','する':'сделано'
},

'glag_now' : {'行':'едет','帰':'возвращается','歩いて行':'идёт пешком','とお':'проходит',
              '出かれ':'выходит','入':'входит',
                '寝':'спит','起':'просыпается', '始ま':'начинается','終':'кончается','つづけ':'продолжает',
                '勉強':'занимается','読':'читает','休':'отдыхает','そうじ':'убирает','練習':'делает задание','洗たく':'стирает','たいそう':'занимается гимнастикой',
                '遊':'играет','散歩':'гуляет','しゃしんをと':'фотографирует','歌':'поет','料理':'готовит','眠':'спит',
                '習':'учит','読':'читает','書':'пишет','飲':'пьёт','食':'ест','見':'смотрит','聞_1':'слушает','練習':'делает задание', 
                'なお':'исправляет','買':'покупает','ちゅうもん':'заказывает','持って来':'приносит','しめ':'закрывает','探':'ищет','作':'делает','借り':'берет взаймы','かえ':'возвращает',
                'い':'находится','あ':'находится','飾':'украшает','包':'заворачивает','放':'отпускает',
                '答え':'отвечает','電話':'звонит','質問':'спрашивает','聞_2':'спрашивает','言':'говорит',
                '話':'говорит','会':'встречается','勉強':'занимается','遊':'играет','散歩':'гуляет','やくそ':'договаривается','わかれ':'расстается',
                'みが':'чистит','洗':'моется','走':'бегает','シャワーをあび':'принимает душ','着がえ':'переодевается','着':'одевает',
                '教え':'объясняет', 'す':'делает'},
'glag_past_post':{
    '行':'ездил','帰':'возвращался','歩いて行':'ходил пешком','とお':'проходил',
    '出かれ':'выходил','入':'входил',
    '寝':'ложился спать','起':'проснулся','始ま':'начался','終':'кончился','つづけ':'продолжил',
    '勉強':'занимался', '読':'читал','休':'отдыхал','そうじ':'убирал','洗たく':'стирал','練習':'делал задание',
    'たいそう':'занимался гимнастикой','遊':'играл','散歩':'гулял','しゃしんをと':'фотографировал','歌':'пел','料理':'готовил','眠':'спал',
    '習':'учил','読':'читал','書':'писал','飲':'пил','食':'ел','見':'смотрел','聞_1':'слушал','練習':'делал задание',
        'なお':'исправлял','買':'покупал','ちゅうもん':'заказывал','持って来':'принес','しめ':'закрыл','探':'искал','作':'делал','借り':'брал взаймы','かえ':'возвращал',
    'い':'находился','あ':'находился','飾':'украшал','包':'заворачивал','放':'отпускал',
    '答え':'отвечал','電話':'звонил','質問':'спрашивал','聞_2':'спрашивал','言':'говорил',
    '話':'говорил','会':'встречался','勉強':'занимался','遊':'играл','散歩':'гулял','やくそ':'договаривался','わかれ':'расставался',
    'みが':'чистил','洗':'мылся','走':'бегал','シャワーをあび':'принимал душ','着がえ':'переодевался','着':'одевал',
    '教え':'объяснял', 'す':'делал'
},

'glag_past_one_moment':{
    '行':'поехал','帰':'вернулся','歩いて行':'пошел пешком','とお':'прошел',
    '出かれ':'вышел','入':'вошел',
    '寝':'пошел спать','起':'проснулся','始ま':'начался','終':'кончился','つづけ':'продолжил',
    '勉強':'занялся', '読':'прочел','休':'отдохнул','そうじ':'прибрался','洗たく':'постирал','練習':'сделал задание',
    'たいそう':'занялся гимнастикой','遊':'поиграл','散歩':'погулял','しゃしんをと':'сфотографировал','歌':'спел','料理':'приготовил','眠':'поспал',
    '習':'выучил','読':'прочитал','書':'написал','飲':'выпил','食':'поел','見':'посмотрел','聞_1':'послушал','練習':'сделал задание',
        'なお':'исправил','買':'купил','ちゅうもん':'заказал','持って来':'принес','しめ':'закрыл','探':'нашел','作':'сделал','借り':'взял взаймы','かえ':'вернул',
    'い':'находился','あ':'находился','飾':'украсил','包':'завернул','放':'отпустил',
    '答え':'ответил','電話':'позвонил','質問':'спросил','聞_2':'спросил','言':'сказал',
    '話':'поговорил','会':'встретился','勉強':'занимался','散歩':'гулял','やくそ':'договорился','わかれ':'расстался',
    'みが':'почистил','洗':'помылся','走':'побегал','シャワーをあび':'принял душ','着がえ':'переоделся','着':'оделся',
    '教え':'объяснил', 'す':'сделал'
},

'glag_past_one_moment2':{'行':'пришел','帰':'вернулся','歩いて行':'прошел пешком','とお':'прошел',
    '出かれ':'вышел','入':'вошел',
    '寝':'лег спать','起':'проснулся','始ま':'начал','終':'закончил','つづけ':'продолжил',
    '勉強':'занялся', '読':'прочел','休':'отдохнул','そうじ':'прибрался','洗たく':'постирал','練習':'сделал задание',
    'たいそう':'занялся гимнастикой','遊':'поиграл','散歩':'погулял','しゃしんをと':'сфотографировал','歌':'спел','料理':'приготовил','眠':'поспал',
    '習':'выучил','読':'прочитал','書':'написал','飲':'выпил','食':'поел','見':'посмотрел','聞_1':'послушал','練習':'сделал задание',
        'なお':'исправил','買':'купил','ちゅうもん':'заказал','持って来':'принес','しめ':'закрыл','探':'нашел','作':'сделал','借り':'взял взаймы','かえ':'вернул',
    'い':'находился','あ':'находился','飾':'украсил','包':'завернул','放':'отпустил',
    '答え':'ответил','電話':'позвонил','質問':'спросил','聞_2':'спросил','言':'сказал',
    '話':'поговорил','会':'встретился','勉強':'занимался','遊':'играл','散歩':'погулял','やくそ':'договорился','わかれ':'расстался',
    'みが':'почистил','洗':'помылся','走':'прибежал','シャワーをあび':'принял душ','着がえ':'переоделся','着':'оделся',
    '教え':'объяснил', 'す':'сделал', '思':'подумал'
},

'glag_gerund_past':{
    '行':'поехав','帰':'вернувшись','歩いて行':'пройдя пешком','とお':'пройдя',
    '出かれ':'выйдя','入':'войдя',
    '寝':'положившись спать','起':'проснувшись','始ま':'начав','終':'закончив','つづけ':'продолжив',
    '勉強':'занявшись', '読':'прочитав','休':'отдохнув','そうじ':'прибравшись','洗たく':'постирав','練習':'сделав задание',
    'たいそう':'занявшись гимнастикой','遊':'поиграв','散歩':'погуляв','しゃしんをと':'сфотографировав','歌':'спев','料理':'приготовив','眠':'поспав',
    '習':'выучив','読':'прочитав','書':'написав','飲':'выпив','食':'поев','見':'посмотрев','聞_1':'послушав','練習':'сделав задание',
        'なお':'исправив','買':'купив','ちゅうもん':'заказав','持って来':'принеся','しめ':'закрыв','探':'нашед','作':'сделав','借り':'взяв взаймы','かえ':'вернув',
    'い':'находившись','あ':'находившись','飾':'украсив','包':'завернув','放':'отпустив',
    '答え':'ответив','電話':'позвонив','質問':'спросив','聞_2':'спросив','言':'сказав',
    '話':'поговорив','会':'встретившись','勉強':'занимавшись','遊':'поиграя','散歩':'погуляв','やくそ':'договорившись','わかれ':'расставшись',
    'みが':'почистив','洗':'помывшись','走':'побегая','シャワーをあび':'приняв душ','着がえ':'переодевшись','着':'одев',
    '教え':'объяснив', 'す':'сделав'

},

'glag_masyou':{
    '行':'поедем','帰':'вернемся','歩いて行':'пойдем пешком','とお':'пройдем',
    '出かれ':'выйдем','入':'войдем',
    '寝':'пойдем спать','起':'проснемся','始ま':'начнем','終':'закончим','つづけ':'продолжим',
    '勉強':'будем заниматься', '読':'почитаем','休':'отдохнем','そうじ':'приберемся','洗たく':'постираем','練習':'сделаем задание',
    'たいそう':'будем заниматься гимнастикой','遊':'поиграем','散歩':'погуляем','しゃしんをと':'сфотографируем','歌':'споем','料理':'приготовим','眠':'поспим',
    '習':'будем учить','読':'почитаем','書':'напишем','飲':'выпьем','食':'поедим','見':'посмотрим','聞_1':'послушаем','練習':'сделаем задание',
      'なお':'исправим','買':'купим','ちゅうもん':'закажем','持って来':'принесем','しめ':'закроем','探':'поищем','作':'сделаем','借り':'возьмем взаймы','かえ':'вернем',
    'い':'будем находиться','あ':'будем находиться','飾':'украсим','包':'завернем','放':'отпустим',
    '答え':'ответим','電話':'позвоним','質問':'спросим','聞_2':'спросим','言':'скажем',
    '話':'поговорим','会':'встретимся','勉強':'позанимаемся','遊':'поиграем','散歩':'погуляем','やくそ':'договоримся','わかれ':'расстанемся',
    'みが':'почистим','洗':'помоемся','走':'побегаем','シャワーをあび':'примем душ','着がえ':'переоденемся','着':'оденем',
    '教え':'объясним', 'す':'сделаем', '思':'подумаем',
},
'glag_kudasai':{
    '行':'приезжайте','帰':'возвращайтесь','歩いて行':'пройдите пешком','とお':'пройдите',
    '出かれ':'выйдите','入':'войдите',
    '寝':'пойдите спать','起':'проснитесь','始ま':'начнется','終':'закончится','つづけ':'продолжите',
    '勉強':'займитесь', '読':'почитайте','休':'отдохните','そうじ':'приберитесь','洗たく':'постирайте','練習':'сделайте задание',
    'たいそう':'займитесь гимнастикой','遊':'поиграйте','散歩':'погуляйте','しゃしんをと':'сфотографируйте','歌':'спойте','料理':'приготовьте','眠':'поспите',
    '習':'выучите','読':'почитайте','書':'напишите','飲':'выпейте','食':'поешьте','見':'посмотрите','聞_1':'послушайте','練習':'сделайте задание',
        'なお':'исправьте','買':'купите','ちゅうもん':'закажите','持って来':'принесите','しめ':'закройте','探':'поищите','作':'сделайте','借り':'возьмите взаймы','かえ':'верните',
    'い':'будьте находиться','あ':'будьте находиться','飾':'украсьте','包':'заверните','放':'отпустите',
    '答え':'ответьте','電話':'позвоните','質問':'спросите','聞_2':'спросите','言':'скажите',
    '話':'поговорите','会':'встретитесь','勉強':'займитесь','遊':'поиграйте','散歩':'погуляйте','やくそ':'договоритесь','わかれ':'расстаньтесь',
    'みが':'почистьте','洗':'помойтесь','走':'побегайте','シャワーをあび':'примите душ','着がえ':'переоденьтесь','着':'оденьте',
    '教え':'объясните', 'す':'сделайте'
},
'glag_kudasai_rude':{
    '行':'приезжай','帰':'возвращайся','歩いて行':'пройди пешком','とお':'пройди',
    '出かれ':'выйди','入':'войди',
    '寝':'пойди спать','起':'проснись','始ま':'начни','終':'закончи','つづけ':'продолжи',
    '勉強':'займись', '読':'почитай','休':'отдохни','そうじ':'приберись','洗たく':'постирай','練習':'сделай задание',
    'たいそう':'займись гимнастикой','遊':'поиграй','散歩':'погуляй','しゃしんをと':'сфотографируй','歌':'спой','料理':'приготовь',
    '眠':'поспи', '習':'выучи','読':'почитай','書':'напиши','飲':'выпей','食':'поешь','見':'посмотри','聞_1':'послушай','練習':'сделай задание',
        'なお':'исправь','買':'купи','ちゅうもん':'закажи','持って来':'принеси','しめ':'закрой','探':'поищи','作':'сделай','借り':'возьми взаймы','かえ':'верни',
    'い':'будь','あ':'будь','飾':'укрась','包':'заверни','放':'отпусти', '答え':'ответь','電話':'позвони','質問':'спроси','聞_2':'спроси','言':'скажи',
    '話':'поговори','会':'встреться','勉強':'займись','遊':'поиграй','散歩':'погуляй','やくそ':'договорись','わかれ':'расстанься',
    'みが':'почисть','洗':'помойся','走':'побегай','シャワーをあび':'прими душ','着がえ':'переоденься','着':'оденься',
    '教え':'объясни', 'す':'сделай'
},


'glag_nagara':{
    '行':'во время поездки','帰':'возвращаясь','歩いて行':'проходя пешком','とお':'проходя',
    '出かれ':'выходя','入':'входя',
    '寝':'засыпая','起':'просыпаясь','始ま':'начиная','終':'кончая','つづけ':'продолжая',
    '勉強':'занимаясь', '読':'читая','休':'отдыхая','そうじ':'убираясь','洗たく':'стирая','練習':'делая задание',
    'たいそう':'занимаясь гимнастикой','遊':'играя','散歩':'гуляя','しゃしんをと':'фотографируя','歌':'во время пения','料理':'готовя','眠':'во время сна',
    '習':'учась','読':'читая','書':'во время написания','飲':'во время питья','食':'во время еды','見':'смотря','聞_1':'слушая','練習':'делая задание',
        'なお':'исправляя','買':'покупая','ちゅうもん':'заказывая','持って来':'принеся','しめ':'закрывая','探':'в поисках','作':'делая','借り':'беря взаймы','かえ':'возвращая',
    'い':'находясь','あ':'находясь','飾':'украшая','包':'заворачивая','放':'отпуская',
    '答え':'отвечая','電話':'звоня','質問':'спрашивая','聞_2':'спрашивая','言':'говоря',
    '話':'разговаривая','会':'встречаясь','勉強':'занимаясь','遊':'играя','散歩':'гуляя','やくそ':'договариваясь','わかれ':'расставаясь',
    'みが':'чистя','洗':'умываясь','走':'бегая','シャワーをあび':'принимая душ','着がえ':'переодеваясь','着':'одеваясь',
    '教え':'объясняя', 'す':'делая'
},
'glag_verb_stem':{
    '行':'ходить','帰':'возвращаться','歩いて行':'ходить пешком','とお':'проходить',
    '出かれ':'выходить','入':'входить',
    '寝':'засыпать','起':'просыпаться','始ま':'начинаться','終':'кончаться','つづけ':'продолжать',
    '勉強':'заниматься', '読':'читать','休':'отдыхать','そうじ':'убирать','洗たく':'стирать','練習':'делать задание','たいそう':'заниматься гимнастикой',
    '遊':'играть','散歩':'гулять','しゃしんをと':'фотографировать','歌':'петь','料理':'готовить','眠':'спать',
    '習':'учить','読':'читать','書':'писать','飲':'пить','食':'есть','見':'смотреть','聞_1':'слушать','練習':'делать задание',
        'なお':'исправлять','買':'покупать','ちゅうもん':'заказывать','持って来':'приносить','しめ':'закрывать','探':'искать','作':'делать','借り':'брать взаймы','かえ':'вернуть',
    'い':'находиться','あ':'находиться','飾':'украшать','包':'заворачивать','放':'отпускать',
    '答え':'отвечать','電話':'звонить','質問':'спрашивать','聞_2':'спрашивать','言':'говорить',
    '話':'говорить','会':'встречаться','勉強':'заниматься','遊':'играть','散歩':'гулять','やくそ':'договариваться','わかれ':'расставаться',
    'みが':'чистить','洗':'мыться','走':'бегать','シャワーをあび':'принимать душ','着がえ':'переодеваться','着':'одеваться',
    '教え':'объяснять', 'す':'делать'
},

'glag_verb_stem_2':{
        '行':'пойти','帰':'вернуться','歩いて行':'пойти пешком','とお':'пройти',
        '出かれ':'выйти','入':'войти',
        '寝':'пойти спать','起':'проснуться','始ま':'начать','終':'закончить','つづけ':'продолжить',
        '勉強':'заняться', '読':'почитать','休':'отдохнуть','そうじ':'убраться','洗たく':'постирать','練習':'сделать задание',
        'たいそう':'заняться гимнастикой','遊':'поиграть','散歩':'погулять','しゃしんをと':'сфотографировать','歌':'спеть','料理':'приготовить','眠':'поспать',
        '習':'выучить','読':'прочитать','書':'написать','飲':'выпить','食':'поесть','見':'посмотреть','聞_1':'послушать','練習':'сделать задание',
        'なお':'исправить','買':'купить','ちゅうもん':'заказать','持って来':'принести','しめ':'закрыть','探':'найти','作':'сделать','借り':'взять взаймы','かえ':'возвращать',
        'い':'находиться','あ':'находиться','飾':'украсить','包':'завернуть','放':'отпустить',
        '答え':'ответить','電話':'позвонить','質問':'спросить','聞_2':'спросить','言':'сказать',
        '話':'поговорить','会':'встретиться','勉強':'заняться','遊':'поиграть','散歩':'погулять','やくそ':'договориться','わかれ':'расстаться',
        'みが':'почистить','洗':'помыться','走':'побегать','シャワーをあび':'принять душ','着がえ':'переодеться','着':'одеться',
        '教え':'объяснить', 'す':'сделать'
},
'glag_im_going_todo':{
    '行':'поеду','帰':'вернусь','歩いて行':'пойду пешком','とお':'пройду',
    '出かれ':'выйду','入':'войду',
    '寝':'пойду спать','起':'проснусь','始ま':'начну','終':'закончу','つづけ':'продолжу',
    '勉強':'позанимаюсь', '読':'почитаю','休':'отдыхну','そうじ':' приберусь','洗たく':'постираю','練習':'сделаю задание',
    'たいそう':'занимаюсь гимнастикой','遊':'поиграю','散歩':'погуляю','しゃしんをと':'пофотографирую','歌':'спою','料理':'поготовлю','眠':'посплю',
    '習':'поучусь','読':'почитаю','書':'напишу','飲':'попью','食':'поем','見':'посмотрю','聞_1':'послушаю','練習':'сделаю задание',
      'なお':'исправлю','買':'куплю','ちゅうもん':'закажу','持って来':'принесу','しめ':'закрою','探':'поищу','作':'сделаю','借り':'возьму взаймы','かえ':'верну',
    'い':'буду находиться','あ':'буду находиться','飾':'украшу','包':'заверну','放':'отпущу',
    '答え':'отвечу','電話':'позвоню','質問':'спрошу','聞_2':'спрошу','言':'скажу',
    '話':'поговорю','会':'встречусь','勉強':'позанимаюсь','遊':'поиграю','散歩':'погуляю','やくそ':'договорюсь','わかれ':'расстанусь',
    'みが':'почищу','洗':'помоюсь','走':'побегаю','シャワーをあび':'приму душ','着がえ':'переоденусь','着':'одену',
    '教え':'объясню', 'す':'сделаю'
},

'glag_im_doing':{
    '行':'езжу','帰':'возвращаюсь','歩いて行':'иду пешком','とお':'прохожу',
    '出かれ':'выхожу','入':'вхожу',
    '寝':'сплю','起':'просыпаюсь','始ま':'начинаю','終':'заканчиваю','つづけ':'продолжаю',
    '勉強':'занимаюсь', '読':'читаю','休':'отдыхаю','そうじ':'убираюсь','洗たく':'стираю','練習':'делаю задание',
    'たいそう':'занимаюсь гимнастикой','遊':'играю','散歩':'гуляю','しゃしんをと':'фотографирую','歌':'пою','料理':'готовлю','眠':'сплю',
    '習':'учусь','読':'читаю','書':'пишу','飲':'пью','食':'ем','見':'смотрю','聞_1':'слушаю','練習':'делаю задание',
        'なお':'исправляю','買':'покупаю','ちゅうもん':'заказываю','持って来':'принесу','しめ':'закрываю','探':'ищу','作':'делаю','借り':'беру взаймы','かえ':'возвращаю',
    'い':'нахожусь','あ':'нахожусь','飾':'украшаю','包':'заворачиваю','放':'отпускаю',
    '答え':'отвечаю','電話':'звоню','質問':'спрашиваю','聞_2':'спрашиваю','言':'говорю',
    '話':'говорю','会':'встречаюсь','勉強':'занимаюсь','遊':'играю','散歩':'гуляю','やくそ':'договариваюсь','わかれ':'расстаюсь',
    'みが':'чищу','洗':'моюсь','走':'бегаю','シャワーをあび':'принимаю душ','着がえ':'переодеваюсь','着':'одеваюсь',
    '教え':'объясняю', 'す':'делаю'
},

'glag_passive_eba':{'習':'изучен(а)','読':'прочитан(а)','書':'написан(а)','飲':'выпит(а)','食':'съеден(а)','見':'увиден(а)','聞_1':'прослушан(а)','練習':'сделана(позанимались с этим)','そうじ':'убран(а)','なお':'исправлен(а)',
                  '買':'куплен(а)','ちゅうもん':'заказн(а)','しめ':'закрыт(а)','探':'найден(а)','作':'изготовлен(а)','借り':'занят(а)','かえ':'возвращен(а)','持って来':'принесен(а)',
                  'しゃしんをと':'сфотографирован(а)','教え':'объяснен(а)','飾':'украшен(а)','包':'завернут(а)','放':'выпущен(а)',
                  '書':'написан (ему написали)','答え':'отвечен (ему ответили)','電話':'позвонен (ему позвонили)','質問':'спрошен (его спросили)','聞_2':'спрошен (его спросили, второй вариант глагола)','言':'говорен (ему сказали)',
                  'す':'сделан(а)'},
                  
'keigo_dict':  {
    '見': ['ご覧になる', 'ごらんになる'],
    '言': ['おっしゃる', 'おっしゃる'],
    '食': ['召し上がる', 'めしあがる'],
    '飲': ['召し上がる', 'めしあがる'],
    '来': ['いらっしゃる', 'いらっしゃる'],
    '行': ['いらっしゃる', 'いらっしゃる'],
    '居': ['いらっしゃる', 'いらっしゃる'],
    '寝': ['お休みになる', 'おやすみになる'],
    '知': ['ご存知でいらっしゃる', 'ごぞんじでいらっしゃる'],
    '貰': ['いただく', 'いただく'],
    'す': ['なさる', 'なさる'],
    '思': ['思し召す', 'おぼしめす'],
},

'keigo_dict_me':  {
    '見': ['拝見する', 'はいけんする'],
    '言': ['申し上げる', 'もうしあげる'],
    '食': ['いただく', 'いただく'],
    '飲': ['いただく', 'いただく'],
    '来': ['参る', 'まいる'],
    '行': ['参る', 'まいる'],
    '居': ['おる', 'おる'],
    '知': ['存じる', 'ぞんじる'],
    '会': ['お目にかかる', 'おめにかかる'],
    '待': ['お待ちする', 'おまちする'],
    'す': ['いたす', 'いたす'],
    '思': ['存じる', 'ぞんじる'],
    '聞': ['伺う', 'うかがう'],
    '訪': ['伺う', 'うかがう'],
    '書': ['お書きする', 'おかきする'],
    '与': ['差し上げる', 'さしあげる'],
    '貰': ['いただく', 'いただく'],
    '見': ['お目にかける', 'おめにかける'],
    '尋': ['伺う', 'うかがう'],
    '教': ['ご説明する', 'ごせつめいする']
},

'kango_verbs':['勉強','そうじ','電話','質問','練習','ちゅうもん','散歩','洗たく','料理'
],

'glag_form' : {'行':{1:'か',2:'き',3:'く',4:'け',5:'こう',6:'って',7:'いた'},
             '帰':{1:'ら',2:'り',3:'る',4:'れ',5:'ろう',6:'って',7:'った'},
             '歩いて行':{1:'か',2:'き',3:'く',4:'け',5:'こう',6:'いて',7:'いた'},
             '寝':{1:'',2:'',3:'る',4:'れ',5:'よう',6:'て',7:'た'},
             '起':{1:'',2:'',3:'る',4:'れ',5:'よう',6:'て',7:'た'},
             '勉強':{1:'さ(せ)',2:'し',3:'する',4:'しれ',5:'しょう',6:'して',7:'した'},
             '始ま':{1:'ら',2:'り',3:'る',4:'れ',5:'ろう',6:'って',7:'った'},
            '終':{1:'ら',2:'り',3:'る',4:'れ',5:'ろう',6:'って',7:'った'},   
            '習':{1:'わ',2:'い',3:'う',4:'え',5:'おう',6:'って',7:'った'},
             '読':{1:'ま',2:'み',3:'む',4:'め',5:'もう',6:'んで',7:'んだ'},
             '書':{1:'か',2:'き',3:'く',4:'け',5:'こう',6:'いて',7:'いた'},
             'い':{1:'',2:'',3:'る',4:'れ',5:'よう',6:'て',7:'た'},
            'あ':{1:'',2:'り',3:'る',4:'れ',5:'ろう',6:'って',7:'った'},
            '休':{1:'ま',2:'み',3:'む',4:'め',5:'みょう',6:'んで',7:'んだ'},
            'そうじ':{1:'さ(せ)',2:'し',3:'する',4:'すれ',5:'しょう',6:'して',7:'した'},
            '飲':{1:'ま',2:'み',3:'む',4:'め',5:'もう',6:'んで',7:'んだ'},
            '食':{1:'',2:'',3:'る',4:'れ',5:'よう',6:'て',7:'た'},
            '見':{1:'',2:'',3:'る',4:'れ',5:'よう',6:'て',7:'た'},
            '聞':{1:'か',2:'き',3:'く',4:'け',5:'きょう',6:'いて',7:'いた'},
            '答え':{1:'',2:'',3:'る',4:'れ',5:'よう',6:'て',7:'た'},
            '電話':{1:'さ(せ)',2:'し',3:'する',4:'すれ',5:'しょう',6:'して',7:'した'},
            '質問':{1:'さ(せ)',2:'し',3:'する',4:'すれ',5:'しょう',6:'して',7:'した'},
            '練習':{1:'さ(せ)',2:'し',3:'する',4:'すれ',5:'しょう',6:'して',7:'した'},
            'なお':{1:'さ',2:'し',3:'す',4:'せ',5:'しょう',6:'して',7:'した'},
            '買':{1:'わ',2:'い',3:'う',4:'え',5:'おう',6:'って',7:'った'},
            'ちゅうもん':{1:'さ(せ)',2:'し',3:'する',4:'すれ',5:'しょう',6:'して',  7:'した'},
            '持って来':{1:'',2:'',3:'る',4:'れ',5:'よう',6:'て',7:'た'},
            'しめ':{1:'',2:'',3:'る',4:'れ',5:'よう',6:'て',7:'た'},
            'たいそう':{1:'さ(せ)',2:'し',3:'する',4:'すれ',5:'しょう',6:'して',7:'した'},
            '遊':{1:'ば',2:'び',3:'ぶ',4:'べ',5:'びょう',6:'んで',7:'んだ'},
            '散歩':{1:'さ(せ)',2:'し',3:'する',4:'すれ',5:'しょう',6:'して',7:'した'},
            '洗たく':{1:'さ(せ)',2:'し',3:'する',4:'すれ',5:'しょう',6:'して',7:'した'},
            'とお':{1:'ら',2:'り',3:'る',4:'れ',5:'ろう',6:'って',7:'った'},
            'しゃしんをと':{1:'ら',2:'り',3:'る',4:'れ',5:'ろう',6:'って',7:'った'},
            '話':{1:'さ',2:'し',3:'す',4:'せ',5:'しょう',6:'して',7:'した'},
            '会':{1:'わ',2:'い',3:'う',4:'え',5:'おう',6:'って',7:'った'},
            'やくそ':{1:'か',2:'き',3:'く',4:'け',5:'こう',6:'いて',7:'いた'},
            'わかれ':{1:'',2:'',3:'る',4:'れ',5:'よう',6:'て',7:'た'},
            '探':{1:'さ',2:'し',3:'す',4:'せ',5:'しょう',6:'して',7:'した'},
            'あげ':{1:'',2:'',3:'る',4:'れ',5:'よう',6:'て',7:'た'},
            'さしあげ':{1:'',2:'',3:'る',4:'れ',5:'よう',6:'て',7:'た'},
            'や':{1:'ら',2:'り',3:'る',4:'れ',5:'ろう',6:'って',7:'った'},
            'くれ':{1:'',2:'',3:'る',4:'れ',5:'よう',6:'て',7:'た'},
            'くださ': {1:'',2:'い',3:'る',4:'れ',5:'よう',6:'て',7:'た'},
            'もら':{1:'わ',2:'い',3:'う',4:'え',5:'おう',6:'って',7:'った'},
            'いただ':{1:'か',2:'き',3:'く',4:'け',5:'きょう',6:'いて',7:'いた'},
            '出かれ':{1:'',2:'',3:'る',4:'れ',5:'よう',6:'て',7:'た'},
            '入':{1:'ら',2:'り',3:'る',4:'れ',5:'ろう',6:'って',7:'った'},
            '言':{1:'わ',2:'い',3:'う',4:'え',5:'おう',6:'って',7:'った'},
            '歌':{1:'わ',2:'い',3:'う',4:'え',5:'おう',6:'って',7:'った'},
            '料理':{1:'さ(せ)',2:'し',3:'する',4:'すれ',5:'しょう',6:'して',7:'した'},
            '作':{1:'ら',2:'り',3:'る',4:'れ',5:'ろう',6:'って',7:'った'},
            '借り':{1:'',2:'',3:'る',4:'れ',5:'よう',6:'て',7:'た'},
            '洗':{1:'わ',2:'い',3:'う',4:'え',5:'おう',6:'って',7:'った'},
            'みが':{1:'か',2:'き',3:'く',4:'け',5:'きょう',6:'いて',7:'いた'},
            'かえ':{1:'さ',2:'し',3:'す',4:'せ',5:'しょう',6:'して',7:'した'},
            '走':{1:'ら',2:'り',3:'る',4:'れ',5:'ろう',6:'って',7:'った'},
            'シャワーをあび':{1:'',2:'い',3:'る',4:'れ',5:'よう',6:'て',7:'た'},
            '着がえ':{1:'',2:'',3:'る',4:'れ',5:'よう',6:'て',7:'た'},
            '着':{1:'',2:'',3:'る',4:'れ',5:'よう',6:'て',7:'た'},
            '眠':{1:'ま',2:'み',3:'む',4:'め',5:'もう',6:'んで',7:'んだ'},
            '教え':{1:'',2:'',3:'る',4:'れ',5:'よう',6:'て',7:'た'},
            'つづけ':{1:'',2:'',3:'る',4:'れ',5:'よう',6:'て',7:'た'},
            '飾':{1:'ら',2:'り',3:'る',4:'れ',5:'ろう',6:'って',7:'った'},
            '包':{1:'ま',2:'み',3:'む',4:'め',5:'もう',6:'んで',7:'んだ'},
            '放':{1:'さ',2:'し',3:'す',4:'せ',5:'しょう',6:'して',7:'した'},
            'す':{1:'',2:'',3:'る',4:'れ',5:'よう',6:'て',7:'た'},
             },

'glagol_2_conjugation':['つづけ','教え','着','借り','出かれ','くれ','わかれ','しめ','持って来','答え','見','食','起','寝'],

# Переходные глаголы:
'transitive_glagols':['とお', '出かれ', '入', 'つづけ', '勉強', '読', '休', 'そうじ', '練習', '洗たく', '遊', 'しゃしんをと', '歌', '料理', '習', '読', '書', '飲', '食', '見', '聞_1', '練習', 'なお', '買', 'ちゅうもん', '持って来', 'しめ', '探', '作', '借り', 'かえ', '飾', '包', '放', '答え', '電話', '質問', '聞_2', '言', '話', '会', '勉強', '遊', 'やくそ', 'わかれ', 'みが', '洗', '着', '教え'],
'transitive_glagols_hir' : {'とお':'とお','出かれ':'でかけ','入':'はい','つづけ':'つづけ','勉強':'べんきょう','読':'よ','休':'やす','そうじ':'そうじ','練習':'れんしゅう','洗たく':'せんたく','遊':'あそ','しゃしんをと':'しゃしんをと','歌':'うた','料理':'りょうり','習':'なら','読':'よ','書':'か','飲':'の','食':'た','見':'み','聞_1':'き','練習':'れんしゅう','なお':'なお','買':'か','ちゅうもん':'ちゅうもん','持って来':'もってく','しめ':'しめ','探':'さが','作':'つく','借り':'か','かえ':'かえ','飾':'かざ','包':'つつ','放':'はな','答え':'こたえ','電話':'でんわ','質問':'しつもん','聞_2':'き','言':'い','話':'はな','会':'あ','勉強':'べんきょう','遊':'あそ','やくそ':'やくそ','わかれ':'わかれ','みが':'みが','洗':'あら','着':'き','教え':'おし'},

# Непереходные глаголы:
'intransitive_glagols':['行', '歩いて行', '寝', '起', '始ま', '終', 'たいそう', '散歩', '眠', '散歩', '走', 'シャワーをあび', '着がえ'],
'intransitive_glagols_hir': {'行':'い','歩いて行':'あるいてい','寝':'ね','起':'お','始ま':'はじま','終':'おわ','たいそう':'たいそう','散歩':'さんぽ','眠':'ねむ','散歩':'さんぽ','走':'はし','シャワーをあび':'シャワーをあび','着がえ':'きがえ'},

'glag_accusative':{
    '読':{'本':'книгу','新聞':'газету','手紙':'письмо','漫画':'мангу','ざっし':'журнал','辞書':'словарь','小説':'роман','文章':'текст',},
    '書':{'手紙':'письмо','手紙':'письмо'},
    '習':{'日本語':'японский язык','漢字':'кандзи','ひらがな':'хирагану','文法':'грамматику','日本事情': 'японские ситуации','発音':'произношение','会話':'разговоры','文化':'культуру','言葉':'слова'},
    '飲':{'お茶':'чай','コーヒー':'кофе','ビール':'пиво','ワイン':'вино','水':'воду','ジュース':'сок'},
    '食':{'ご飯':'рис','パン':'хлеб','肉':'мясо','魚':'рыбу','野菜':'овощи','果物':'фрукты'},
    '見':{'映画':'фильм','ビデオ':'видео','写真':'фотографию','絵':'картину'},
    '聞_1':{'音楽':'музыку','歌':'песню','話し':'рассказ','ニュース':'новости','先生': 'преподавателя','講義':'лекцию'},
    '練習':{'漢字':'по кандзи','ひらがな':'по хирагане','文法':'по грамматике','日本事情': 'по японским ситуациям','発音':'по произношению'},
    'そうじ':{'部屋':'комнату','家':'дом','机':'стол','本棚':'книжную полку','庭':'сад','茶の間':'гостиную','台所':'кухню'},
    'なお':{'間違い':'ошибку','質問':'вопрос','宿題':'домашнее задание','答え':'ответ','文法':'грамматику','発音':'произношение'},
    '買':{'本':'книгу','新聞':'газету','漫画':'мангу','ざっし':'журнал','辞書':'словарь','お茶':'чай','コーヒー':'кофе','ケーキ':'торт','果物':'фрукты','辞典':'словарь','服':'одежду'},
    'ちゅうもん':{'お茶':'чай','コーヒー':'кофе','ケーキ':'торт','果物':'фрукты'},
    '持って来':{'お茶':'чай','コーヒー':'кофе','ケーキ':'торт','果物':'фрукты'},
    'しめ':{'教室':'класс','食堂':'столовую','図書館':'библиотеку','部屋':'комнату','台所':'кухню','ドア':'дверь'},
    '作':{'料理':'блюда','ビデオ':'видео','写真':'фотографию','絵':'картину','漫画':'мангу','服':'одежду','食べ物':'еду','ジャム':'варенье','ケーキ':'торт'},
    '借り':{'本':'книгу','新聞':'газету','漫画':'мангу','ざっし':'журнал','辞書':'словарь','服':'одежду','お金':'деньги'},
    '洗':{'服':'одежду','頭':'голову', '顔': 'лицо'},
    'みが':{'部屋':'комнату','机':'стол','本棚':'книжную полку','歯':'зубы','服':'одежду'},
    'かえ':{'本':'книгу','新聞':'газету','漫画':'мангу','ざっし':'журнал','辞書':'словарь','服':'одежду','お金':'деньги'},
    '着':{ '着物':'кимоно','ゆかた': 'юката'},
    '探':{'本':'книгу','新聞':'газету','漫画':'мангу','ざっし':'журнал','辞書':'словарь','服':'одежду'},
    '教え':{'文法':'грамматику','漢字':'кандзи','発音':'произношение'},
    'しゃしんをと':{'写真':'фотографию','絵':'картину','海':'море','山':'гору','川':'реку','花':'цветок','動物':'животное','鳥':'птицу'},
    '飾':{'部屋':'комнату','家':'дом','机':'стол','本棚':'книжную полку','庭':'сад','茶の間':'гостиную','台所':'кухню'},
    '放':{'ねこ':'кошку','いぬ':'собаку', '魚':'рыбу','鳥':'птицу','こい':'карпа','からす':'ворону','白鳥':'лебедя'},
    '包':{'プレゼント':'подарок','手紙':'письмо','本':'книгу','漫画':'мангу','ざっし':'журнал','辞書':'словарь','服':'одежду','果物':'фрукты','お金':'деньги'},
    'す':{'宿題':'домашнее задание','掃除':'уборку','洗濯':'стирку','料理':'готовку','買い物':'покупки','運動':'занятия спортом',}
},

'glag_accusative_hir':{
    '読':{'本':'ほん','新聞':'しんぶん','手紙':'てがみ','漫画':'まんが','ざっし':'ざっし','辞書':'じしょ','小説':'しょうせつ','文章':'ぶんしょう',},
    '書':{'手紙':'てがみ','漫画':'まんが','ざっし':'ざっし','手紙':'てがみ'},
    '習':{'日本語':'にほんご','漢字':'かんじ','ひらがな':'ひらがな','文法':'ぶんぽう','日本事情': 'にほんじじょう','発音':'はつおん','会話':'かいわ','文化':'ぶんか','言葉':'ことば'},
    '飲':{'お茶':'おちゃ','コーヒー':'コーヒー','ビール':'ビール','ワイン':'ワイン','水':'みず','ジュース':'ジュース'},
    '食':{'ご飯':'ごはん','パン':'パン','肉':'にく','魚':'さかな','野菜':'やさい','果物':'くだもの'},
    '見':{'映画':'えいが','ビデオ':'ビデオ','写真':'しゃしん','絵':'え'},
    '聞_1':{'音楽':'おんがく','ラジオ':'ラジオ','歌':'うた','話し':'はなし','ニュース':'ニュース','先生': 'せんせい','講義':'こうぎ'},
    '練習':{'漢字':'かんじ','ひらがな':'ひらがな','文法':'ぶんぽう','日本事情': 'にほんじじょう','発音':'はつおん'},
    'そうじ':{'部屋':'へや','家':'いえ','机':'つくえ','本棚':'ほんだな','庭':'にわ','茶の間':'ちゃのま','台所':'だいどころ'},
    'なお':{'間違い':'まちがい','質問':'しつもん','宿題':'しゅくだい','答え':'こたえ','文法':'ぶんぽう','発音':'はつおん'},
    '買':{'本':'ほん','新聞':'しんぶん','漫画':'まんが','ざっし':'ざっし','辞書':'じしょ','お茶':'おちゃ','コーヒー':'コーヒー','ケーキ':'ケーキ','果物':'くだもの','辞典':'じてん','服':'ふく'},
    'ちゅうもん':{'お茶':'おちゃ','コーヒー':'コーヒー','ケーキ':'ケーキ','果物':'くだもの'},
    '持って来':{'お茶':'おちゃ','コーヒー':'コーヒー','ケーキ':'ケーキ','果物':'くだもの'},
    'しめ':{'教室':'きょうしつ','食堂':'しょくどう','図書館':'としょかん','部屋':'へや','台所':'だいどころ','ドア':'ドア'},
    '作':{'料理':'りょうり','ビデオ':'ビデオ','写真':'しゃしん','絵':'え','漫画':'まんが','服':'ふく','食べ物':'たべもの','ジャム':'ジャム','ケーキ':'ケーキ'},
    '借り':{'本':'ほん','新聞':'しんぶん','漫画':'まんが','ざっし':'ざっし','辞書':'じしょ','服':'ふく','お金':'おかね'},
    '洗':{'服':'ふく','頭':'あたま','顔': 'かお'},
    'みが':{'部屋':'へや','机':'つくえ','本棚':'ほんだな','歯':'は','服':'ふく'},
    'かえ':{'本':'ほん','新聞':'しんぶん','漫画':'まんが','ざっし':'ざっし','辞書':'じしょ','服':'ふく','お金':'おかね'},
    '着':{ '着物':'きもの','ゆかた': 'ゆかた'},
    '探':{'本':'ほん','新聞':'しんぶん','漫画':'まんが','ざっし':'ざっし','辞書':'じしょ','服':'ふく'},
    '教え':{'文法':'ぶんぽう','漢字':'かんじ','発音':'はつおん'},
    'しゃしんをと':{'写真':'しゃしん','絵':'え','海':'うみ','山':'やま','川':'かわ','花':'はな','動物':'どうぶつ','鳥':'とり'},
    '飾':{'部屋':'へや','家':'いえ','机':'つくえ','本棚':'ほんだな','庭':'にわ','茶の間':'ちゃのま','台所':'だいどころ'},
    '放':{'ねこ':'ねこ','いぬ':'いぬ', '魚':'さかな','鳥':'とり','こい':'こい','からす':'からす','白鳥':'はくちょう'},
    '包':{'プレゼント':'プレゼント','手紙':'てがみ','本':'ほん','漫画':'まんが','ざっし':'ざっし','辞書':'じしょ','服':'ふく','果物':'くだもの','お金':'おかね'},
    'す':{'宿題':'しゅくだい','掃除':'そうじ','洗濯':'せんたく','料理':'りょうり','買い物':'かいもの','運動':'うんどう',}
},

'glag_instrument':{
    '書':{'ペン':'ручкой','鉛筆':'карандашом','筆':'кистью','ひらがな':'хираганой','漢字':'иероглифами'},
    '食':{'はし':'палочками','スプーン':'ложкой','フォーク':'вилкой'},
    '聞_1':{'ラジオ':'по радио','テレビ':'по телевизору'},
    '勉強':{'辞典':'по словарю','ビデオ:':'по видео','教科書':'по учебнику','自分':'сам'},
    '行':{'電車':'на поезде','バス':'на автобусе','自転車':'на велосипеде','電車':'на поезде','地下鉄':'на метро'},
    '作':{'自分':'сам',},
    '包':{'自分':'сам'},
    '習':{'教科書':'по учебнику', 'ビデо':'по видео', '辞典':'по словарю', '自分':'сам'}
},
'glag_instrument_hir':{
    '書':{'ペン':'ペン','鉛筆':'えんぴつ','筆':'ふで','ひらがな':'ひらがな','漢字':'かんじ'},
    '食':{'はし':'はし','スプーン':'スプーン','フォーク':'フォーク'},
    '聞_1':{'ラジオ':'ラジオ','テレビ':'テレビ'},
    '勉強':{'辞典':'じてん','ビデオ:':'ビデオ','教科書':'きょうかしょ','自分':'じぶん'},
    '行':{'電車':'でんしゃ','バス':'バス','自転車':'じてんしゃ','電車':'でんしゃ','地下鉄':'ちかてつ'},
    '作':{'自分':'じぶん',},
    '包':{'自分':'じぶん'},
    '習':{'教科書':'きょうかしょ', 'ビデо':'ビデオ', '辞典':'じてん', '自分':'じぶん'}
},

'instrument_osnova':{'ペン':'ручка','鉛筆':'карандаш','筆':'кисть','ひらがな':'хирагана','漢字':'иероглифы','はし':'палочки','スプーン':'ложка','フォーク':'вилка','ラジオ':'радио','テレビ':'телевизор','辞典':'словарь','ビデオ':'видео','教科書':'учебник','自分':'сам','電車':'поезд','バス':'автобус','自転車':'велосипед','地下鉄':'метро'},

'glag_instrument_hir_for_glagoles' : {
    '書':'き','食':'たべ','聞_1':'き','勉強':'べんっきょう','行':'い','作':'つく','包':'つつ','習':'なら',
},

'glag_place_small':{
        '書':{'手紙':'на бумаге','ノート':'в тетради','黒板':'на доске'}
},
'glag_place_small_hir':{
        '書':{'手紙':'てがみ','ノート':'ノート','黒板':'こくばん'}
},

# Для времени
'posleslogi' : {'の前に':"до","の後で": "после"},
'posleslogi_hir': {'の前に': "のまえに", "の後で": "のあとで"},

'time_fut' : {'budush':{ '今日':'сегодня','明日':'завтра','明後日':'послезавтра','朝':'утром','今夜':'вечером','今晩':'ночью','来週':'на следующей неделе','夕方': 'во время заката','平日':'в будни','週末':'в выходные'},
              'past':{ '昨日':'вчера','一昨日':'позавчера','今朝':'утром','夜':'вечером','晩':'ночью','先週':'на прошлой неделе','夕方': 'во время заката','平日':'в будний день','週末':'в выходной'}
   },

'time_fut_hir': {
    'budush': {'今日': 'きょう', '明日': 'あした', '朝': 'あさ',  '今夜': 'こんや', '今晩': 'こんばん', '明後日': 'あさって', '来週': 'らいしゅう', '夕方': 'ゆうがた', '平日': 'へいじつ', '週末': 'しゅうまつ'},
    'past': {'昨日': 'きのう', '一昨日': 'おととい', '今朝': 'けさ',  '夜': 'よる', '晩': 'ばん', '先週': 'せんしゅう', '夕方': 'ゆうがた', '平日': 'へいじつ', '週末': 'しゅうまつ'}
},

'time_at':{'平日に':'по будням','週末に':'по выходным','毎日':'каждый день','朝':'по утрам','昼間に':'в дневное время','晩':'по вечерам','夜':'по ночам'},
'time_at_hir':{'平日に':'へいじつに','週末に':'しゅうまつに','毎日':'まいにち','朝':'あさ','昼間に':'ひるまに','晩':'ばん','夜':'よる'},

'hours' : {
    '午前':{'一時':'1','二時':'2','三時':'3','四時':'4','五時':'5','六時':'6','七時':'7','八時':'8','九時':'9','十時':'10','十一時':'11','十二時':'12'},
    '午後':{'一時':'13','二時':'14','三時':'15','四時':'16','五時':'17','六時':'18','七時':'19','八時':'20','九時':'21','十時':'22','十一時':'23', '十二時':'24'}
         },
'hours_hir': {
        '午前': {'一時': 'いちじ', '二時': 'にじ', '三時': 'さんじ', '四時': 'よじ', '五時': 'ごじ', '六時': 'ろくじ', '七時': 'しちじ',
                '八時': 'はちじ', '九時': 'くじ', '十時': 'じゅうじ', '十一時': 'じゅういちじ', '十二時': 'じゅうにじ'},
        '午後': {'一時': 'いちじ', '二時': 'にじ', '三時': 'さんじ', '四時': 'よじ', '五時': 'ごじ', '六時': 'ろくじ', '七時': 'しちじ',
                '八時': 'はちじ', '九時': 'くじ', '十時': 'じゅうじ', '十一時': 'じゅういちじ', '十二時': 'じゅうにじ'}
},
'hours_rus' : {
    '午前':{'一時':'час','二時':'часа','三時':'часа','四時':'часа','五時':'часов','六時':'часов','七時':'часов','八時':'часов','九時':'часов','十時':'часов','十一時':'часов','十二時':'часов'},
    '午後':{'一時':'часов','二時':'часов','三時':'часов','四時':'часов','五時':'часов','六時':'часов','七時':'часов','八時':'часов','九時':'час','十時':'часа','十一時':'часа', '十二時':'часа'}
         },
'noon_hir': {'午前': 'ごぜん', '午後': 'ごご'},
'hours_rus_day':{'一時':'ночи','二時':'ночи','三時':'ночи','四時':'утра','五時':'утра','六時':'утра','七時':'утра','八時':'утра',
                 '九時':'утра','十時':'утра','十一時':'дня','十二時':'дня'},
'hours_han':{
    '一時':'первого','二時':'второго','三時':'третьего','四時':'четвертого','五時':'пятого','六時':'шестого','七時':'седьмого','八時':'восьмого','九時':'девятого','十時':'десятого','十一時':'одиннадцатого','十二時':'двенадцатого'
},
'week':{
    '月曜日':'понедельник','火曜日':'вторник','水曜日':'среда','木曜日':'четверг','金曜日':'пятница','土曜日':'суббота','日曜日':'воскресенье'}
    ,
'week_hir':{
    '月曜日':'げつようび','火曜日':'かようび','水曜日':'すいようび','木曜日':'もくようび','金曜日':'きんようび','土曜日':'どようび','日曜日':'にちようび'
},
'weeK_ending':{
    '月曜日':'понедельник','火曜日':'вторник','水曜日':'среду','木曜日':'четверг','金曜日':'пятницу','土曜日':'субботу','日曜日':'воскресенье'
},
'mounths':{
    '一月':'январь','二月':'февраль','三月':'март','四月':'апрель','五月':'май','六月':'июнь','七月':'июль','八月':'август','九月':'сентябрь','十月':'октябрь','十一月':'ноябрь','十二月':'декабрь'
},
'mounths_hir':{
    '一月':'いちがつ','二月':'にがつ','三月':'さんがつ','四月':'しがつ','五月':'ごがつ','六月':'ろくがつ','七月':'しちがつ','八月':'はちがつ','九月':'くがつ','十月':'じゅうがつ','十一月':'じゅういちがつ','十二月':'じゅうにがつ'
},

# Свойства словарей
'adj_for_buildings' : {
    '学校': {'中':'средняя', '小':'младшая', '新し':'новая', '古':'старая','りっぱ':'отличная','すてき':'прекрасная','ゆう名':'знаменитая','けっこう':'превосходная'},
    '駅':{'浅草':'Асакуса','上野':'Уэно','新宿':'Синдзюку','渋谷':'Сибуя','池袋':'Икебукуро','品川':'Синагава','秋葉原':'Акихабара'},
    '家':{'明子':'Акико','石田':'Исида','三木':'Мики','中村':'Накамура','富山':'Тояма'},
    '公園':{'上野':'Уэно','新宿':'Синдзюку','渋谷':'Сибуя','池袋':'Икебукуро','品川':'Синагава','秋葉原':'Акихабара','りっぱ':'отличный','すてき':'прекрасный','ゆう名':'знаменитый','けっこう':'превосходный'},
    '大学':{'東京':'Токийский','大阪':'Осакский','京都':'Киотский','名古屋':'Нагоявский','神戸':'Кобеский','りっぱ':'отличный','すてき':'прекрасный','ゆう名':'знаменитый'},
    '図書館':{'大学':'университетская','公立':'городская','私立':'частная','国立':'государственный','学校':'школьная','りっぱ':'отличная','すてき':'прекрасная'},
    '銀行':{'三菱':'Мицубиси','三井':'Мицуи','住友':'Сумитомо','みずほ':'Мидзухо','りそな':'Рисона'},
    'パン屋':{'新し':'новая', '古':'старая','りっぱ':'отличная','すてき':'прекрасная'},
    'デパート':{'新し':'новый', '古':'старый','りっぱ':'отличный','すてき':'прекрасный'},
    '喫茶店':{'新し':'новое', '古':'старое','い':'хорошее','うるさ':'шумное','静か':'тихое','にぎやか':'оживленное','きれい':'чистое','きたな':'грязное','りっぱ':'отличное','すてき':'прекрасное','ゆう名':'знаменитое','けっこう':'превосходный'},
    '店':{'新し':'новый', '古':'старый','い':'хороший','うるさ':'шумный','静か':'тихий','にぎやか':'оживленный','きれい':'чистый','きたな':'грязный','りっぱ':'отличный','すてき':'прекрасный'},
    '博物館':{'東京':'Токийский','大阪':'Осакский','京都':'Киотский','神戸':'Кобеский','りっぱ':'отличный','すてき':'прекрасный','ゆう名':'знаменитый',
           '公立':'городской','私立':'частный','国立':'государственный','学校':'школьный','けっこう':'превосходный'},
    '寮':{'男子':'мужской','女子':'женский','りっぱ':'отличный','すてき':'прекрасный','ゆう名':'знаменитый'},
    '寺':{'新し':'новый', '古':'старый','い':'хороший','うるさ':'шумный','静か':'тихий','にぎやか':'оживленный','きれい':'чистый','すてき':'прекрасный'},
    '動物園':{'新し':'новый', '古':'старый','い':'хороший','うるさ':'шумный','にぎやか':'оживленный','きれい':'чистый','すてき':'прекрасный'},
    '部屋':{'新し':'новая', '広':'просторная','明る':'светлая',}

},
'adj_for_buildings_hir': {
    '学校': {'中': 'ちゅう', '小': 'しょう', '新しい': 'あたらしい', '古': 'ふるい', 'りっぱ': 'りっぱ', 'すてき': 'すてき', 'ゆう名': 'ゆうめ', 'けっこう': 'けっこう'},
    '駅': {'浅草': 'あさくさ', '上野': 'うえの', '東京': 'とうきょう', '新宿': 'しんじゅく', '渋谷': 'しぶや', '池袋': 'いけぶくろ',
              '品川': 'しながわ', '秋葉原': 'あきはばら'},
    '家': {'明子': 'あきこ', '石田': 'いしだ', '三木': 'みき', '中村': 'なかむら', '富山': 'とやま'},
    '公園': {'上野': 'うえの', '新宿': 'しんじゅく', '渋谷': 'しぶや', '池袋': 'いけぶくろ', '品川': 'しながわ', '秋葉原': 'あきはばら', 'りっぱ': 'りっぱ', 'すてき': 'すてき', 'ゆう名': 'ゆうめ', 'けっこう': 'けっこう'},
    '大学': {'東京': 'とうきょう', '大阪': 'おおさか', '京都': 'きょうと', '名古屋': 'なごや', '神戸': 'こうべ', 'りっぱ': 'りっぱ', 'すてき': 'すてき', 'ゆう名': 'ゆうめ'},
    '図書館': {'大学': 'だいがく', '公立': 'こうりつ', '私立': 'しりつ', '国立': 'こくりつ', '学校': 'がっこう', 'りっぱ': 'りっぱ', 'すてき': 'すてき'},
    '銀行': {'三菱': 'みつびし', '三井': 'みつい', '住友': 'すみとも', 'みずほ': 'みずほ', 'りそな': 'りそな'},
    'パン屋': {'新し': 'あたらし', '古': 'ふる', 'りっぱ': 'りっぱ', 'すてき': 'すてき'},
    'デパート': {'新し': 'あたらし', '古': 'ふる', 'りっぱ': 'りっぱ', 'すてき': 'すてき'},
    '喫茶店': {'新し': 'あたらし', '古': 'ふる', 'い': 'い', 'うるさ': 'うるさい', '静か': 'しずか', 'にぎやか': 'にぎやか','きれい':'きれい','きたな':'きたない','りっぱ': 'りっぱ', 'すてき': 'すてき', 'ゆう名': 'ゆうめ', 'けっこう': 'けっこう'},
    '店': {'新し': 'あたらし', '古': 'ふる', 'い': 'い', 'うるさ': 'うるさい', '静か': 'しずか', 'にぎやか': 'にぎやか', 'きれい': 'きれい','きたな':'きたない','りっぱ': 'りっぱ', 'すてき': 'すてき'},
    '博物館': {'東京': 'とうきょう', '大阪': 'おおさか', '京都': 'きょうと', '神戸': 'こうべ', 'りっぱ': 'りっぱ', 'すてき': 'すてき', 'ゆう名': 'ゆうめ',
            '公立': 'こうりつ', '私立': 'しりつ', '国立': 'こくりつ', '学校': 'がっこう', 'けっこう': 'けっこう'},
    '寮': {'男子': 'だんし', '女子': 'じょし', 'りっぱ': 'りっぱ', 'すてき': 'すてき', 'ゆう名': 'ゆうめ'},
    '寺': {'新し': 'あたらし', '古': 'ふる', 'い': 'い', 'うるさ': 'うるさい', '静か': 'しずか', 'にぎやか': 'にぎやか', 'きれい': 'きれい','すてき': 'すてき'},
    '動物園': {'新し': 'あたらし', '古': 'ふる', 'い': 'い', 'うるさ': 'うるさい', 'にぎやか': 'にぎやか', 'きれい': 'きれい','すてき': 'すてき'},
    '部屋': {'新し': 'あたらし', '広': 'ひろ', '明る': 'あかる'}
},
'adj_for_small_object':{
    'ざっし': {'新し':'новый', '古':'старый','面白':'интересный', '面倒':'скучный','い':'хороший','高':'дорогой','安':'дешевый'},
    'はこ': {'大き':'большой', '小さ':'маленький', '重':'тяжелый', '優し':'легкий','赤':'красный','青':'синий','黄色':'желтый','白':'белый','黒':'черный','茶色':'коричневый'},
    'かばん': {'重':'тяжелый', '優し':'легкий','新し':'новый', '古':'старый','赤':'красный','青':'синий','黄色':'желтый','白':'белый','黒':'черный','い':'хороший','茶色':'коричневый'},
    '辞典': {'日本語':"японского языка",'英語':"английского языка",'国語':'родного языка'},
    '辞書':{'高':'дорогой','安':'дешевый','い':'хороший'},
    '本':{ '面白':'интересная', '面倒':'скучная','い':'хорошая','高':'дорогая','安':'дешевая'},
    '鉛筆':{'新し':'новый','赤':'красный','青':'синий','黄色':'желтый','白':'белый','黒':'черный','みじかい':'короткий','ながい':'длинный','茶色':'коричневый'},
    '教科書':{'新し':'новый','むずかし':'сложный','やさし':'простой','い':'хороший','高':'дорогой','安':'дешевый'},
    '映画':{ '面白':'интересный', '面倒':'скучный','日本語':"японский",'英語':"английский",'フランス語':"французский",'い':'хороший','けっこう':'превосходный','りっぱ':'отличный','すてき':'прекрасный','ゆう名':'знаменитый',},
    'しゃしん':{ '面白':'интересная', '面倒':'скучная','花':'с цветами','山':'с горой','海':'с морем','鳥':'с птицами','川':'с рекой'},
    '新聞':{ '面白':'интересная', '面倒':'скучная','今日':'сегодняшняя','明日':'завтрашняя','昨日':'вчерашняя'},
    '傘':{ '赤':'красный','青':'синий','黄色':'желтый','白':'белый','黒':'черный','高':'дорогой','安':'дешевый','茶色':'коричневый'},
    'ins':{'広':'широкий','ひく':'низкий','高':'высокий','せま':'узкий','大き':'большой','小さ':'маленький','せま':'узкий','明る':'светлый','暗':'темный'},
    '電話':{ '新し':'новый', '古':'старый','赤':'красный','青':'синий','黄色':'желтый','白':'белый','黒':'черный','茶色':'коричневый'},
    '靴':{ '赤':'красная','青':'синяя','黄色':'желтая','白':'белая','黒':'черная','新し':'новая', '古':'старая','い':'хорошая','高':'дорогой','安':'дешевый','茶色':'коричневый'},
    '時計':{ '新し':'новые', '古':'старые','い':'хорошие','高':'дорогие','安':'дешевые'},
    'おかし':{'新し':'новые','おいし':'вкусные','まず':'невкусные','い':'хорошие','自家せい':'домашние'},
    '果物':{'新し':'новые','おいし':'вкусные','まず':'невкусные','い':'хорошие',},
    '地図':{'日本':"японскиая",'英':"английская",'新し':'новая','古':'старая','い':'хорошая','東京':'Токийская','大阪':'Осакская','京都':'Киотская'},
    '絵':{'新し':'новая','古':'старая','い':'хорошая','きれい':'красивая','大き':'большая','小さ':'маленькая','高':'дорогая','安':'дешевая'},
    '着物':{'新し':'новое','大き':'большое','高':'дорогое','すてき':'прекрасное','けっこう':'превосходное'},

},
'adj_for_small_object_hir':{
    'ざっし': {'新し':'あたらし', '古':'ふる','面白':'おもしろ', '面倒':'つまらな','い':'い','高':'たか','安':'やす'},
    'はこ': {'大き':'おおき', '小さ':'ちいさ', '重':'おも', '優し':'やさし','赤':'あか','青':'あお','黄色':'きいろ','白':'しろ','黒':'くろ','茶色':'ちゃいろ'},
    'かばん': {'重':'おも', '優し':'やさし','新し':'あたらし', '古':'ふる','赤':'あか','青':'あお','黄色':'きいろ','白':'しろ','黒':'くろ','い':'い','茶色':'ちゃいろ'},
    '辞典': {'日本語':"にほんご",'英語':"えいご",'国語':'こくご'},
    '辞書':{'高':'たか','安':'やす','い':'い'},
    '映画': {'日本語':"にほんご",'英語':"えいご",'フランス語':"ふらんすご",'面白':'おもしろ', '面倒':'つまらな','い':'い','けっこう':'けっこう','りっぱ':'りっぱ','すてき':'すてき','ゆう名':'ゆうめ'},
    '本':{ '面白':'おもしろ', '面倒':'つまらな','い':'い','高':'たか','安':'やす'},
    '鉛筆':{'新し':'あたらし','赤':'あか','青':'あお','黄色':'きいろ','白':'しろ','黒':'くろ','みじかい':'みじか','ながい':'ながい','茶色':'ちゃいろ'},
    '教科書':{'新し':'あたらし','むずかし':'むずかし','やさし':'やさし','い':'い','高':'たか','安':'やす'},
    'しゃしん':{ '面白':'おもしろ', '面倒':'つまらな','花':'はな','山':'やま','海':'うみ','鳥':'とり','川':'かわ'},
    '新聞':{ '面白':'おもしろ', '面倒':'つまらな','今日':'きょう','明日':'あした','昨日':'きのう'},
    '傘':{ '赤':'あか','青':'あお','黄色':'きいろ','白':'しろ','黒':'くろ','高':'たか','安':'やす','茶色':'ちゃいろ'},
    'ins':{'広':'ひろ','ひく':'ひく','高':'たか','せま':'せま','大き':'おおき','小さ':'ちいさ','せま':'せま','明る':'あかる','暗':'くら'},
    '電話':{ '新し':'あたらし', '古':'ふる','赤':'あか','青':'あお','黄色':'きいろ','白':'しろ','黒':'くろ','茶色':'ちゃいろ'},
    '靴':{ '赤':'あか','青':'あお','黄色':'きいろ','白':'しろ','黒':'くろ','新し':'あたらし', '古':'ふる','い':'い','高':'たか','安':'やす','茶色':'ちゃいろ'},
    '時計':{ '新し':'あたらし', '古':'ふる','い':'い','高':'たか','安':'やす'},
    'おかし':{'新し':'あたらし','おいし':'おいし','まず':'まず','い':'い','自家せい':'じかせい'},
    '果物':{'新し':'あたらし','おいし':'おいし','まず':'まず','い':'い',},
    '地図':{'日本':"にほん",'英':"えいご",'新し':'あたらし','古':'ふる','い':'い','東京':'とうきょう','大阪':'おおさか','京都':'きょうと'},
    '絵':{'新し':'あたらし','古':'ふる','い':'い','きれい':'きれい','大き':'おおき','小さ':'ちいさ','高':'たか','安':'やす'},
    '着物':{'新し':'あたらし','きれい':'きれい','大き':'おおき','高':'たか','すてき':'すてき','けっこう':'けっこう'},
},
'adj_rooms_si':{
    'positive':{'広い':'широкие','高い':'высокие','大きい':'большие','明るい':'светлые','きれいな':'чистые',},
    'negative':{'ひくい':'низкие','せまい':'узкие','小さい':'маленькие','暗い':'темные',},
    'colors':{'赤い':'красные','青い':'синие','黄色い':'желтые','白い':'белые','黒い':'черные','茶色い':'коричневые'},
},
'adj_rooms_si_hir':{
    'positive':{'広い':'ひろい','高い':'たかい','大きい':'おおきい','明るい':'あかるい','きれいな':'きれいな',},
    'negative':{'ひくい':'ひくい','せまい':'せまい','小さい':'ちいさい','暗い':'くらい',},
    'colors':{'赤い':'あかい','青い':'あおい','黄色い':'きいろい','白い':'しろい','黒い':'くろい','茶色い':'ちゃいろい'},
},


# Ограничения и исключения
'pril_with_no' : {'日本語','英語','フランス語','ロシア語','今日','明日','昨日','東京','日本','英','大阪','京都','男子','女子',
                    '花','山','海','鳥','川','国語'},
'adj_build_without_no':{ '中', '小','浅草','上野','新宿','渋谷','池袋','品川','秋葉原',
                        '東京','京都','名古屋','神戸',
                        '三菱','三井','住友','みずほ','りそな',
                            '上野','新宿','大学','公立','私立','国立','学校'},
'adj_build_with_no': {'明子', '石田', '三木', '中村', '富山','東京','京都','名古屋','神戸','大阪','大学','学校','男子'},
'adj_non_predicative':{'しずか','きれい','にぎやか','りっぱ','すてき','ゆう名','けっこう'},
'adj_non_predicative_hir':{'しずか':'しずか','きれい':'きれい','にぎやか':'にぎやか','りっぱ':'りっぱ','すてき':'すてき','ゆう名':'ゆうめ','けっこう':'けっこう'},
'adj_non_predicative_rus':{'しずか':'тихий','きれい':'красивый (чистый)','にぎやか':'оживленный','りっぱ':'отличный','すてき':'прекрасный','ゆう名':'знаменитый','けっこう':'превосходный'},
'adj_non_predicative_endings':{'しずか':'тихо','きれい':'красиво (чисто)','にぎやか':'оживленно','りっぱ':'отлично','すてき':'прекрасно','ゆう名':'знаменито','けっこう':'превосходно'},

# Свойства, которые можно обрести
'adj_for_small_object2':{'古':'старый','面白':'интересный', '面倒':'скучный','寒':'холодный','暖か':'теплый'},
'adj_for_small_object2_hir':{'古':'ふる','面白':'おもしろ', '面倒':'つまらな','寒':'さむ','暖か':'あたたか'},
'adj_for_small_endings3':{'古':'старым','面白':'интересным', '面倒':'скучным','寒':'холодным','暖か':'теплым'},

}
