import random 

def ran(x):
    return random.choice(list(x.keys())) 

def lists_words_desu():

    sp = []
    for i in var_desu:
        for j in var_desu[i]:
            sp.append(desu_vars(i,j))
    for i in var_pril:
        for j in var_pril[i]:
            sp.append(pril_vars(i,j))
    for i in var_glag:
        for j in var_glag[i]:
            sp.append(glag_vars(i,j))
    return sp


a = {

# Местоимения
'uno' : {'この':'этот','その':'тот','あの':'вон тот'},
# существительные и люди
'names' : {'田中':'Танака','石田':'Исида','三木':'Мики','富山':'Тояма','山田':'Ямада','明人':'Акихито','花':'Хана','友木':'Томоки',
           '明子':'Акико','年子':'Тошико','火間':'Хима'},
'names_hir':{'田中':'たなか','石田':'いしだ','三木':'みき','富山':'とやま','山田':'やまだ','明人':'あきひと','花':'はな','友木':'ともき',
             '明子':'あきこ','年子':'としこ','火間':'ひま'},
'family' : {'お父さん':'отец','お母さん':'мама','おにいさん':'брат','おねえさん':'сестра','いもうと':'младшая сестра','おとうと':'младший брат','友だち':'друг'},
'family_hur':{'お父さん':'おとうさん','お母さん':'おかあさん','おにいさん':'おにいさん','おねえさん':'おねえさん','いもうと':'いもうと','おとうと':'おとうと','友だち':'ともだち'},
'end_family' : {'お父さん':'отца','お母さん':'матери','おねえさん':'брата','おねえさん':'сестры','いもうと':'младшей сестры','おとうと':'младшего брата','友だち':'друга'},
'end_names':{'田中':'Танаки','石田':'Исиды','三木':'Мики','富山':'Тоямы','山田':'Ямады','明人':'Акихито','花':'Ханы','友木':'Томоки',
             '明子':'Акико','年子':'Тошико','火間':'Химы'},
'profession':{'先生':'преподаватель','大学生':'студент университета',},
'profession_hir':{'先生':'せんせい','大学生':'だいがくせい',},
'profession_many':{'先生':'учителя','大学生':'студенты университета',},
'end_profession':{'先生':'учителем','大学生':'студентом университета',},
'end_profession_many':{'先生':'учителями','大学生':'студентами университета',},

'small object':{'ざっし':'журнал','はこ':'короб','じ書':'словарь','本':'книга','えんぴつ':'карандаш','あめ':'конфета',
                'かばん':'портфель','えいが':'фильм','しゃしん':'фотография', '新聞':'газета', '傘':'зонтик', '電話':'телефон','くつ':'обувь','時けい':'часы',
                'おかし':'сладости','くだもの':'фрукты','ちず':'карта','え':'картина','きもの':'кимоно','うわぎ':'верхняя одежда'},
'small object_hir':{'ざっし':'ざっし','はこ':'はこ','本':'ほん','えんぴつ':'えんぴつ','じ書':'じしょ','あめ':'あめ',
                    'かばん':'かばん','えいが':'えいが','しゃしん':'しゃしん', '新聞':'しんぶん', '傘':'かさ', '電話':'でんわ','くつ':'くつ','時けい':'とけい',
                    'おかし':'おかし','くだもの':'くだもの','ちず':'ちず','え':'え','きもの':'きもの','うわぎ':'うわぎ'},

'adj_for_small_object':{
    'ざっし': {'新し':'новый', '古':'старый','おもしろ':'интересный', 'つまらな':'скучный','い':'хороший','高':'дорогой','安':'дешевый','うすい':'тонкий','ふとい':'толстый',},
    'はこ': {'大き':'большой', '小さ':'маленький', 'おも':'тяжелый', 'やさし':'легкий','赤':'красный','あお':'синий','きいろ':'желтый','白':'белый','ちゃいろ':'коричневый',},
    'かばん': {'おも':'тяжелый', 'やさし':'легкий','新し':'новый', '古':'старый','赤':'красный','あお':'синий','きいろ':'желтый','白':'белый','い':'хороший','ちゃいろ':'коричневый','うすい':'тонкий','ふとい':'толстый',},
    'じ書':{'高':'дорогой','安':'дешевый','い':'хороший'},
    '本':{ 'おもしろ':'интересная', 'つまらな':'скучная','い':'хорошая','高':'дорогая','安':'дешевая','うすい':'тонкий','ふとい':'толстый',},
    'えんぴつ':{'みじか':'короткий','長':'длинный','うすい':'тонкий','ふとい':'толстый',},
    'えいが':{ 'おもしろ':'интересный', 'つまらな':'скучный','い':'хороший','けっこう':'превосходный','りっぱ':'отличный','有名':'знаменитый',},
    'しゃしん':{ 'おもしろ':'интересная', 'つまらな':'скучная'},
    '新聞':{ 'おもしろ':'интересная', 'つまらな':'скучная','今日':'сегодняшняя','明日':'завтрашняя','昨日':'вчерашняя','うすい':'тонкий','ふとい':'толстый',},
    '傘':{ '赤':'красный','あお':'синий','きいろ':'желтый','白':'белый','高':'дорогой','安':'дешевый','ちゃいろ':'коричневый'},
    'ins':{'広':'широкий','ひく':'низкий','高':'высокий','せま':'узкий','大き':'большой','小さ':'маленький','明る':'светлый','くら':'темный'},
    '電話':{ '新し':'новый', '古':'старый','赤':'красный','あお':'синий','きいろ':'желтый','白':'белый','ちゃいろ':'коричневый'},
    'くつ':{ '赤':'красная','あお':'синяя','きいろ':'желтая','白':'белая','新し':'новая', '古':'старая','い':'хорошая','高':'дорогой','安':'дешевый','ちゃいろ':'коричневый'},
    '時けい':{ '新し':'новые', '古':'старые','い':'хорошие','高':'дорогие','安':'дешевые'},
    'おかし':{'新し':'новые','おいし':'вкусные','まず':'невкусные','い':'хорошие','いろいろ':'разные','家て':'домашние'},
    'あめ':{'新し':'новые','おいし':'вкусные','まず':'невкусные','い':'хорошие','いろいろ':'разные','うす':'тонкий','ふと':'толстый',},
    'くだもの':{'新し':'новые','おいし':'вкусные','まず':'невкусные','い':'хорошие','いろいろ':'разные'},
    'ちず':{'新し':'новая','古':'старая','い':'хорошая'},
    'え':{'新し':'новая','古':'старая','い':'хорошая','きれい':'красивая','大き':'большая','小さ':'маленькая','高':'дорогая','安':'дешевая'},
    'きもの':{'新し':'новое','きれい':'красивое','大き':'большое','高':'дорогое','けっこう':'превосходное'},
    'うわぎ':{'新し':'новое','きれい':'красивое','大き':'большое','高':'дорогое','けっこう':'превосходное'},

},
'adj_for_small_object_hir':{
    'ざっし': {'新し':'あたらし', '古':'ふる','おもしろ':'おもしろ', 'つまらな':'つまらな','い':'い','高':'たか','安':'やす','うすい':'うすい','ふとい':'ふとい',},
    'はこ': {'大き':'おおき', '小さ':'ちいさ', 'おも':'おも', 'やさし':'やさし','赤':'あか','あお':'あお','きいろ':'きいろ','白':'しろ','ちゃいろ':'ちゃいろ'},
    'かばん': {'おも':'おも', 'やさし':'やさし','新し':'あたらし', '古':'ふる','赤':'あか','あお':'あお','きいろ':'きいろ','白':'しろ','い':'い','ちゃいろ':'ちゃいろ','うすい':'うすい','ふとい':'ふとい',},
    'じ書':{'高':'たか','安':'やす','い':'い'},
    '本':{ 'おもしろ':'おもしろ', 'つまらな':'つまらな','い':'い','高':'たか','安':'やす','うすい':'うすい','ふとい':'ふとい',},
    'えんぴつ':{'みじか':'みじか','長':'なが','うすい':'うすい','ふとい':'ふとい',},
    'えいが':{ 'おもしろ':'おもしろ', 'つまらな':'つまらな','い':'い','けっこう':'けっこうな','りっぱ':'りっぱ','有名':'ゆうめい',},
    'しゃしん':{ 'おもしろ':'おもしろ', 'つまらな':'つまらな','花の':'はなの','山の':'やまの','川の':'かわの'},
    '新聞':{ 'おもしろ':'おもしろ', 'つまらな':'つまらな','今日':'きょうの','明日':'あしたの','昨日':'きのうの','うすい':'うすい','ふとい':'ふとい',},
    '傘':{ '赤':'あか','あお':'あお','きいろ':'きいろ','白':'しろ','高':'たか','安':'やす','ちゃいろ':'ちゃいろ'},
    'ins':{'広':'ひろ','ひく':'ひく','高':'たか','せま':'せま','大き':'おおき','小さ':'ちいさ','明る':'あかる','くら':'くら'},
    '電話':{ '新し':'あたらし', '古':'ふる','赤':'あか','あお':'あお','きいろ':'きいろ','白':'しろ','ちゃいろ':'ちゃいろ'},
    'くつ':{ '赤':'あか','あお':'あお','きいろ':'きいろ','白':'しろ','新し':'あたらし', '古':'ふる','い':'い','高':'たか','安':'やす','ちゃいろ':'ちゃいろ'},
    '時けい':{ '新し':'あたらし', '古':'ふる','い':'い','高':'たか','安':'やす'},
    'おかし':{'新し':'あたらし','おいし':'おいし','まず':'まず','い':'い','いろいろ':'いろいろ','家て':'いえて'},
    'あめ':{'新し':'あたらし','おいし':'おいし','まず':'まず','い':'い','いろいろ':'いろいろ','うす':'うす','ふと':'ふと',},
    'くだもの':{'新し':'あたらし','おいし':'おいし','まず':'まず','い':'い','いろいろ':'いろいろ'},
    'ちず':{'新し':'あたらし','古':'ふる','い':'い'},
    'え':{'新し':'あたらし','古':'ふる','い':'い','きれい':'きれい','大き':'おおき','小さ':'ちいさ','高':'たか','安':'やす'},
    'きもの':{'新し':'あたらし','きれい':'きれいな','大き':'おおき','高':'たか','けっこう':'けっこう'},
    'うわぎ':{'新し':'あたらし','きれい':'きれいな','大き':'おおき','高':'たか','けっこう':'けっこう'},
},
'adj_for_Proff':{
    '先生':{'日本語':'японского языка','英語':'английского языка'},
    '大学生':{'東京の大学':'Токийского университета','文学部':'факультета литературы','歴史部':'факультета истории','医学部':'медицинского факультета'},
},
'adj_for_Proff_hir':{
    '先生':{'日本語':'にほんご','英語':'えいご'},
    '大学生':{'東京の大学':'とうきょうのだいがく','文学部':'ぶんがくぶ','歴史部':'れきしぶ','医学部':'いがくぶ'},
},

# Суффиксы
'suff':{'さん':'-сан','くん':'-кун'},
'suff_no':{'さん':'-сана','くん':'-куна'},

# Места
'buildings' : {'学校':'школа','駅':'станция','家':'дом','こうえん':'парк','としょかん':'библиотека','大学':'университет','ぎん行':'банк','デパート':'универмаг','きっさ店':'кафе','店':'магазин','本や':'книжный магазин','花や':'цветочный магазин','魚や':'рыбный магазин','くだものや':'фруктовый магазин','えいがかん':'кинотеатр',},
'buildings_hir': {'学校': 'がっこう', '駅': 'えき', '家': 'いえ', 'こうえん': 'こうえん', 'としょかん': 'としょかん', '大学': 'だいがく',  'ぎん行': 'ぎんこう', 'デパート': 'デパート','きっさ店':'きっさてん','店':'みせ','本や':'ほんや','花や':'はなや','魚や':'さかなや','くだものや':'くだものや','えいがかん':'えいがかん'},

'end_build2' : {'学校':'в школу','駅':'на станцию','家':'домой','こうえん':'в парк','としょかん':'в библиотеку','大学':'в университет','ぎん行':'в банк','デパート':'в универмаг','きっさ店':'в кафе','店':'в магазин','本や':'в книжный магазин','花や':'в цветочный магазин','魚や':'в рыбный магазин','くだものや':'в фруктовый магазин','えいがかん':'в кинотеатр',},
# Глаголы и их формы

'glagol': {'行': "い", '帰': 'かえ', '歩': 'ある',},
}


var_glag = {
    'yes':{
        'form_pres':{'jap':{ '行':'き','帰':'り','歩':'き'},
                    'rus':{'行':'идёт','帰':'возвращается','歩':'идёт пешком'},
                    'des':'ます',
                    'dob':' - формально',
                    },
        'form_past':{'jap':{ '行':'き','帰':'り','歩':'き'},
                    'rus':{'行':'пришёл', '帰':'вернулся', '歩':'пришёл пешком'},
                    'des':'ました',
                    'dob':' - формально'},
        'fri_pres':{'jap':{ '行':'く','帰':'る','歩':'く'},
                    'rus':{'行':'идёт','帰':'возвращается','歩':'идёт пешком'},
                    'des':'',
                    'dob':' - фамильярно'},
        'fri_past':{'jap':{ '行':'った','帰':'った','歩':'いた'},
                    'rus':{'行':'пришёл', '帰':'вернулся', '歩':'пришёл пешком'},
                    'des':'',
                    'dob':'- фамильярно'},
        'form_desyou':{'jap':{ '行':'く','帰':'る','歩':'く'},
                    'rus':{'行':'наверное, идёт', '帰':'наверное, возвращается', '歩':'наверное, идёт пешком'},
                    'des':'でしょう',
                    'dob':' - формально'},
        'fri_desyou':{'jap':{ '行':'く','帰':'る','歩':'く'},
                    'rus':{'行':'наверное, идёт','帰':'наверное,возвращается','歩':'наверное, идёт пешком'},
                    'des':'だろう',
                    'dob':' - фамильярно'},
        },
    'no':{
        'form_pres':{'jap':{ '行':'き','帰':'り','歩':'き'},
                    'rus':{'行':'не идёт','帰':'не возвращается','歩':'не идёт пешком'},
                    'des':'ません',
                    'dob':' - формально',
                    },
        'form_past':{'jap':{ '行':'き','帰':'り','歩':'き'},
                    'rus':{'行':'не пришёл', '帰':'не вернулся', '歩':'не пришёл пешком'},
                    'des':'ませんでした',
                    'dob':' - формально'},
        'fri_pres':{'jap':{ '行':'か','帰':'ら','歩':'か'},
                    'rus':{'行':'не идёт','帰':'не возвращается','歩':'не идёт пешком'},
                    'des':'ない',
                    'dob':' - фамильярно'},
        'fri_past':{'jap':{ '行':'か','帰':'ら','歩':'か'},
                    'rus':{'行':'не пришёл', '帰':'не вернулся', '歩':'не пришёл пешком'},
                    'des':'かった',
                    'dob':'- фамильярно'},
        'form_desyou':{'jap':{ '行':'か','帰':'ら','歩':'か'},
                    'rus':{'行':'наверное, не идёт', '帰':'наверное, не возвращается', '歩':'наверное, не идёт пешком'},
                    'des':'ないでしょう',
                    'dob':' - формально'},
        'fri_desyou':{'jap':{ '行':'か','帰':'ら','歩':'か'},
                    'rus':{'行':'наверное, не идёт','帰':'наверное, не возвращается','歩':'наверное,не идёт пешком'},
                    'des':'ないだろう',
                    'dob':' - фамильярно'},
        },
}

def glag_vars(yn,var):
    ran_glag = ran(a['glagol'])
    glag_jap = ran_glag + var_glag[yn][var]['jap'][ran_glag]
    glag_hir = a['glagol'][ran_glag] + var_glag[yn][var]['jap'][ran_glag]
    glag_rus = var_glag[yn][var]['rus'][ran_glag]
    dob = var_glag[yn][var]['dob']
    desu = var_glag[yn][var]['des']
    build = ran(a['buildings'])
    build_hir = a['buildings_hir'][build]
    build_end = a['end_build2' ][build]
    jap = [build,'へ',glag_jap,desu]
    hir = ' '.join([build_hir,'へ',glag_hir,desu])
    rus = ' '.join([glag_rus,build_end,dob])
    jap = ' '.join(jap)
    return jap,hir,rus

def who_f(end,suff): # выбор имени/человека 
    list_who = random.choice((a['names'],a['family']))
    who = ran(list_who)
    if who in a['names']:
        jap_suff = ran(a['suff'])
        rus_who = a['names'][who]+a[suff][jap_suff]
        hir_who = a['names_hir'][who]+jap_suff
        who= who+jap_suff
    else:
        rus_who=a[end][who]
        hir_who = a['family_hur'][who]
    return who, hir_who,rus_who

var_desu = {
    'yes':{
    'form_pres':{'jap':'です','rus':' - формально','ne':''},
    'form_past':{'jap':'でした','rus':' - формально','ne':''},
    'fri_pres':{'jap':'だ','rus':' - фамильярно','ne':''},
    'fri_past':{'jap':'だった','rus':'- фамильярно','ne':''},
    'form_desyou':{'jap':'でしょう','rus':' - формально','ne':', наверное, '},
    'fri_desyou':{'jap':'だろう','rus':' - фамильярно','ne':', наверное,'},
    },
    'no':{
    'form_pres':{'jap':'ではありません','rus':' - формально','ne':' не '},
    'form_past':{'jap':'ではありませんでした','rus':' - формально','ne':' не '},
    'fri_pres':{'jap':'ではない','rus':' - фамильярно','ne':' не '},
    'fri_past':{'jap':'ではなかった','rus':'- фамильярно','ne':' не '},
    'form_desyou':{'jap':'ではないでしょう','rus':' - формально','ne':', наверное, не'},
    'fri_desyou':{'jap':'ではないだろう','rus':' - фамильярно','ne':', наверное, не'},
    }
}

var_pril = {
    'yes':{
    'form_pres':{'jap':'いです','rus':' - формально','ne':''},
    'form_past':{'jap':'かったです','rus':' - формально','ne':'был'},
    'form_pres':{'jap':'い','rus':' -  фамильярно','ne':''},
    'form_past':{'jap':'かった','rus':' - фамильярно','ne':'был'},
    'form_desyou':{'jap':'いでしょう','rus':' -　формально','ne':', наверное,'},
    'fri_desyou':{'jap':'かっただろう','rus':' - фамильярно','ne':', наверное,'},
    },
    'no':{
    'form_pres':{'jap':'くないです','rus':' - формально','ne':' не '},
    'form_past':{'jap':'くなかったです','rus':' - формально','ne':' не был'},
    'form_pres':{'jap':'くない','rus':' - фамильярно','ne':' не '},
    'form_past':{'jap':'くなかった','rus':' - фамильярно','ne':' не был'},
    'form_desyou':{'jap':'くないでしょう','rus':' - формально','ne':', наверное, не'},
    'fri_desyou':{'jap':'くなかっただろう','rus':' - фамильярно','ne':', наверное, не'},
    }
}

def desu_vars(yn,var):
    des_jap = var_desu[yn][var]['jap']
    des_rus = var_desu[yn][var]['rus']
    ne = var_desu[yn][var]['ne']
    if random.randint(0,1)==0:
        jap_podl, jap_podl_hir, jap_podl_rus = who_f('family','suff')
        count = 'one'
        who = ran(a['profession'])
    else:
        jap_podl, jap_podl_hir, jap_podl_rus = ('この人たち','このひとたち','они')
        count = 'many'
        who = ran(a['profession_many'])
    who_hir = a['profession_hir'][who]
    if jap_podl in a['family']:
        dop1 = ran(a['names'])
        dop1_hir = a['names_hir'][dop1]+'さん'+'の'
        dop1_rus = a['end_names'][dop1]+'-сан'
        dop1=dop1+'さん'+'の'
    else:
        dop1,dop1_hir,dop1_rus = ['','','']
    prop_jap = ran(a['adj_for_Proff'][who])
    prop_hir = a['adj_for_Proff_hir'][who][prop_jap]+ 'の'
    prop_rus = a['adj_for_Proff'][who][prop_jap]
    prop_jap = prop_jap + 'の'
    if var=='form_past' or var=='fri_past':
        if count =='one':
            end = 'end_profession'
            ha = ' был '
        else:
            end = 'end_profession_many'
            ha = ' были '
    else:
        if count =='one':
            end = 'profession'
            ha = ' - '
        else:
            end = 'profession_many'
            ha = ' - '
    jap = [dop1,jap_podl,'は',prop_jap,who,des_jap]
    hir = ' '.join([dop1_hir,jap_podl_hir,'は',prop_hir,who_hir,des_jap])
    rus = ' '.join([jap_podl_rus,dop1_rus,ha,ne,a[end][who],prop_rus, des_rus])
    jap = ' '.join(jap)
    return jap,hir,rus

def pril_vars(yn, var):
    des_jap = var_pril[yn][var]['jap']
    des_rus = var_pril[yn][var]['rus']
    ne = var_pril[yn][var]['ne']
    un = ran(a['uno'])
    un_rus = a['uno'][un]
    obj = ran(a['small object'])
    obj_hir = a['small object_hir'][obj]
    obj_rus = a['small object'][obj]
    pril_jap = ran(a['adj_for_small_object'][obj])
    pril_hir = a['adj_for_small_object_hir'][obj][pril_jap]
    pril_rus = a['adj_for_small_object'][obj][pril_jap]
    if var=='form_past' or var=='fri_past':
       ha = ' был '
    else:
        ha = ''
    jap = [un,obj,'は',pril_jap,des_jap]
    hir = ' '.join([un,obj_hir,'は',pril_hir,des_jap])
    rus = ' '.join([un_rus,obj_rus,ne,ha,pril_rus,des_rus])
    jap = ' '.join(jap)
    return jap,hir,rus