import random 

def ran(x):
    return random.choice(list(x.keys())) 

def lists_words_num():

    sp = []
    for i in a:
        sp.append(hon_f(i,a))
    for i in numb:
        sp.append(hon_f(i,numb))
    for j in k:
        sp.append(kai_f(j))
    sp.append(ordinal_number())
    sp.append(generate_price())
    return sp

a={
    '本':{
        'words':{'えんぴつ':'карандаш','傘':'зонт', 'ペン': 'ручка', 'バナナ':'банан','ふで': 'кисть','木':'дерево',},
        'read_words':{'えんぴつ':'えんぴつ','傘':'かさ', 'ペン': 'ペン', 'バナナ':'バナナ','ふで': 'ふで','木':'き',},
        'read':{'1':'いっぽん','2':'にほん','3':'さんぼん','4':'よんほん','5':'ごほん','6':'ろっぽん','7':'ななほん','8':'はっぽん','9':'きゅうほん','10':'じゅっぽん'},
        'ending_1':{'えんぴつ':'карандаша','傘':'зонта', 'ペン': 'ручки', 'バナナ':'банана','ふで': 'кисти','木':'дерева',},
        'ending_2':{'えんぴつ':'карандашей','傘':'зонтов', 'ペン': 'ручек', 'バナナ':'бананов','ふで': 'кистей','木':'деревьев',},
    },
    'つ':{
        'words':{'はこ':'коробка','かご':'корзина','りんご':'яблоко','バール':'мяч'},
        'read_words':{'はこ':'はこ','かご':'かご','りんご':'りんご','バール':'バール'},
        'read':{'1':'ひとつ','2':'ふたつ','3':'みっつ','4':'よっつ','5':'いつつ','6':'むっつ','7':'ななつ','8':'やっつ','9':'ここのつ','10':'じゅうつ'},
        'ending_1':{'はこ':'коробки','かご':'корзины','りんご':'яблока','バール':'мяча'},
        'ending_2':{'はこ':'коробок','かご':'корзин','りんご':'яблок','バール':'мячей'}},
    '台':{
        'words':{'テレビ':'телевизор','パソコン':'компьютер','自動車':'автомобиль','電話':'телефон','自転車':'велосипед'},
        'read_words':{'テレビ':'テレビ','パソコン':'パソコン','自動車':'じどうしゃ','電話':'でんわ','自転車':'じてんしゃ'},
        'read':{'1':'いちだい','2':'にだい','3':'さんだい','4':'よんだい','5':'ごだい','6':'ろくだい','7':'ななだい','8':'はちだい','9':'きゅうだい','10':'じゅうだい'},
        'ending_1':{'テレビ':'телевизора','パソコン':'компьютера','自動車':'автомобиля','電話':'телефона','自転車':'велосипеда'},
        'ending_2':{'テレビ':'телевизоров','パソコン':'компьютеров','自動車':'автомобилей','電話':'телефонов','自転車':'велосипедов'}},
    '枚':{
        'words':{'はがき':'открытка','カード':'карта','しゃしん':'фотография','ふうとう':'конверт','きって':'марка'},
        'read_words':{'はがき':'はがき','カード':'カード','しゃしん':'しゃしん','ふうとう':'ふうとう','きって':'きって'},
        'read':{'1':'いちまい','2':'にまい','3':'さんまい','4':'よんまい','5':'ごまい','6':'ろくまい','7':'ななまい','8':'はちまい','9':'きゅうまい','10':'じゅうまい'},
        'ending_1':{'はがき':'открытки','カード':'карты','しゃしん':'фотографии','ふうとう':'конверта','きって':'марки'},
        'ending_2':{'はがき':'открыток','カード':'карт','しゃしん':'фотографий','ふうとう':'конвертов','きって':'марок'}},
    '冊':{
        'words':{'本':'книга','辞書':'словарь','ざっし':'журнал','てちょう':'блокнот','新聞':'газета'},
        'read_words':{'本':'ほん','辞書':'じしょ','ざっし':'ざっし','てちょう':'てちょう','新聞':'しんぶん'},
        'read':{'1':'いっさつ','2':'にさつ','3':'さんさつ','4':'よんさつ','5':'ごさつ','6':'ろくさつ','7':'ななさつ','8':'はっさつ','9':'きゅうさつ','10':'じゅっさつ'},
        'ending_1':{'本':'книги','辞書':'словаря','ざっし':'журнала','てちょう':'блокнота','新聞':'газеты'},
        'ending_2':{'本':'книг','辞書':'словарей','ざっし':'журналов','てちょう':'блокнотов','新聞':'газет'}},
    '匹':{
        'words':{'いぬ':'собака','ねこ':'кошка','うさぎ':'кролик','ねずみ':'мышь','虫':'жук'},
        'read_words':{'いぬ':'いぬ','ねこ':'ねこ','鳥':'とり','うさぎ':'うさぎ','ねずみ':'ねずみ','虫':'むし'},
        'read':{'1':'いっぴき','2':'にひき','3':'さんびき','4':'よんひき','5':'ごひき','6':'ろっぴき','7':'ななひき','8':'はっぴき','9':'きゅうひき','10':'じゅっぴき'},
        'ending_1':{'いぬ':'собаки','ねこ':'кошки','鳥':'птицы','うさぎ':'кролика','ねずみ':'мыши','虫':'жука'},
        'ending_2':{'いぬ':'собак','ねこ':'кошек','鳥':'птиц','うさぎ':'кроликов','ねずみ':'мышей','虫':'жуков'}},
    '羽':
        {
        'words':{'とり':'птица','わし':'орел','はと':'голубь','にわとり':'курица','すずめ':'воробей','ペンギン':'пингвин','蝶々':'бабочка'}, 
        'read_words':{'とり':'とり','わし':'わし','はと':'はと','にわとり':'にわとり','すずめ':'すずめ','ペンギン':'ペンギン','蝶々':'ちょうちょう'},
        'read':{'1':'いちわ','2':'にわ','3':'さんわ','4':'よんわ','5':'ごわ','6':'ろくわ','7':'ななわ','8':'はちわ','9':'きゅうわ','10':'じゅうわ'},
        'ending_1':{'とり':'птицы','わし':'орла','はと':'голубя','にわとり':'курицы','すずめ':'воробья','ペンギン':'пингвина','蝶々':'бабочки'},
        'ending_2':{'とり':'птиц','わし':'орлов','はと':'голубей','にわとり':'куриц','すずめ':'воробьев','ペンギン':'пингвинов','蝶々':'бабочек'}},
    '頭':{
        'words':{'うし':'корова','ぞう':'слон','うま':'лошадь','ひつじ':'овца','きりん':'жираф','さる':'обезьяна','ぶた':'свинья'},
        'read_words':{'うし':'うし','ぞう':'ぞう','うま':'うま','ひつじ':'ひつじ','きりん':'きりん','さる':'さる','ぶた':'ぶた'},
        'read':{'1':'いっとう','2':'にとう','3':'さんとう','4':'よんとう','5':'ごとう','6':'ろくとう','7':'ななとう','8':'はっとう','9':'きゅうとう','10':'じゅっとう'},
        'ending_1':{'うし':'коровы','ぞう':'слона','うま':'лошади','ひつじ':'овцы','きりん':'жирафа','さる':'обезьяны','ぶた':'свиньи'},
        'ending_2':{'うし':'коров','ぞう':'слонов','うま':'лошадей','ひつじ':'овец','きりん':'жирафов','さる':'обезьян','ぶた':'свиней'}},
    '杯':{
        'words':{'こうちゃ':'кружка чая','みず':'стакан воды','コーヒー':'кружка кофе','ワイン':'бокал вина','ビール':'кружка пива','ジュース':'стакан сока'},
        'read_words':{'こうちゃ':'こうちゃ','みず':'みず','コーヒー':'コーヒー','ワイン':'ワイン','ビール':'ビール','ジュース':'ジュース'},
        'read':{'1':'いっぱい','2':'にはい','3':'さんばい','4':'よんはい','5':'ごはい','6':'ろっぱい','7':'ななはい','8':'はっぱい','9':'きゅうはい','10':'じゅっぱい'},
        'ending_1':{'こうちゃ':'кружки чая','みず':'стакана воды','コーヒー':'кружки кофе','ワイン':'бокала вина','ビール':'кружки пива','ジュース':'стакана сока'},
        'ending_2':{'こうちゃ':'кружек чая','みず':'стаканов воды','コーヒー':'кружек кофе','ワイン':'бокалов вина','ビール':'кружек пива','ジュース':'стаканов сока'}},
    '個':{
        'words':{'いちご':'клубника','あめ':'конфета','消しゴム':'ластик','卵':'яйцо','パン':'хлеб','チョコレート':'шоколад'},
        'read_words':{'いちご':'いちご','あめ':'あめ','消しゴム':'けしゴム','卵':'たまご','パン':'パン','チョコレート':'チョコレート'},
        'read':{'1':'いっこ','2':'にこ','3':'さんこ','4':'よんこ','5':'ごこ','6':'ろっこ','7':'ななこ','8':'はっこ','9':'きゅうこ','10':'じゅっこ'},
        'ending_1':{'いちご':'клубники','あめ':'конфеты','消しゴム':'ластика','卵':'яйца','パン':'хлеба','チョコレート':'шоколада'},
        'ending_2':{'いちご':'клубник','あめ':'конфет','消しゴム':'ластиков','卵':'яиц','パン':'хлебов','チョコレート':'шоколада'}},
    '足':{
        'words':{'くつした':'носки','くつ':'обувь'},
        'read_words':{'くつした':'くつした','くつ':'くつ'},
        'read':{'1':'いっそく','2':'にそく','3':'さんそく','4':'よんそく','5':'ごそく','6':'ろくそく','7':'ななそく','8':'はっそく','9':'きゅうそく','10':'じゅっそく'},
        'ending_1':{'くつした':'носки','くつ':'обуви'},
        'ending_2':{'くつした':'носки','くつ':'обуви'}
    },
    '着':{
        'words':{'ふく':'одежда','コート':'пальто','ワンピース':'платье','セーター':'свитер','シャツ':'рубашка','スーツ':'костюм','着物':'кимоно'},
        'read_words':{'ふく':'ふく','コート':'コート','ワンピース':'ワンピース','セーター':'セーター','シャツ':'シャツ','スーツ':'スーツ','着物':'きもの'},
        'read':{'1':'いっちゃく','2':'にちゃく','3':'さんちゃく','4':'よんちゃく','5':'ごちゃく','6':'ろくちゃく','7':'ななちゃく','8':'はっちゃく','9':'きゅうちゃく','10':'じゅっちゃく'},
        'ending_1':{'ふく':'одежды','コート':'пальто','ワンピース':'платья','セーター':'свитера','シャツ':'рубашки','スーツ':'костюма','着物':'кимоно'},
        'ending_2':{'ふく':'одежд','コート':'пальто','ワンピース':'платьев','セーター':'свитеров','シャツ':'рубашек','スーツ':'костюмов','着物':'кимоно'}},
}

numb = {
    '第':{
        'words':{'者':'человек','いんしょう':'впечатление','国':'страна','かだい':'проблема','章':'глава книги'},
        'read_words':{'者':'もの','いんしょう':'いんしょう','国':'くに','かだい':'かだい','章':'しょう'},
        'read':{'1':'だいいち','2':'だいに','3':'だいさん','4':'だいよん','5':'だいご','6':'だいろく','7':'だいなな','8':'だいはち','9':'だいきゅう','10':'だいじゅう'},
        'ending_1':{'者':'человека','いんしょう':'впечатления','国':'страны','かだい':'проблемы','章':'главы книги'},
        'ending_2':{'者':'человек','いんしょう':'впечатлений','国':'стран','かだい':'проблем','章':'глав книги'}},
    '番目':{
            'words':{'者':'человек','いんしょう':'впечатление','国':'страна','かだい':'проблема','章':'глава книги'},
            'read_words':{'者':'しゃ','いんしょう':'いんしょう','国':'くに','かだい':'かだい','章':'しょう'},
            'read':{'1':'いちばんめ','2':'にばんめ','3':'さんばんめ','4':'よんばんめ','5':'ごばんめ','6':'ろくばんめ','7':'ななばんめ','8':'はちばんめ','9':'きゅうばんめ','10':'じゅうばんめ'},
            'ending_1':{'者':'человека','いんしょう':'впечатления','国':'страны','かだい':'проблемы','章':'главы книги'},
            'ending_2':{'者':'человек','いんしょう':'впечатлений','国':'стран','かだい':'проблем','章':'глав книги'},
    },
    '回目':{
        'words':{'試験':'экзамен','テスト':'тест','授業':'урок','会議':'собрание','パーティー':'вечеринка','デート':'свидание'},
        'read_words':{'試験':'しけん','テスト':'テスト','授業':'じゅぎょう','会議':'かいぎ','パーティー':'パーティー','デート':'デート'},
        'read':{'1':'いっかいめ','2':'にかいめ','3':'さんかいめ','4':'よんかいめ','5':'ごかいめ','6':'ろっかいめ','7':'ななかいめ','8':'はっかいめ','9':'きゅうかいめ','10':'じゅっかいめ'},
        'ending_1':{'試験':'экзамена','テスト':'теста','授業':'урока','会議':'собрания','パーティー':'вечеринки','デート':'свидания'},
        'ending_2':{'試験':'экзаменов','テスト':'тестов','授業':'уроков','会議':'собраний','パーティー':'вечеринок','デート':'свиданий'}},

    '目':{
        'words':{'信号':'светофор','かど':'угол','駅':'станция','建物':'здание','部屋':'комната'},
        'read_words':{'信号':'しんごう','かど':'かど','駅':'えき','建物':'たてもの','部屋':'へや'},
        'read':{'1':'ひとつめ','2':'ふたつめ','3':'みっつめ','4':'よっつめ','5':'いつつめ','6':'むっつめ','7':'ななつめ','8':'やっつめ','9':'ここのつめ','10':'とおつめ'},
        'ending_1':{'信号':'светофора','かど':'угла','駅':'станции','建物':'здания','部屋':'комнаты'},
        'ending_2':{'信号':'светофоров','かど':'углов','駅':'станций','建物':'зданий','部屋':'комнат'},
    }
}
 

k = {'階':{
        'read':{'1':'いっかい','2':'にかい','3':'さんがい','4':'よんかい','5':'ごかい','6':'ろっかい','7':'ななかい','8':'はっかい','9':'きゅうかい','10':'じゅっかい'},
        'ending':{'1':'этаж','2':'этажа','3':'этажа','4':'этажа','5':'этажей','6':'этажей','7':'этажей','8':'этажей','9':'этажей','10':'этажей'},},
    'か月':{
        'read':{'1':'いっかげつ','2':'にかげつ','3':'さんがげつ','4':'よんかげつ','5':'ごかげつ','6':'ろっかげつ','7':'ななかげつ','8':'はっかげつ','9':'きゅうかげつ','10':'じゅっかげつ'},
        'ending':{'1':'месяц','2':'месяца','3':'месяца','4':'месяца','5':'месяцев','6':'месяцев','7':'месяцев','8':'месяцев','9':'месяцев','10':'месяцев'},},
    '月':{
        'read':{'1':'いちがつ','2':'にがつ','3':'さんがつ','4':'よんがつ','5':'ごがつ','6':'ろくがつ','7':'しちがつ','8':'はちがつ','9':'くがつ','10':'じゅうがつ','11':'じゅういちがつ','12':'じゅうにがつ'},
        'ending':{'1':'/ый месяц (январь)','2':'/ой месяц (февраль)','3':'/ий месяц (март)','4':'/ый месяц (апрель)','5':'/ый месяц (май)','6':'/ой месяц (июнь)','7':'/ий месяц (июль)','8':'/ый месяц (август)','9':'/ый месяц (сентябрь)','10':'/ый месяц (октябрь)','11':'/ый месяц (ноябрь)','12':'/ый месяц (декабрь)'},
        'ending2':{'1':'январь', '2':'февраль', '3':'март', '4':'апрель', '5':'май', '6':'июнь', '7':'июль', '8':'август', '9':'сентябрь', '10':'октябрь', '11':'ноябрь', '12':'декабрь'}, },
    '日':{
        'read':{'1':'ついたち','2':'ふつか','3':'みっか','4':'よっか','5':'いつか','6':'むいか','7':'なのか','8':'ようか','9':'ここのか','10':'とおか','11':'じゅういちにち','12':'じゅうににち','13':'じゅうさんにち','14':'じゅうよっか','15':'じゅうごにち','16':'じゅうろくにち','17':'じゅうしちにち','18':'じゅうはちにち','19':'じゅうくにち','20':'はつか','21':'にじゅういちにち','22':'にじゅうににち','23':'にじゅうさんにち','24':'にじゅうよっか','25':'にじゅうごにち','26':'にじゅうろくにち','27':'にじゅうしちにち','28':'にじゅうはちにち','29':'にじゅうくにち','30':'さんじゅうにち','31':'さんじゅういちにち'},
        'ending':{'1':'день (число месяца)','2':' день (число месяца)','3':'день (число месяца)','4':'день (число месяца)','5':'день (число месяца)','6':'день (число месяца)','7':'день (число месяца)','8':'день (число месяца)','9':'день (число месяца)','10':'день (число месяца)','11':'день (число месяца)','12':'день (число месяца)','13':'день (число месяца)','14':'день (число месяца)','15':'день (число месяца)','16':'день (число месяца)','17':'день (число месяца)','18':'день (число месяца)','19':'день (число месяца)','20':'день (число месяца)','21':'день (число месяца)','22':'день (число месяца)','23':'день (число месяца)','24':'день (число месяца)','25':'день (число месяца)','26':'день (число месяца)','27':'день (число месяца)','28':'день (число месяца)','29':'день (число месяца)','30':'день (число месяца)','31':'день (число месяца)'},
        'ending2':{'1':'первое', '2':'второе', '3':'третье', '4':'четвертое', '5':'пятое', '6':'шестое', '7':'седьмое', '8':'восьмое', '9':'девятое', '10':'десятое', '11':'одиннадцатое', '12':'двенадцатое', '13':'тринадцатое', '14':'четырнадцатое', '15':'пятнадцатое', '16':'шестнадцатое', '17':'семнадцатое', '18':'восемнадцатое', '19':'девятнадцатое', '20':'двадцатое', '21':'двадцать первое', '22':'двадцать второе', '23':'двадцать третье', '24':'двадцать четвертое', '25':'двадцать пятое', '26':'двадцать шестое', '27':'двадцать седьмое', '28':'двадцать восьмое', '29':'двадцать девятое', '30':'тридцатое', '31':'тридцать первое'}, },
    '時':{
        'read':{'1':'いちじ','2':'にじ','3':'さんじ','4':'よじ','5':'ごじ','6':'ろくじ','7':'しちじ','8':'はちじ','9':'くじ','10':'じゅうじ'},
        'ending':{'1':'час','2':'часа','3':'часа','4':'часа','5':'часов','6':'часов','7':'часов','8':'часов','9':'часов','10':'часов'},},
    '分':{
        'read':{'1':'いっぷん','2':'にふん','3':'さんぷん','4':'よんぷん','5':'ごふん','6':'ろっぷん','7':'ななふん','8':'はっぷん','9':'きゅうふん','10':'じゅっぷん'},
        'ending':{'1':'минута','2':'минуты','3':'минуты','4':'минуты','5':'минут','6':'минут','7':'минут','8':'минут','9':'минут','10':'минут'},},
    '人':{
        'read':{'1':'ひとり','2':'ふたり','3':'さんにん','4':'よにん','5':'ごにん','6':'ろくにん','7':'ななにん','8':'はちにん','9':'きゅうにん','10':'じゅうにん'},
        'ending':{'1':'человек','2':'человека','3':'человека','4':'человека','5':'человек','6':'человек','7':'человек','8':'человек','9':'человек','10':'человек'},},
    '歳':{
        'read':{'1':'いっさい','2':'にさい','3':'さんさい','4':'よんさい','5':'ごさい','6':'ろくさい','7':'ななさい','8':'はっさい','9':'きゅうさい','10':'じゅっさい','11':'じゅういっさい','12':'じゅうにさい','13':'じゅうさんさい','14':'じゅうよんさい','15':'じゅうごさい','16':'じゅうろくさい','17':'じゅうななさい','18':'じゅうはっさい','19':'じゅうきゅうさい','20':'はたち','21':'にじゅっさい','22':'にじゅうにさい','23':'にじゅうさんさい','24':'にじゅうよんさい','25':'にじゅうごさい','26':'にじゅうろくさい','27':'にじゅうななさい','28':'にじゅうはっさい','29':'にじゅうきゅうさい','30':'さんじゅっさい','31':'さんじゅういっさい'},
        'ending':{'1':'год (возраст)','2':'года (возраст)','3':'года (возраст)','4':'года (возраст)','5':'лет (возраст)','6':'лет (возраст)','7':'лет (возраст)','8':'лет (возраст)','9':'лет (возраст)','10':'лет (возраст)','11':'лет (возраст)','12':'лет (возраст)','13':'лет (возраст)','14':'лет (возраст)','15':'лет (возраст)','16':'лет (возраст)','17':'лет (возраст)','18':'лет (возраст)','19':'лет (возраст)','20':'лет (возраст)','21':'год (возраст)','22':'года (возраст)','23':'года (возраст)','24':'года (возраст)','25':'лет (возраст)','26':'лет (возраст)','27':'лет (возраст)','28':'лет (возраст)','29':'лет (возраст)','30':'лет (возраст)','31':'год (возраст)'},},
    '部屋':{
        'read':{'1':'ひとへや','2':'ふたへや','3':'みへや','4':'よんへや','5':'ごへや','6':'ろっへや','7':'ななへや','8':'はっへや','9':'きゅうへや','10':'じゅっへや'},
        'ending':{'1':'комната','2':'комнаты','3':'комнаты','4':'комнаты','5':'комнат','6':'комнат','7':'комнат','8':'комнат','9':'комнат','10':'комнат',},},
    '回':{
        'read':{'1':'いっかい','2':'にかい','3':'さんかい','4':'よんかい','5':'ごかい','6':'ろっかい','7':'ななかい','8':'はっかい','9':'きゅうかい','10':'じゅっかい'},
        'ending':{'1':'раз','2':'раза','3':'раза','4':'раза','5':'раз','6':'раз','7':'раз','8':'раз','9':'раз','10':'раз',},
    }
}
b1 = {
    'numerical': {'1':'いち','2':'に','3':'さん','4':'よん','5':'ご','6':'ろく','7':'なな','8':'はち','9':'きゅう','10':'じゅう'},
    'kanji_numerical':{'1':'一','2':'二','3':'三','4':'四','5':'五','6':'六','7':'七','8':'八','9':'九','10':'十'},
    'rus_num':{'1':'один','2':'два','3':'три','4':'четыре','5':'пять','6':'шесть','7':'семь','8':'восемь','9':'девять','10':'десять'},
    'ordinal_number':{'1':'первый (ая)','2':'второй(ая)','3':'третий(ья)','4':'четвертый(ая)','5':'пятый(ая)','6':'шестой(ая)','7':'седьмой(ая)','8':'восьмой(ая)','9':'девятый(ая)','10':'десятый(ая)'}
}


b2 = {
    'numerical': {'1':'いち','2':'に','3':'さん','4':'よん','5':'ご','6':'ろく','7':'なな','8':'はち','9':'きゅう','10':'じゅう','11':'じゅういち','12':'じゅうに','13':'じゅうさん','14':'じゅうよん','15':'じゅうご','16':'じゅうろく','17':'じゅうなな','18':'じゅうはち','19':'じゅうきゅう','20':'にじゅう','21':'にじゅういち','22':'にじゅうに','23':'にじゅうさん','24':'にじゅうよん','25':'にじゅうご','26':'にじゅうろく','27':'にじゅうなな','28':'にじゅうはち','29':'にじゅうきゅう','30':'さんじゅう','31':'さんじゅういち'},
    'kanji_numerical':{'1':'一','2':'二','3':'三','4':'四','5':'五','6':'六','7':'七','8':'八','9':'九','10':'十','11':'十一','12':'十二','13':'十三','14':'十四','15':'十五','16':'十六','17':'十七','18':'十八','19':'十九','20':'二十','21':'二十一','22':'二十二','23':'二十三','24':'二十四','25':'二十五','26':'二十六','27':'二十七','28':'二十八','29':'二十九','30':'三十','31':'三十一'},
    'rus_num':{'1':'один','2':'два','3':'три','4':'четыре','5':'пять','6':'шесть','7':'семь','8':'восемь','9':'девять','10':'десять','11':'одиннадцать','12':'двенадцать','13':'тринадцать','14':'четырнадцать','15':'пятнадцать','16':'шестнадцать','17':'семнадцать','18':'восемнадцать','19':'девятнадцать','20':'двадцать','21':'двадцать один','22':'двадцать два','23':'двадцать три','24':'двадцать четыре','25':'двадцать пять','26':'двадцать шесть','27':'двадцать семь','28':'двадцать восемь','29':'двадцать девять','30':'тридцать','31':'тридцать один'}
}

def kai_f(suff):
    if suff=='日' or suff=='歳':
        b = b2
    else:
        b = b1
    rand = ran(b['kanji_numerical'])
    jap = b['kanji_numerical'][rand]+suff
    hir = k[suff]['read'][rand]
    rus = b['rus_num'][rand] +' '+ k[suff]['ending'][rand]
    return jap,hir,rus

def hon_f(suff,dicts):
    rand = ran(dicts[suff]['words'])
    rand_num = ran(b1['kanji_numerical'])
    tsu = ''
    if rand_num =='1':
        end_rus = dicts[suff]['words'][rand]
    elif  int(rand_num) >=2 and int(rand_num)<=4:
        end_rus = dicts[suff]['ending_1'][rand]
    else:
        end_rus = dicts[suff]['ending_2'][rand]
    rus = b1['rus_num'][rand_num]+' '+end_rus
    if suff =='目':
        tsu = 'つ'
    if suff =='第':
        jap = '第' + b1['kanji_numerical'][rand_num] + rand + ' (' + rand + '-'+ dicts[suff]['words'][rand] +')'
        hir = dicts[suff]['read'][rand_num] + dicts[suff]['read_words'][rand]
        rus = b1['ordinal_number'][rand_num] + ' '+ dicts[suff]['words'][rand] +'(формально)'
    else:
        jap = b1['kanji_numerical'][rand_num] + tsu + suff +'の'+rand + ' (' + rand + '-'+ dicts[suff]['words'][rand] +')'
        hir = dicts[suff]['read'][rand_num]+'の'+dicts[suff]['read_words'][rand]
    if suff =='回目' or suff=='番目' or suff =='目':
        rus = b1['ordinal_number'][rand_num] + ' '+ dicts[suff]['words'][rand]
    if suff =='番目':
        rus += ' (не формально)'
    return jap,hir,rus

def ordinal_number():
    suff = random.choice(list(a.keys())) 
    rand = ran(a[suff]['words'])
    rand_num = ran(b1['kanji_numerical'])
    jap = b1['kanji_numerical'][rand_num] + suff +'目'+'の'+rand
    hir = a[suff]['read'][rand_num]+'め'+'の'+a[suff]['read_words'][rand]
    rus = b1['ordinal_number'][rand_num] +' '+ a[suff]['words'][rand]
    return jap,hir,rus

def generate_price():
    yen_in_kanji = {0:'', 1:'一', 2:'二', 3:'三', 4:'四', 5:'五', 6:'六', 7:'七', 8:'八', 9:'九', 10:'十', 100:'百', 1000:'千', 10000:'万'}
    yen_in_hiragana = {0:'', 1:'いち', 2:'に', 3:'さん', 4:'よん', 5:'ご', 6:'ろく', 7:'しち', 8:'はち', 9:'きゅう', 10:'じゅう', 100:'ひゃく', 1000:'せん', 10000:'まん'}

    raw_price = random.randint(1, 100) * 50 # Random price from 50 to 5000 yen, step 50
    price = raw_price
    kanji = ''
    hiragana = ''
    
    thousands = price // 1000
    if thousands > 0:
        kanji += yen_in_kanji[thousands] + yen_in_kanji[1000]
        hiragana += yen_in_hiragana[thousands] + yen_in_hiragana[1000]
        
    price = price % 1000
    hundreds = price // 100
    if hundreds > 0:
        kanji += yen_in_kanji[hundreds] + yen_in_kanji[100]
        hiragana += yen_in_hiragana[hundreds] + yen_in_hiragana[100]
        
    price = price % 100
    tens = price // 10
    if tens > 0:
        kanji += yen_in_kanji[tens] + yen_in_kanji[10]
        hiragana += yen_in_hiragana[tens] + yen_in_hiragana[10]
    
    price = price % 10
    if price > 0:
        kanji += yen_in_kanji[price]
        hiragana += yen_in_hiragana[price]

    #exceptions=

    return kanji, hiragana, raw_price