# -*- coding: utf-8 -*-

Verbs={
    '1 conjugation':['行く','飲む','聞く','話す','読む','書く','買う','持つ','出す','寝る','出る','入る','起きる','歌う','入る','走る','ある','作る','言う',
                     '分かる', '歩く','思う','探す','取る','終わる','遊ぶ','続ける','学ぶ','上る','売る','旅行する','待つ','思い出す','洗う','会う','直す','死ぬ',
                     '使う','頼む','働く','飛ぶ','止まる','吹く','呼ぶ','けす'],
    '2 conjugation':['来る','食べる','見る','入れる','いる','上げる','着る','答える','始める','知っている','教える','起きる','決める','足りる','つける','務める'],
    'suru':['する','散歩する','勉強する','やくそくする','たいそうする','ちゅうもんする','そうじする','料理する','綺麗にする']
}


Verbs_hir = {'行く':'いく','飲む':'のむ','聞く':'きく','話す':'はなす','読む':'よむ','書く':'かく','買う':'かう','持つ':'もつ','出す':'だす','寝る':'ねる','出る':'でる','入る':'はいる','起きる':'おきる','歌う':'うたう','入る':'はいる','走る':'はしる','ある':'ある','作る':'つくる','言う':'いう',
            '分かる':'わかる', '歩く':'あるく','思う':'おもう','探す':'さがす','取る':'とる','終わる':'おわる','遊ぶ':'あそぶ','続ける':'つづける','学ぶ':'まなぶ','上る':'のぼる','売る':'うる','旅行する':'りょこうする','待つ':'まつ','思い出す':'おもいだす','洗う':'あらう','会う':'あう','直す':'なおす',
            '来る':'くる','食べる':'たべる','見る':'みる','死ぬ':'しぬ','入れる':'いれる','いる':'いる','上げる':'あげる','着る':'きる','答える':'こたえる','始める':'はじめる','知っている':'しっている','教える':'おしえる','起きる':'おきる','決める':'きめる',
            'する':'する','散歩する':'さんぽする','勉強する':'べんきょうする','やくそくする':'やくそくする','たいそうする':'たいそうする','ちゅうもんする':'ちゅうもんする','そうじする':'そうじする','料理する':'りょうりする','綺麗にする':'きれいにする',
            '使う':'つかう','頼む':'たのむ','足りる':'たりる','働く':'はたらく','つける':'つける','務める':'つとめる','飛ぶ':'とぶ','止まる':'とまる','吹く':'ふく','呼ぶ':'よぶ','けす':'けす'}

Verb_translation = {
    '行く':'пришел','飲む':'выпил','聞く':'послушал','話す':'поговорил','読む':'прочитал','書く':'написал','買う':'купил','持つ':'держал','出す':'выдал','寝る':'спал','出る':'вышел','入る':'вошел','起きる':'проснулся','歌う':'спел','入る':'вошел','走る':'побежал','ある':'был','作る':'сделал','言う':'сказал',
    '分かる':'понял', '歩く':'ходил','思う':'думал','探す':'искать','取る':'взял','終わる':'закончился','遊ぶ':'играл','続ける':'продолжал','学ぶ':'учился','上る':'поднимался','売る':'продал','旅行する':'путешествовал','待つ':'ждал','思い出す':'вспомнил','洗う':'мыл','会う':'встретил','直す':'исправил','死ぬ':'умер',
    '来る':'пришел','食べる':'ел','見る':'смотрел','死ぬ':'умер','入れる':'вставил','いる':'был','上げる':'поднял','着る':'надел','答える':'ответил','始める':'начал','知っている':'знал','教える':'учил','起きる':'проснулся','決める':'решил',
    'する':'делал','散歩する':'гулял','勉強する':'учился','やくそくする':'договорился','たいそうする':'занимался физкультурой','ちゅうもんする':'заказывал','そうじする':'убирал','料理する':'готовил','綺麗にする':'делал красиво',
    '使う':'использовал','頼む':'просил','足りる':'хватало (было достаточно)','働く':'работал','つける':'включал','務める':'выполнял обязанности','飛ぶ':'летал','止まる':'останавливался','吹く':'дул','呼ぶ':'звал','けす':'выключал'}
    

te = {
    '1 conjugation':{
        'む':'んだ',
        'ぶ':'んだ',
        'ぬ':'んだ',
        'ぐ':'いだ',
        'く':'いた',
        'す':'した',
        'う':'った',
        'つ':'った',
        'る':'った',
        'ふ':'んだ',
        'づ':'だ',
        'ず':'だ',
    },
    '2 conjugation':{
        'る':'た'},
    'suru':{
        'する':'した'
    },
}

def lists_taform():
    new_list = []
    for i in Verbs:
        for j in Verbs[i]:
            new_list.append(j)
    sp = []
    for r in new_list:
        if r in Verbs['1 conjugation']:
            if r =='行く':
                hir =  r + ' -> ' + '行った'+', '+ 'いった'
            else:
                end = r[-1]
                r_without_end = r[:-1]
                hir_2 = Verbs_hir[r][:-1] + te['1 conjugation'][end]
                hir = r + ' -> ' + r_without_end + te['1 conjugation'][end]+', '+hir_2
            rus = Verb_translation[r]
            r = r +' - '+ Verbs_hir[r]
            sp.append((r,hir,rus))
        elif r in Verbs['2 conjugation']:
            end = r[-1]
            r_without_end = r[:-1]
            rus = Verb_translation[r]
            hir_2 = Verbs_hir[r][:-1] + te['2 conjugation'][end]
            hir = r + ' -> ' + r_without_end + te['2 conjugation'][end]+', '+hir_2
            r = r +' - '+ Verbs_hir[r]
            sp.append((r,hir,rus))
        elif r in Verbs['suru']:
            end = r[-2:]
            r_without_end = r[:-2]
            rus = Verb_translation[r]
            hir_2 = Verbs_hir[r][:-2] + te['suru'][end]
            hir = r + ' -> ' + r_without_end + te['suru'][end]+', '+hir_2
            r = r +' - '+ Verbs_hir[r]
            sp.append((r,hir,rus))
    return sp