# -*- coding: utf-8 -*-

Verbs={
    '1 conjugation':['行く','飲む','聞く','話す','読む','書く','買う','持つ','出す','寝る','出る','入る','起きる','歌う','入る','走る','ある','作る','言う',
                     '分かる', '歩く','思う','探す','取る','終わる','遊ぶ','続ける','学ぶ','上る','売る','旅行する','待つ','思い出す','洗う','会う','直す','死ぬ',
                     '使う','頼む','働く','飛ぶ','止まる','吹く','呼ぶ','けす'],
    '2 conjugation':['来る','食べる','見る','入れる','いる','上げる','着る','答える','始める','知っている','教える','起きる','決める','足りる','つける','務める'],
    'suru':['する','散歩する','勉強する','やくそくする','たいそうする','ちゅうもんする','そうじする','料理する','綺麗にする'],
}


Verbs_hir = {'行く':'いく','飲む':'のむ','聞く':'きく','話す':'はなす','読む':'よむ','書く':'かく','買う':'かう','持つ':'もつ','出す':'だす','寝る':'ねる','出る':'でる','入る':'はいる','起きる':'おきる','歌う':'うたう','入る':'はいる','走る':'はしる','ある':'ある','作る':'つくる','言う':'いう',
            '分かる':'わかる', '歩く':'あるく','思う':'おもう','探す':'さがす','取る':'とる','終わる':'おわる','遊ぶ':'あそぶ','続ける':'つづける','学ぶ':'まなぶ','上る':'のぼる','売る':'うる','旅行する':'りょこうする','待つ':'まつ','思い出す':'おもいだす','洗う':'あらう','会う':'あう','直す':'なおす',
            '来る':'くる','食べる':'たべる','見る':'みる','死ぬ':'しぬ','入れる':'いれる','いる':'いる','上げる':'あげる','着る':'きる','答える':'こたえる','始める':'はじめる','知っている':'しっている','教える':'おしえる','起きる':'おきる','決める':'きめる',
            'する':'する','散歩する':'さんぽする','勉強する':'べんきょうする','やくそくする':'やくそくする','たいそうする':'たいそうする','ちゅうもんする':'ちゅうもんする','そうじする':'そうじする','料理する':'りょうりする','綺麗にする':'きれいにする',
            '使う':'つかう','頼む':'たのむ','足りる':'たりる','働く':'はたらく','つける':'つける','務める':'つとめる','飛ぶ':'とぶ','止まる':'とまる','吹く':'ふく','呼ぶ':'よぶ','けす':'けす'}

Verb_translation = {
    '行く':'идти','飲む':'пить','聞く':'слушать','話す':'говорить','読む':'читать','書く':'писать','買う':'покупать','持つ':'держать','出す':'выдавать','寝る':'спать','出る':'выходить','入る':'входить','起きる':'просыпаться','歌う':'петь','入る':'входить','走る':'бегать','ある':'быть','作る':'делать','言う':'говорить',
    '分かる':'понимать', '歩く':'ходить','思う':'думать','探す':'искать','取る':'брать','終わる':'заканчиваться','遊ぶ':'играть','続ける':'продолжать','学ぶ':'учиться','上る':'подниматься','売る':'продавать','旅行する':'путешествовать','待つ':'ждать','思い出す':'вспоминать','洗う':'мыть','会う':'встречать','直す':'исправлять','死ぬ':'умирать',
    '来る':'приходить','食べる':'есть','見る':'смотреть','死ぬ':'умирать','入れる':'вставлять','いる':'быть','上げる':'поднимать','着る':'надевать','答える':'отвечать','始める':'начинать','知っている':'знать','教える':'учить','起きる':'просыпаться','決める':'решать',
    'する':'делать','散歩する':'гулять','勉強する':'учиться','やくそくする':'договариваться','たいそうする':'заниматься физкультурой','ちゅうもんする':'заказывать','そうじする':'убирать','料理する':'готовить','綺麗にする':'делать красиво',
    '使う':'использовать','頼む':'просить','足りる':'хватать (быть достаточным)','働く':'работать','つける':'включать','務める':'выполнять обязанности','飛ぶ':'летать','止まる':'останавливаться','吹く':'дуть','呼ぶ':'звать','けす':'выключать'}

te = {
    '1 conjugation':{
        'む':'んで',
        'ぶ':'んで',
        'ぬ':'んで',
        'ぐ':'いで',
        'く':'いて',
        'す':'して',
        'う':'って',
        'つ':'って',
        'る':'って',
        'ふ':'んで',
        'づ':'で',
        'ず':'で',
    },
    '2 conjugation':{
        'る':'て'},
    'suru':{
        'する':'して'
    },
}

def lists_teform():
    new_list = []
    for i in Verbs:
        for j in Verbs[i]:
            new_list.append(j)
    sp = []
    for r in new_list:
        if r in Verbs['1 conjugation']:
            if r =='行く':
                hir =  r + ' -> ' + '行って'+', '+ 'いって'
            else:
                end = r[-1]
                r_without_end = r[:-1]
                hir_2 = Verbs_hir[r][:-1] + te['1 conjugation'][end]
                hir = r + ' -> ' + r_without_end + te['1 conjugation'][end]+', '+hir_2
            rus = Verb_translation[r]
            r = r +' - '+ Verbs_hir[r]
            sp.append((r,hir,rus))
        elif r in Verbs['2 conjugation']:
            end = r[-1]
            r_without_end = r[:-1]
            rus = Verb_translation[r]
            hir_2 = Verbs_hir[r][:-1] + te['2 conjugation'][end]
            hir = r + ' -> ' + r_without_end + te['2 conjugation'][end]+', '+hir_2
            r = r +' - '+ Verbs_hir[r]
            sp.append((r,hir,rus))
        elif r in Verbs['suru']:
            end = r[-2:]
            r_without_end = r[:-2]
            rus = Verb_translation[r]
            hir_2 = Verbs_hir[r][:-2] + te['suru'][end]
            hir = r + ' -> ' + r_without_end + te['suru'][end]+', '+hir_2
            r = r +' - '+ Verbs_hir[r]
            sp.append((r,hir,rus))
    return sp