# Все слова

from Grammar.fill_names import names, names_hir

a = {

# Местоимения
'uno' : {'この':'этот','その':'тот','あの':'вон тот'},
'uno_end':{'この':'этой','その':'той','あの':'вон той'},
'koko' : {'ここ':'здесь','そこ':'там','あそこ':'вон там'},
'desu' : {'です':'','ではありません':'не '},
'me_and_them':{'私':'я','私たち':'мы','あなた':'ты','あなたたち':'вы','彼':'он','彼女':'она','彼ら':'они','彼女ら':'они'},
'me_and_them_hir':{'私':'わたし','私たち':'わたしたち','あなた':'あなた','あなたたち':'あなたたち','彼':'かれ','彼女':'かのじょ','彼ら':'かれら','彼女ら':'かのじょら'},

'nowhere_no_one' : {'も':{'どこに':'нигде','だれ':'никто','何':'ничего'},
                    'か':{'どこ':'где-то','だれ':'кто-то','何':'что-то'},
                    'でも':{'どこ':'где угодно','だれ':'кто угодно','何':'что угодно'}}, 
'nowhere_no_one_hir' : {'も':{'どこに':'どこに','だれ':'だれ','何':'なに'},
                         'か':{'どこ':'どこ','だれ':'だれ','何':'なに'},
                        'でも':{'どこ':'どこ','だれ':'だれ','何':'なに'}},
                        
# существительные и люди
'names':names,
'names_hir':names_hir,
'profession':{'先生':'преподаватель','医者':'врач','店員':'продавец','大学生':'студент университета'},
'profession_hir':{'先生':'せんせい','医者':'いしゃ','店員':'てんいん','大学生':'だいがくせい',},
'profession_many':{'先生':'учителя','医者':'врачи','店員':'продавцы','大学生':'студенты университета'},
'family' : {'お父さん':'отец','お母さん':'мать','お兄さん':'брат','お姉さん':'сестра','妹':'младшая сестра','弟':'младший брат'},
'family_hur':{'お父さん':'おとうさん','お母さん':'おかあさん','お兄さん':'おにいさん','お姉さん':'おねえさん','妹':'いもうと','弟':'おとうと'},
'know_people':{'友達':'приятель','しりあい':'знакомый','友人': 'друг'},
'know_people_hir':{'友達':'ともだち','しりあい':'しりあい','友人': 'ゆうじん'},
'people':{'友達':'друзья','子供':'дети','中学生たち':'ученики'},
'people_hir':{'友達':'ともだち','子供':'こども','人々':'ひとびと', '中学生たち':'ちゅうがくせいたち'},
'food':{'ご飯':'рис','パン':'хлеб','肉':'мясо','魚':'рыбу','やさい':'овощи','果物':'фрукты','りんご':'яблоко'},
'food_hir':{'ご飯':'ごはん','パン':'パン','肉':'にく','魚':'さかな','やさい':'やさい','果物':'くだもの','りんご':'りんご'},
'animals':{'ねこ':'кошки','いぬ':'собаки', '魚':'рыбы','鳥':'птицы','こい':'карпы','からす':'вороны','白鳥':'лебеди',},
'animals_hir':{'ねこ':'ねこ','いぬ':'いぬ', '魚':'さかな','鳥':'とり','こい':'こい','からす':'からす','白鳥':'はくちょう',},

'small object':{'ざっし':'журнал','はこ':'короб','辞書':'словарь','本':'книга','教科書':'учебник',},
'small object_hir':{'ざっし':'ざっし','はこ':'はこ','本':'ほん','教科書':'きょうかしょ','辞書':'じしょ',},

'suffix for quantity':{'ざっし':'冊', 'はこ':'箱','辞書':'冊','本':'冊','教科書':'冊'},
'suffix for quantity_hir':{'ざっし':'さつ', 'はこ':'はこ','辞書':'さつ','本':'さつ','教科書':'さつ'},

'furniture':{'いす':'стул','つくえ':'стол','ふとん':'футон','階段':'лестница','電とう':'лампа',},
'furniture_hir':{'いす':'いす','つくえ':'つくえ','ふとん':'ふとん','階段':'かいだん','電とう':'でんとう'},

# Здания и страны, города
'buildings' : {'学校':'школа','駅':'станция','家':'дом','公園':'парк','図書館':'библиотека','大学':'университет','デパート':'магазин' },
'buildings_hir': {'学校': 'がっこう', '駅': 'えき', '家': 'いえ', '公園': 'こうえん', '図書館': 'としょかん', '大学': 'だいがく','デパート':'デパート'},
'street':{'公園':'парк','道':'дорога','橋':'мост','駅':'станция', 'とおり':'улица'},
'street_hir':{'公園':'こうえん','道':'みち','橋':'はし','駅':'えき','とおり':'とおり'},
'room':{ '教室':'класс','食堂':'столовая','図書館':'библиотека','部屋':'комната','台所':'кухня','おうせつ間':'японск. гостиная'},
'room_hir':{'教室':'きょうしつ','食堂':'しょくどう','図書館':'としょかん','部屋':'へや','台所':'だいどころ','おうせつ間':'おうせつま'},
'room_objects':{'まど':'окно','かべ':'стены','てんじょう':'потолок','ドア':'дверь','ゆか':'пол'},
'room_objects_hir':{'まど':'まど','かべ':'かべ','てんじょう':'てんじょう','ドア':'ドア','ゆか':'ゆか'},
'outsides':{'門限':'ворота', '松の木':'сосна',  '池':'пруд', '庭':'садик','はし':'мостик','花':'цветы'},
'outsides_hir':{'門限':'もんげん', '松の木':'まつのき',  '池':'いけ', '庭':'にわ','はし':'はし','花':'はな'},
'insides':{'部屋':'комната','台所':'кухня','お風呂':'ванна','廊下':'коридор','おうせつ間':'гостиная','日本間':'японская комната',},
'insides_hir':{'部屋':'へや','台所':'だいどころ','お風呂':'おふろ','廊下':'ろうか','おうせつ間':'おうせつま','日本間':'にほんま',},
'countries' : {'日本':'Япония','アメリカ':'США','イギリス':'Великобритания','フランス':'Франция','ロシア':'Россия'},
'countries_hir': {'日本': 'にほん', 'アメリカ': 'あめりか', 'イギリス': 'いぎりす', 'フランス': 'ふらんす', 'ロシア': 'ろしあ'},
'nationality':{ '日本人':'японец','アメリカ人':'американец','イギリス人':'англичанин','フランス人':'француз','ロシア人':'русский'},
'nationality_hir':{'日本人':'にほんじん','アメリカ人':'アメリカじん','イギリス人':'イギリスじん','フランス人':'フランスじん','ロシア人':'ロシアじん'},

# События, явления
'events' : {'授業':"урок",'散歩': "прогулка",'昼ごはん':"обед",},
'events_hir': {'授業': "じゅぎょう", '散歩': "さんぽ", '昼ごはん': "ひるごはん"},

'name_of_buildings_duct':{'コスモス':'Космос','サンダー':'Гром','アクアマリン':'Аквамарин','ミラージュ':'Мираж','フェニックス':'Феникс','オーロラ':'Аврора','ミストラル':'Мистраль'},
'name_of_buildings_duct_hir':{'コスモス':'コスモス','サンダー':'サンダー','アクアマリン':'アクアマリン','ミラージュ':'ミラージュ','フェニックス':'フェニックス','オーロラ':'オーロラ','ミストラル':'ミストラル'},

'seasons':{'春':'весна','夏':'лето','秋':'осень','冬':'зима'},
'seasons_hir':{'春':'はる','夏':'なつ','秋':'あき','冬':'ふゆ'},

'temperature':{'寒':'холодно','暖か':'тепло','涼し':'прохладно','暑':'жарко'},
'temperature_hir':{'寒':'さむ','暖か':'あたたか','涼し':'すずし','暑':'あつ'},

'can_do':{'スポーツ':'спорт','ゲーム':'игры','漢字':'кандзи','文法':'грамматика','文化':'культура',},
'can_do_hir':{'スポーツ':'スポーツ','ゲーム':'ゲーム','漢字':'かんじ','文法':'ぶんぽう','文化':'ぶんか'},

'senmon':{'歴史': 'история','文化': 'культура','けいざい':'экономика','文学':'литература'},
'senmon_hir':{'歴史': 'れきし','文化': 'ぶんか','けいざい':'けいざい','文学':'ぶんがく'},

'telling':{'日本の文学':'японская литература','日本の歴史': 'история Японии','日本の文化': 'культура Японии','漢字':'кандзи'},
'telling_hir':{'日本の文学':'にほんのぶんがく','日本の歴史': 'にほんのれきし','日本の文化': 'にほんのぶんか','漢字':'かんじ'},

'languages':{'日本語':'японский язык','英語':'английский язык','ロシア語':'русский язык'},
'languages_hir':{'日本語':'にほんご','英語':'えいご','ロシア語':'ろしあご'},
'end_lang':{'日本語':'по-японски','英語':'по-английски','ロシア語':'по-русски'},

'reasons':{'ひどい雨が降っていました':'шел ужасный дождь','天気がひどいでした':'погода была ужасная', 'たくさんの仕事があります':' много работы'},
'reasons_hir':{'ひどい雨が降っていました':'ひどいあめがふっていました','天気がひどいでした':'てんきがひどいでした', 'たくさんの仕事があります':'たくさんの仕事があります'},

'reasons_without_copula':{
    'ひどい雨が降って':'будет ужасный дождь','天気がひどくて':'погода будет ужасная',
    '頭が痛くなって':'голова заболит','たくさんの仕事があって':' будет много работы'},
'reasons_without_copula_hir':{
    'ひどい雨が降って':'ひどいあめがふって','天気がひどくて':'てんきがひどくて',
    '頭が痛くなって':'あたまがいたくなって','たくさんの仕事があって':'たくさんの仕事があって'},

'reasone_node':{
    'ひどい雨が降る':'ужасный дождь','天気がひどい':'погода ужасная','頭が痛い':'голова болит','たくさんの仕事がある':'много работы',
    '母は病気な':'мама болеет','そこににぎやかな':'там шумно'},

'reasone_node_hir':{
    'ひどい雨が降る':'ひどいあめがふる','天気がひどい':'てんきがひどい', '頭が痛い':'あたまがいたい','たくさんの仕事がある':'たくさんのしごとがある',
    '母は病気な':'はははびょうきな','そこににぎやかな':'そこににぎやかな'},

'reasons_naru':{ # наступила причина или состояние
    '天気がひどくなりました':'погода стала ужасной','風が強くなりました':'ветер стал сильным','疲れてなりました':'я устал',
    'にぎやかになりました':'стало шумно','しずかになりました':'стало тихо'},

'reasons_naru_hir':{ # наступила причина или состояние
    '天気がひどくなりました':'てんきがひどくなりました','風が強くなりました':'かぜがつよくなりました', '疲れてなりました':'つかれてなりました',
    'にぎやかになりました':'にぎやかになりました','しずかになりました':'しずかになりました'},

'reason_noun':{'病気':'болезни','私事':'личных дел','ストレス':'стресса','大雨':'сильного дождя'},

'reason_noun_hir':{'病気':'びょうき','私事':'しじ','ストレス':'ストレス','大雨':'おおあめ'},

'reasons_pos':{
    '休みです':'выходной','気分がいいです':'хорошее настроение','仕事が少ないです':'мало работы','ひまな時間があります':'есть свободное время',
    '空が青くなった':'небо стало синим'},

'reasons_pos_hir':{
    '休みです':'やすみです','気分がいいです':'きぶんがいいです','仕事が少ないです':'しごとがすくないです','ひまな時間があります':'ひまなじかんがあります',
    '空が青くなった':'そらがあおくなった'},

'reason_simple':{
    '天気がいい':'хорошая погода','気分がいい':'хорошее настроение','仕事が少ない':'мало работы','ひまな時間がある':'есть свободное время',
    '空が青くなった':'небо становится синим'},

'reason_simple_hir':{
    '天気がいい':'てんきがいい','気分がいい':'きぶんがいい','仕事が少ない':'しごとがすくない','ひまな時間がある':'ひまなじかんがある',
    '空が青くなった':'そらがあおくなった'},


'conditions':{'天気':'погоды','気温':'отопления','景色':'пейзажа','名所':'достопримечательности'},
'conditions_hir':{'天気':'てんき','気温':'きおん','景色':'けしき','名所':'めいしょ'},

# Пространственные послеслоги
'area':{'上':'над','下':'под','前':'перед','後ろ':'за','右側':'справа от','左側':'слева от ','中':'внутри','外':'снаружи','隣':'по соседству c','間':'между',
        'そば':'рядом с ','近く':'близко к ','遠く':'отдаленно от'},
'area_hir':{'上':'うえ','下':'した','前':'まえ','後ろ':'うしろ','右側':'みぎがわ','左側':'ひだりがわ','中':'なか','外':'そと','隣':'となり','間':'あいだ',
            'そば':'そば','近く':'ちかく','遠く':'とおく'},

# Окончания ко всему
'end_predicative':{'しずか':'тихим','きれい':'чистым','にぎやか':'оживленным','すてき':'прекрасным','ゆう名':'знаменитым'},
'end_telling':{'歴史':'об истории Японии','日本の文学':'о японской литературе','日本の歴史': 'об истории Японии','日本の文化': 'о японской культуре','漢字':'о кандзи'},
'end_proffesion':{'先生':'преподавателем','医者':'врачом','店員':'продавцом','大学生':'студентом университета'},
'end_proffesion2':{'先生':'преподавателей','医者':'врачей','店員':'продавцов','大学生':'студентов университета'},
'end_adverbs':{'近く':'ближайшему/ей','遠く':'отдаленному/ой'},
'end_can':{'スポーツ':'спорте','ゲーム':'играх','漢字':'кандзи','文法':'грамматике','文化':'культуре'},
'end_street':{'公園':'парку','道':'дороге','橋':'мосту','駅':'станции', 'とおり':'улице'},
'end_animals':{'ねこ':'кошек','いぬ':'собак','魚':'рыб','鳥':'птиц','こい':'карпов','からす':'ворон','白鳥':'лебедей'},
'end_food':{'ご飯':'рис','パン':'хлеб','肉':'мясо','魚':'рыбу','やさい':'овощи','果物':'фрукты','りんご':'яблоки'},
'end_events':{'授業':'урока','散歩':'прогулки','昼ごはん':'обеда'},
'end_events2':{'授業':'урок','散歩':'прогулку','昼ごはん':'обед'},
'end_events3':{'授業':'уроке','散歩':'прогулке','昼ごはん':'обеде'},
'end_build' : {'学校':'школы','駅':'станции','家':'дома','公園':'парка','図書館':'библиотеки','大学':'университета','デパート': 'магазина'},
'end_build2' : {'学校':'школу','駅':'станцию','家':'домой','公園':'парк','図書館':'библиотеку','大学':'университет', 'デパート': 'магазин'},
'end_build3':{ '学校': 'школе', '駅': 'станции', '家': 'дому', '公園': 'парку', '図書館': 'библиотеке', '大学': 'университету', 'デパート': 'магазину'},
'end_build4':{ '学校': 'школе', '駅': 'станции', '家': 'дома', '公園': 'парке', '図書館': 'библиотеке', '大学': 'университете', 'デパート': 'магазине'},
'end_build5':{'学校': 'школой', '駅': 'станцией', '家': 'домом', '公園': 'парком', '図書館': 'библиотекой', '大学': 'университетом', 'デパート': 'магазином'},
'end_room' : {'教室':'классе','食堂':'столовой','図書館':'библиотеке','部屋':'комнате','台所':'кухне','おうせつ間':'гостиной'},
'end_outsides':{'門限':'воротами', '松の木':'сосной',  '池':'прудом', '庭':'садиком','はし':'мостиком','花':'цветами'},
'end_outsides_2':{'門限':'ворот', '松の木':'сосны',  '池':'пруда', '庭':'садика','はし':'мостика','花':'цветов'},
'end_insides':{'部屋':'комнате','台所':'кухне','お風呂':'ванне','廊下':'коридоре','おうせつ間':'гостиной','日本間':'японской комнате',},
'end_insides2':{'部屋':'комнаты','台所':'кухни','お風呂':'ванны','廊下':'коридора','おうせつ間':'гостиной','日本間':'японской комнате',},
'end_insides3':{'部屋':'комнатой','台所':'кухней','お風呂':'ванной','廊下':'коридором','おうせつ間':'гостиной','日本間':'японской комнатой',},
'end_insides4':{'部屋':'комнату','台所':'кухню','お風呂':'ванну','廊下':'коридор','おうせつ間':'гостиную','日本間':'японскую комнату',},
'end_countries' : {'日本':'Японии','アメリカ':'США','イギリス':'Великобритании','フランス':'Франции','ロシア':'России'},
'end_countries2' : {'日本':'Японию','アメリカ':'США','イギリス':'Великобританию','フランス':'Францию','ロシア':'Россию'},
'end_family' : {'お父さん':'отца','お母さん':'мать','お兄さん':'брата','お姉さん':'сестру','妹':'младшую сестру','弟':'младшего брата'},
'end_family2' : {'お父さん':'отцу','お母さん':'матери','お兄さん':'брату','お姉さん':'сестре','妹':'младшей сестре','弟':'младшему брату'},
'end_family3' : {'お父さん':'отцом','お母さん':'матерью','お兄さん':'братом','お姉さん':'сестрой','妹':'младшей сестрой','弟':'младшим братом'},
'end_family4' : {'お父さん':'отца','お母さん':'матери','お兄さん':'брата','お姉さん':'сестры','妹':'младшей сестры','弟':'младшего брата'},
'end_know':{'友達':'приятеля','しりあい':'знакомого','友人': 'друга'},
'end_know2':{'友達':'приятелю','しりあい':'знакомому','友人': 'другу'},
'end_know3':{'友達':'приятелем','しりあい':'знакомым','友人': 'другом'},
'end_know4':{'友達':'приятеля','しりあい':'знакомого','友人': 'друга'},
'end_furniture':{
    '上':{'いす':'стуле','つくえ':'столе','ふとん':'футоне','階段':'лестнице','電とう':'лампе',},
    '下':{'いす':'стулом','つくえ':'столом','ふとん':'футоном','階段':'лестницей','電とう':'лампой'},
    '右側':{'いす':'стула','つくえ':'стола','ふとん':'футона','階段':'лестницы','電とう':'лампы'}},
'end_mounths':{'一月':'в январе','二月':'в феврале','三月':'в марте','四月':'в апреле','五月':'в мае'},

# Окончания к существительным с числительными
'end_small_1':{'いす':'стул','つくえ':'стол','ふとん':'футон','階段':'лестница',
        'ざっし':'журнал','はこ':'короб','本':'книга','教科書':'учебник','辞書':'словарь'},
'end_small_2':{'いす':'стула','つくえ':'стола','ふとん':'футона','階段':'лестницы','辞書':'словаря',
         'ざっし':'журнала','はこ':'короба','本':'книги','教科書':'учебника',},
'end_small_5':{'いす':'стульев','つくえ':'столов','ふとん':'футонов','階段':'лестниц',
         'ざっし':'журналов','はこ':'коробов','本':'книг', '辞書':'словарей', '教科書':'учебников',},
'end_small_address':{
    'いす':'стул','つくえ':'стол','ふとん':'футон','階段':'лестницу',
    'ざっし':'журнал','はこ':'короб','本':'книгу','教科書':'учебник','辞書':'словарь'},
'end_return_small_object':{
    'いす':'стула','つくえ':'стола','ふとん':'футона','階段':'лестницы',
    'ざっし':'журнала','はこ':'короба','本':'книги','教科書':'учебника','辞書':'словаря',},
'end_get_small_object':{
    'いす':'стул','つくえ':'стол','ふとん':'футон','階段':'лестницу',
    'ざっし':'журнал','はこ':'короб','本':'книгу','教科書':'учебник','辞書':'словарь'},

# Наречия
'adverbs':{
    'positiv':{'とても':'очень','本当に':'действительно'},
    'negativ':{'あまり':' не очень','全然':'совсем не','そう':'не настолько', 'すこしも':'нисколько не'},
    'negativ2':{'たいへん':'очень'},
    'neutral':{'たいてい':'по большей части','ふつう':'обычно','時々':'иногда','めったに':'редко','もう':'уже','また':'опять', 'たった':'пока еще','いつも':'всегда','よく':'часто'},
    'person':{'ふだん':'обычно','しずかに':'тихо','早く':'быстро','ゆっくり':'не спеша','時々':'иногда','いつも':'всегда','よく':'часто','遠く':'долго','急いで':'поспешно', 'たいてい':'по большей части', '遅いで':'медленно'},
    'jyozu':{'上手に':'умело','下手に':'не умело',},
    'for_space':{'近く':'ближайший ','遠く':'отдаленный'},
    'numb':{'少ない':'немного','たくさん':'много','多い':'много','大ぜい':'немного'}},

'adverbs_hir':{
    'positiv':{'とても':'とても','もう':'もう','本当に':'ほんとうに'},
    'negativ':{'あまり':'あまり','全然':'ぜんぜん','そう':'そう','すこしも':'すこしも'},
    'negativ2':{'たいへん':'たいへん'},
    'neutral':{'たいてい':'たいてい','ふつう':'ふつう','時々':'ときどき','めったに':'めったに','もう':'もう','また':'また', 'たった':'たった','いつも':'いつも','よく':'よく'},
    'person':{'ふだん':'ふだん','しずかに':'しずかに','早く':'はやく','ゆっくり':'ゆっくり','時々':'ときどき','いつも':'いつも','よく':'よく','遠く':'とおく','急いで':'いそいで', 'たいてい':'たいてい', '遅いで':'おそいで'},
    'jyozu':{'上手に':'じょうずに','下手に':'へたに',},
    'for_space':{'近く':'ちかく','遠く':'とおく'},
    'numb':{'少ない':'すくない','たくさん':'たくさん','多い':'おおい','大ぜい':'おおぜい'}
    },

# Суффиксы
'suff':{'さん':'-сан','くん':'-кун'},
'suff_no':{'さん':'-сана','くん':'-куна'},
'suff_no2':{'さん':'-сану','くん':'-куну'},
'suff_no3':{'さん':'-саном','くん':'-куном'},

# Числа
'numbers':{'1':'一','2':'二','3':'三','4':'四','5':'五','6':'六','7':'七','8':'八','9':'九','10':'十'},
'numbers2':{'1':'いち','2':'に','3':'さん','4':'よん','5':'ご','6':'ろく','7':'なな','8':'はち','9':'きゅう','10':'じゅう'},
'numbers_hir':{'1':'ひと','2':'ふた','3':'みっ','4':'よっ','5':'いつ','6':'むっ','7':'なな','8':'やっ','9':'ここの','10':'じゅう','15':'じゅうご','20':'にじゅう','30':'さんじゅう','40':'よんじゅう','50':'ごじゅう','25':'にじゅうご','35':'さんじゅうご','45':'よんじゅうご',},
'numbers_rus':{'1':'один','2':'вдвоем','3':'втроем','4':'вчетвером','5':'впятером','6':'вшестером','7':'всемером','8':'ввосьмером','9':'вдевятером','10':'вдесятером'},
'minutes_hir':{'1':'いっぷん','2':'にふん','3':'さんぷん','4':'よんぷん','5':'ごふん','6':'ろっぷん','7':'ななふん','8':'はっぷん','9':'きゅうふん','10':'じゅっぷん','15':'じゅうごふん','20':'にじゅっぷん','30':'さんじゅっぷん','40':'よんじゅっぷん','50':'ごじゅっぷん','25':'にじゅうごふん','35':'さんじゅうごふん','45':'よんじゅうごふん',},

'階':{'read':{'1':'いっかい','2':'にかい','3':'さんがい','4':'よんかい','5':'ごかい','6':'ろっかい','7':'ななかい','8':'はっかい','9':'きゅうかい','10':'じゅっかい'},
    'ending':{'1':'этаж','2':'этажа','3':'этажа','4':'этажа','5':'этажей','6':'этажей','7':'этажей','8':'этажей','9':'этажей','10':'этажей'},
    'ending2':{'1':'первом','2':'втором','3':'третьем','4':'четвертом','5':'пятом','6':'шестом','7':'седьмом','8':'восьмом','9':'девятом','10':'десятом'}},

# Глаголы и их формы
'glagol': {
    'move':{'行': "い", '歩いて行': 'あるいてい'},
    'not_trans_fast_men':{'寝': 'ね', '起': 'おき' },
    'not_trans_fast_ev':{'始ま': 'はじま', '終': 'おわ'},
    'not_trans_slow':{ '勉強': 'べんきょう','休':'やす', '散歩':'さんぽ'},
    'accusative':{'読':'よ','食':'たべ', '買':'か','ちゅうもん':'ちゅうもん','作':'つく'},
    'address': {'書':'か'},
    'withs':{'話':'はな','会':'あ'},
    'hygiene':{'みが':'みが','洗':'あら','走':'はし','着がえ':'きがえ',}},

'glag_for_build':{
    '読':['図書館','家','学校','大学'],
    '書':['学校','家','図書館','大学'],
    '食':['公園','家'],
    '買':['デパート',],
    'ちゅうもん':['デパート'],
    '作':['家']},

'glag_nast_post':{
    '行':'едет','歩いて行':'ходит пешком','寝':'засыпает','起':'просыпается','始ま':'начинается','終':'кончается',
    '勉強':'занимается','読':'читает','休':'отдыхает','散歩':'гуляет','書':'пишет','食':'ест','買':'покупает',
    'ちゅうもん':'заказывает','作':'делает','話':'говорит','会':'встречается','みが':'чистит','洗':'моется','走':'бегает','着がえ':'переодевается',},

'glag_budush':{
    '行':'поедет','歩いて行':'пойдет пешком','寝':'пойдет спать','起':'проснется','始ま':'начнется','終':'кончится',
    '勉強':'займётся','読':'почитает','休':'отдохнет','散歩':'погуляет','書':'напишет','食':'поест','買':'купит',
    'ちゅうもん':'закажет','作':'сделает','話':'поговорит','会':'встретится','みが':'почистит','洗':'помоется','走':'побегает','着がえ':'переоденется',},

'glag_result':{
    '読':'прочитан','書':'написан','食':'съеден','買':'куплен','ちゅうもん':'заказан','作':'сделан (приготовлен)',},

'glag_now':{
    '行':'едет','歩いて行':'идёт пешком','寝':'спит','起':'просыпается','始ま':'начинается','終':'кончается',
    '勉強':'занимается','読':'читает','休':'отдыхает','散歩':'гуляет','書':'пишет','食':'ест','買':'покупает',
    'ちゅうもん':'заказывает','作':'делает','話':'говорит','会':'встречается','みが':'чистит','洗':'моется','走':'бегает','着がえ':'переодевается',},

'glag_past_post':{
    '行':'ездил','歩いて行':'ходил пешком','寝':'ложился спать','起':'проснулся','始ま':'начался','終':'кончился',
    '勉強':'занимался','読':'читал','休':'отдыхал','散歩':'гулял','書':'писал','食':'ел','買':'покупал',
    'ちゅうもん':'заказывал','作':'делал','話':'говорил','会':'встречался','みが':'чистил','洗':'мылся','走':'бегал','着がえ':'переодевался',},

'glag_past_one_moment':{
    '行':'поехал','歩いて行':'пошел пешком','寝':'пошел спать','起':'проснулся','始ま':'начался','終':'кончился',
    '勉強':'занимался','読':'прочитал','休':'отдохнул','散歩':'гулял','書':'написал','食':'поел','買':'купил',
    'ちゅうもん':'заказал','作':'сделал','話':'поговорил','会':'встретился','みが':'почистил','洗':'помылся','走':'побегал','着がえ':'переоделся',},

'glag_past_one_moment2':{
    '行':'уехал','歩いて行':'прошел пешком','寝':'лег спать','起':'проснулся','始ま':'начал','終':'закончил',
    '勉強':'занимался','読':'прочитал','休':'отдохнул','散歩':'погулял','書':'написал','食':'поел','買':'купил',
    'ちゅうもん':'заказал','作':'сделал','話':'поговорил','会':'встретился','みが':'почистил','洗':'помылся','走':'прибежал','着がえ':'переоделся',},

'glag_gerund_past':{
    '行':'поехав','歩いて行':'пройдя пешком','寝':'положившись спать','起':'проснувшись','始ま':'начав','終':'закончив',
    '勉強':'занимавшись','読':'прочитав','休':'отдохнув','散歩':'погуляв','書':'написав','食':'поев','買':'купив',
    'ちゅうもん':'заказав','作':'сделав','話':'поговорив','会':'встретившись','みが':'почистив','洗':'помывшись','走':'побегая','着がえ':'переодевшись',},

'glag_masyou':{
    '行':'поедем','歩いて行':'пойдем пешком','寝':'пойдем спать','起':'проснемся','始ま':'начнем','終':'закончим',
    '勉強':'позанимаемся','読':'почитаем','休':'отдохнем','散歩':'погуляем','書':'напишем','食':'поедим','買':'купим',
    'ちゅうもん':'закажем','作':'сделаем','話':'поговорим','会':'встретимся','みが':'почистим','洗':'помоемся','走':'побегаем','着がえ':'переоденемся',},

'glag_kudasai':{
    '行':'приезжайте','歩いて行':'пройдите пешком','寝':'пойдите спать','起':'проснитесь','始ま':'начнется','終':'закончится',
    '勉強':'займитесь','読':'почитайте','休':'отдохните','散歩':'погуляйте','書':'напишите','食':'поешьте','買':'купите',
    'ちゅうもん':'закажите','作':'сделайте','話':'поговорите','会':'встретитесь','みが':'почистьте','洗':'помойтесь','走':'побегайте','着がえ':'переоденьтесь',},

'glag_kudasai_rude':{
    '行':'приезжай','歩いて行':'пройди пешком','寝':'пойди спать','起':'проснись','始ま':'начни','終':'закончи',
    '勉強':'займись','読':'почитай','休':'отдохни','散歩':'погуляй','書':'напиши','食':'поешь','買':'купи',
    'ちゅうもん':'закажи','作':'сделай','話':'поговори','会':'встреться','みが':'почисть','洗':'помойся','走':'побегай','着がえ':'переоденься',},

'glag_nagara':{
    '行':'во время поездки','歩いて行':'проходя пешком','寝':'засыпая','起':'просыпаясь','始ま':'начиная','終':'кончая',
    '勉強':'занимаясь','読':'читая','休':'отдыхая','散歩':'гуляя','書':'во время написания','食':'во время еды','買':'покупая',
    'ちゅうもん':'заказывая','作':'делая','話':'разговаривая','会':'встречаясь','みが':'чистя','洗':'умываясь','走':'бегая','着がえ':'переодеваясь',},

'glag_verb_stem':{
    '行':'ходить','歩いて行':'ходить пешком','寝':'засыпать','起':'просыпаться','始ま':'начинаться','終':'кончаться',
    '勉強':'заниматься','読':'читать','休':'отдыхать','散歩':'гулять','書':'писать','食':'есть','買':'покупать',
    'ちゅうもん':'заказывать','作':'делать','話':'говорить','会':'встречаться','みが':'чистить','洗':'мыться','走':'бегать','着がえ':'переодеваться',},

'glag_verb_stem_2':{
    '行':'пойти','歩いて行':'пойти пешком','寝':'пойти спать','起':'проснуться','始ま':'начать','終':'закончить',
    '勉強':'заняться','読':'почитать','休':'отдохнуть','散歩':'погулять','書':'написать','食':'поесть','買':'купить',
    'ちゅうもん':'заказать','作':'сделать','話':'поговорить','会':'встретиться','みが':'почистить','洗':'помыться','走':'побегать','着がえ':'переодеться',},

'glag_im_going_todo':{
    '行':'поеду','歩いて行':'пойду пешком','寝':'пойду спать','起':'проснусь','始ま':'начну','終':'закончу',
    '勉強':'позанимаюсь','読':'почитаю','休':'отдыхну','散歩':'погуляю','書':'напишу','食':'поем','買':'куплю',
    'ちゅうもん':'закажу','作':'сделаю','話':'поговорю','会':'встречусь','みが':'почищу','洗':'помоюсь','走':'побегаю','着がえ':'переоденусь',},

'glag_im_doing':{
    '行':'езжу','歩いて行':'иду пешком','寝':'сплю','起':'просыпаюсь','始ま':'начинаю','終':'заканчиваю',
    '勉強':'занимаюсь','読':'читаю','休':'отдыхаю','散歩':'гуляю','書':'пишу','食':'ем','買':'покупаю',
    'ちゅうもん':'заказываю','作':'делаю','話':'говорю','会':'встречаюсь','みが':'чищу','洗':'моюсь','走':'бегаю','着がえ':'переодеваюсь',},

'glag_passive_eba':{'読':'прочитан(а)','書':'написан ','食':'съеден(а)','買':'куплен(а)','ちゅうもん':'заказн','作':'изготовлен(а)',},

'keigo_dict':  {
    '見': ['ご覧になる', 'ごらんになる'],
    '言': ['おっしゃる', 'おっしゃる'],
    '食': ['召し上がる', 'めしあがる'],
    '飲': ['召し上がる', 'めしあがる'],
    '来': ['いらっしゃる', 'いらっしゃる'],
    '行': ['いらっしゃる', 'いらっしゃる'],
    '居': ['いらっしゃる', 'いらっしゃる'],
    '寝': ['お休みになる', 'おやすみになる'],
    '知': ['ご存知でいらっしゃる', 'ごぞんじでいらっしゃる'],
    '貰': ['いただく', 'いただく'],
    '思': ['思し召す', 'おぼしめす'],},

'keigo_dict_me':  {
    '見': ['拝見する', 'はいけんする'],
    '言': ['申し上げる', 'もうしあげる'],
    '食': ['いただく', 'いただく'],
    '飲': ['いただく', 'いただく'],
    '来': ['参る', 'まいる'],
    '行': ['参る', 'まいる'],
    '居': ['おる', 'おる'],
    '知': ['存じる', 'ぞんじる'],
    '会': ['お目にかかる', 'おめにかかる'],
    '待': ['お待ちする', 'おまちする'],
    '思': ['存じる', 'ぞんじる'],
    '訪': ['伺う', 'うかがう'],
    '書': ['お書きする', 'おかきする'],
    '与': ['差し上げる', 'さしあげる'],
    '貰': ['いただく', 'いただく'],
    '見': ['お目にかける', 'おめにかける'],
    '尋': ['伺う', 'うかがう'],
    '教': ['ご説明する', 'ごせつめいする']},

'kango_verbs':['勉強','そうじ','電話','質問','練習','ちゅうもん','散歩','洗たく','料理', 'たいそう', 'やくそく'],

'glag_form':{
    '行':{1:'か',2:'き',3:'く',4:'け',5:'こう',6:'って',7:'った', 8:'っちゃった'},
    '歩いて行':{1:'か',2:'き',3:'く',4:'け',5:'こう',6:'って',7:'った', 8:'っちゃった'},
    '寝':{1:'',2:'',3:'る',4:'れ',5:'よう',6:'て',7:'た', 8:'ちゃった'},
    '起':{1:'',2:'',3:'る',4:'れ',5:'よう',6:'て',7:'た', 8:'ちゃった'},
    '勉強':{1:'さ',2:'し',3:'する',4:'しれ',5:'しよう',6:'して',7:'した', 8:'しちゃった'},
    '始ま':{1:'ら',2:'り',3:'る',4:'れ',5:'ろう',6:'って',7:'った', 8:'っちゃった'},
    '終':{1:'ら',2:'り',3:'る',4:'れ',5:'ろう',6:'って',7:'った', 8:'っちゃった'},
    '読':{1:'ま',2:'み',3:'む',4:'め',5:'もう',6:'んで',7:'んだ', 8:'んじゃった'},
    '書':{1:'か',2:'き',3:'く',4:'け',5:'こう',6:'いて',7:'いた', 8:'いちゃった'},
    '休':{1:'ま',2:'み',3:'む',4:'め',5:'みょう',6:'んで',7:'んだ', 8:'んじゃった'},
    '食':{1:'',2:'',3:'る',4:'れ',5:'よう',6:'て',7:'た', 8:'ちゃった'},
    '買':{1:'わ',2:'い',3:'う',4:'え',5:'おう',6:'って',7:'った', 8:'っちゃった'},
    'ちゅうもん':{1:'さ',2:'し',3:'する',4:'すれ',5:'しよう',6:'して',7:'した', 8:'しちゃった'},
    '散歩':{1:'さ',2:'し',3:'する',4:'すれ',5:'しよう',6:'して',7:'した', 8:'しちゃった'},
    '話':{1:'さ',2:'し',3:'す',4:'せ',5:'しよう',6:'して',7:'した',8:'しちゃった'},
    '会':{1:'わ',2:'い',3:'う',4:'え',5:'おう',6:'って',7:'った', 8:'っちゃった' },
    '作':{1:'ら',2:'り',3:'る',4:'れ',5:'ろう',6:'って',7:'った', 8:'っちゃった'},
    '洗':{1:'わ',2:'い',3:'う',4:'え',5:'おう',6:'って',7:'った', 8:'っちゃった'},
    'みが':{1:'か',2:'き',3:'く',4:'け',5:'きょう',6:'いて',7:'いた', 8:'いちゃった' },
    '走':{1:'ら',2:'り',3:'る',4:'れ',5:'ろう',6:'って',7:'った', 8:'っちゃった' },
    '着がえ':{1:'',2:'',3:'る',4:'れ',5:'よう',6:'て',7:'た', 8:'ちゃった'},
    },

'glagol_2_conjugation':['食','起','寝'],

'glag_accusative':{
    '読':{'本':'книгу','新聞':'газету','手紙':'письмо','ざっし':'журнал','辞書':'словарь','小説':'роман','文章':'текст',},
    '食':{'ご飯':'рис','パン':'хлеб','肉':'мясо','魚':'рыбу','やさい':'овощи','果物':'фрукты'},
    '買':{'本':'книгу','新聞':'газету','ざっし':'журнал','辞書':'словарь','お茶':'чай','コーヒー':'кофе','ケーキ':'торт','果物':'фрукты','服':'одежду'},
    'ちゅうもん':{'お茶':'чай','コーヒー':'кофе','ケーキ':'торт','果物':'фрукты'},
    '作':{'料理':'блюда','ビデオ':'видео','絵':'картину','服':'одежду','食べ物':'еду','ジャム':'варенье','ケーキ':'торт'},
    },

'glag_accusative_hir':{
    '読':{'本':'ほん','新聞':'しんぶん','手紙':'てがみ','ざっし':'ざっし','辞書':'じしょ','小説':'しょうせつ','文章':'ぶんしょう',},
    '食':{'ご飯':'ごはん','パン':'パン','肉':'にく','魚':'さかな','やさい':'やさい','果物':'くだもの'},
    '買':{'本':'ほん','新聞':'しんぶん','ざっし':'ざっし','辞書':'じしょ','お茶':'おちゃ','コーヒー':'コーヒー','ケーキ':'ケーキ','果物':'くだもの','服':'ふく'},
    'ちゅうもん':{'お茶':'おちゃ','コーヒー':'コーヒー','ケーキ':'ケーキ','果物':'くだもの'},
    '作':{'料理':'りょうり','ビデオ':'ビデオ','絵':'え','服':'ふく','食べ物':'たべもの','ジャム':'ジャム','ケーキ':'ケーキ'},
    },

'glag_accusative_passive':{
    '読':{'本':'книга','新聞':'газета','手紙':'письмо','ざっし':'журнал','辞書':'словарь','小説':'роман','文章':'текст',},
    '食':{'ご飯':'рис','パン':'хлеб','肉':'мясо','魚':'рыба','やさい':'овощи','果物':'фрукты'},
    '買':{'本':'книга','新聞':'газета','ざっし':'журнал','辞書':'словарь','お茶':'чай','コーヒー':'кофе','ケーキ':'торт','果物':'фрукты','服':'одежда'},
    'ちゅうもん':{'お茶':'чай','コーヒー':'кофе','ケーキ':'торт','果物':'фрукты'},
    '作':{'料理':'блюда','ビデオ':'видео','絵':'картина','服':'одежда','食べ物':'еда','ジャム':'варенье','ケーキ':'торт'},
    },

'glag_instrument':{
    '書':{'ペン':'ручкой','ふで':'кистью','ひらがな':'хираганой','漢字':'иероглифами'},
    '食':{'はし':'палочками','スプーン':'ложкой','フォーク':'вилкой'},
    '勉強':{'ビデオ:':'по видео','教科書':'по учебнику','自分':'сам'},
    '行':{'電車':'на поезде','バス':'на автобусе','自転車':'на велосипеде','電車':'на поезде','地下鉄':'на метро'},
    '作':{'自分':'сам'}},

'glag_instrument_hir':{
    '書':{'ペン':'ペン','ふで':'ふで','ひらがな':'ひらがな','漢字':'かんじ'},
    '食':{'はし':'はし','スプーン':'スプーン','フォーク':'フォーク'},
    '勉強':{'ビデオ:':'ビデオ','教科書':'きょうかしょ','自分':'じぶん'},
    '行':{'電車':'でんしゃ','バス':'バス','自転車':'じてんしゃ','電車':'でんしゃ','地下鉄':'ちかてつ'},
    '作':{'自分':'じぶん'}},

'instrument_osnova':{'ペン':'ручка','ふで':'кисть','ひらがな':'хирагана','漢字':'иероглифы','はし':'палочки','スプーン':'ложка','フォーク':'вилка', 'ビデオ':'видео','教科書':'учебник','自分':'сам','電車':'поезд','バス':'автобус','自転車':'велосипед','地下鉄':'метро'},

'glag_instrument_hir_for_glagoles' : {'書':'き','食':'たべ','勉強':'べんっきょう','行':'い','作':'つく',},

# Для времени
'posleslogi' : {'の前に':"до","の後で": "после"},
'posleslogi_hir': {'の前に': "のまえに", "の後で": "のあとで"},

'mounths':{'一月':'январь','二月':'февраль','三月':'март','四月':'апрель','五月':'май'},
'mounths_hir':{'一月':'いちがつ','二月':'にがつ','三月':'さんがつ','四月':'しがつ','五月':'ごがつ'},

'hours' : {
    '午前':{'七時':'7','八時':'8','九時':'9','十時':'10','十一時':'11','十二時':'12'},
    '午後':{'一時':'13','二時':'14','三時':'15','四時':'16','五時':'17','六時':'18','七時':'19',}},

'hours_hir': {
        '午前': {'八時': 'はちじ', '九時': 'くじ', '十時': 'じゅうじ', '十一時': 'じゅういちじ', '十二時': 'じゅうにじ'},
        '午後': {'一時': 'いちじ', '二時': 'にじ', '三時': 'さんじ', '四時': 'よじ', '五時': 'ごじ', '六時': 'ろくじ', '七時': 'しちじ'}},

'hours_rus_day':{'一時':'ночи','二時':'ночи','三時':'ночи','四時':'утра','五時':'утра','六時':'утра','七時':'утра','八時':'утра'},

'hours_rus' : {
    '午前':{'七時':'часов','八時':'часов','九時':'часов','十時':'часов','十一時':'часов','十二時':'часов'},
    '午後':{'一時':'часов','二時':'часов','三時':'часов','四時':'часов','五時':'часов','六時':'часов','七時':'часов'}},

'hours_han':{
    '一時':'первого','二時':'второго','三時':'третьего','四時':'четвертого','五時':'пятого','六時':'шестого','七時':'седьмого','八時':'восьмого','九時':'девятого','十時':'десятого','十一時':'одиннадцатого','十二時':'двенадцатого'},

'week':{'月曜日':'понедельник','火曜日':'вторник','水曜日':'среда','木曜日':'четверг','金曜日':'пятница','土曜日':'суббота','日曜日':'воскресенье'},
'week_hir':{'月曜日':'げつようび','火曜日':'かようび','水曜日':'すいようび','木曜日':'もくようび','金曜日':'きんようび','土曜日':'どようび','日曜日':'にちようび'},
'weeK_ending':{'月曜日':'понедельник','火曜日':'вторник','水曜日':'среду','木曜日':'четверг','金曜日':'пятницу','土曜日':'субботу','日曜日':'воскресенье'},

# Свойства словарей
'adj_for_buildings' : {
    '学校': {'中':'средняя', '小':'младшая', '新し':'новая', '古':'старая','すてき':'прекрасная','ゆう名':'знаменитая',},
    '駅':{'あさくさ':'Асакуса','うえの':'Уэно','しんじゅく':'Синдзюку','しながわ':'Синагава',},
    '家':{'明子さん':'Акико','いしだ':'Исида','三木さん':'Мики','富山さん':'Тояма'},
    '公園':{'うえの':'Уэно','しんじゅく':'Синдзюку','しながわ':'Синагава','すてき':'прекрасный','ゆう名':'знаменитый',},
    '大学':{'東京':'Токийский','京都':'Киотский','すてき':'прекрасный','ゆう名':'знаменитый'},
    '図書館':{'大学':'университетская','公立':'городская','私立':'частная','国立':'государственный','学校':'школьная','すてき':'прекрасная'},
    'デパート':{'新し':'новый', '古':'старый','すてき':'прекрасный'},},

'adj_for_buildings_hir': {
    '学校': {'中': 'ちゅう', '小': 'しょう', '新し': 'あたらしい', '古': 'ふるい', 'すてき': 'すてき', 'ゆう名': 'ゆうめ', },
    '駅': {'あさくさ': 'あさくさ', 'うえの': 'うえの', '東京': 'とうきょう', 'しんじゅく': 'しんじゅく', 'しながわ': 'しながわ', },
    '家': {'明子さん': 'あきこ', 'いしだ': 'いしだ', '三木さん': 'みき', '富山さん': 'とやま'},
    '公園': {'うえの': 'うえの', 'しんじゅく': 'しんじゅく',  'しながわ': 'しながわ', 'すてき': 'すてき', 'ゆう名': 'ゆうめ', },
    '大学': {'東京': 'とうきょう',  '京都': 'きょうと', 'すてき': 'すてき', 'ゆう名': 'ゆうめ'},
    '図書館': {'大学': 'だいがく', '公立': 'こうりつ', '私立': 'しりつ', '国立': 'こくりつ', '学校': 'がっこう', 'すてき': 'すてき'},
    'デパート': {'新し': 'あたらし', '古': 'ふる',  'すてき': 'すてき'},},

'adj_for_small_object':{
    'ざっし': {'新し':'новый', '古':'старый','おもしろ':'интересный', 'つまらな':'скучный','高':'дорогой','安':'дешевый'},
    'はこ': {'大き':'большой', '小さ':'маленький', 'かる':'легкий','赤':'красный','青':'синий','黄色':'желтый','白':'белый','黒':'черный','茶色':'коричневый'},
    'かばん': {'かる':'легкий','新し':'новый', '古':'старый','赤':'красный','青':'синий','黄色':'желтый','白':'белый','黒':'черный','茶色':'коричневый'},
    '辞書':{'高':'дорогой','安':'дешевый'},
    '本':{ 'おもしろ':'интересная', 'つまらな':'скучная','高':'дорогая','安':'дешевая'},
    '教科書':{'新し':'новый','むずかし':'сложный','やさし':'простой','高':'дорогой','安':'дешевый'}},

'adj_for_small_object_hir':{
    'ざっし': {'新し':'あたらし', '古':'ふる','おもしろ':'おもしろ', 'つまらな':'つまらな','高':'たか','安':'やす'},
    'はこ': {'大き':'おおき', '小さ':'ちいさ',  'かる':'かる','赤':'あか','青':'あお','黄色':'きいろ','白':'しろ','黒':'くろ','茶色':'ちゃいろ'},
    'かばん': {'かる':'かる','新し':'あたらし', '古':'ふる','赤':'あか','青':'あお','黄色':'きいろ','白':'しろ','黒':'くろ','茶色':'ちゃいろ'},
    '辞書':{'高':'たか','安':'やす',},
    '本':{ 'おもしろ':'おもしろ', 'つまらな':'つまらな','高':'たか','安':'やす'},
    '教科書':{'新し':'あたらし','むずかし':'むずかし','やさし':'やさし','高':'たか','安':'やす'},},

'adj_rooms_si':{
    'positive':{'広い':'широкие','高い':'высокие','大きい':'большие','明るい':'светлые'},
    'negative':{'ひくい':'низкие','せまい':'узкие','小さい':'маленькие','暗い':'темные',},
    'colors':{'赤い':'красные','青い':'синие','黄色い':'желтые','白い':'белые','黒い':'черные','茶色い':'коричневые'}},

'adj_rooms_si_hir':{
    'positive':{'広い':'ひろい','高い':'たかい','大きい':'おおきい','明るい':'あかるい'},
    'negative':{'ひくい':'ひくい','せまい':'せまい','小さい':'ちいさい','暗い':'くらい',},
    'colors':{'赤い':'あかい','青い':'あおい','黄色い':'きいろい','白い':'しろい','黒い':'くろい','茶色い':'ちゃいろい'}},

# Ограничения и исключения
'adj_build_without_no':{ '中', '小','あさくさ','うえの','しんじゅく','しながわ', '東京','京都', '大学','公立','私立','国立','学校'},
'adj_build_with_no': {'明子さん', 'いしだ', '三木さん', '富山さん','東京','京都','大学','学校'},
'adj_non_predicative':{'しずか','きれい','にぎやか','すてき','ゆう名'},
'adj_non_predicative_hir':{'しずか':'しずか','きれい':'きれい','にぎやか':'にぎやか','すてき':'すてき','ゆう名':'ゆうめ',},
'adj_non_predicative_rus':{'しずか':'тихий','きれい':'красивый (чистый)','にぎやか':'оживленный','すてき':'прекрасный','ゆう名':'знаменитый',},
'adj_non_predicative_endings':{'しずか':'тихо','きれい':'красиво (чисто)','にぎやか':'оживленно','すてき':'прекрасно','ゆう名':'знаменито',},

# Свойства, которые можно обрести
'adj_for_small_object2':{'古':'старый','おもしろ':'интересный', 'つまらな':'скучный','寒':'холодный','暖か':'теплый'},
'adj_for_small_object2_hir':{'古':'ふる','おもしろ':'おもしろ', 'つまらな':'つまらな','寒':'さむ','暖か':'あたたか'},
'adj_for_small_endings3':{'古':'старым','おもしろ':'интересным', 'つまらな':'скучным','寒':'холодным','暖か':'теплым'}}
