# -*- coding: utf-8 -*-

Verbs={
    '1 conjugation':['買う','持つ','寝る','学ぶ', '読む','死ぬ','書く','行く','話す', '急ぐ'],
    '2 conjugation':['来る','食べる','見る','入れる','いる','上げる','着る','答える','始める','知っている','教える','起きる','決める','足りる','つける','務める'],
    'suru':['する','散歩する']}


Verbs_hir = {
    '買う':'かう','持つ':'もつ','寝る':'ねる','学ぶ':'まなぶ','読む':'よむ','死ぬ':'しぬ','書く':'かく','行く':'いく','話す':'はなす','急ぐ':'いそぐ',
    '来る':'くる','食べる':'たべる','見る':'みる','入れる':'いれる','いる':'いる','上げる':'あげる','着る':'きる','答える':'こたえる','始める':'はじめる','知っている':'しっている','教える':'おしえる','起きる':'おきる','決める':'きめる','足りる':'たりる','つける':'つける','務める':'つとめる',
    'する':'する','散歩する':'さんぽする'
}

Verb_translation = {
    '買う':'покупать','持つ':'держать','寝る':'спать','学ぶ':'учиться','読む':'читать','死ぬ':'умирать','書く':'писать','行く':'идти','話す':'говорить','急ぐ':'спешить',
    '来る':'приходить','食べる':'есть','見る':'смотреть','入れる':'вставлять','いる':'быть','上げる':'поднимать','着る':'надевать','答える':'отвечать','始める':'начинать','知っている':'знать','教える':'учить','起きる':'просыпаться','決める':'решать','足りる':'хватать (быть достаточным)','つける':'включать','務める':'выполнять обязанности',
    'する':'делать','散歩する':'гулять'
}

te = {
    '1 conjugation':{
        'ぶ':'んで',
        'む':'んで',
        'ぬ':'んで',
        'う':'って',
        'つ':'って',
        'る':'って',
        'ぐ':'いで',
        'く':'いて',
        'す':'して',
        'ふ':'んで',
        'づ':'で',
        'ず':'で',
    },
    '2 conjugation':{'る':'て'},
    'suru':{'する':'して'},
    'kuru':{'来る':''}
}

def lists_teform():
    new_list = []
    for i in Verbs:
        for j in Verbs[i]:
            new_list.append(j)
    sp = []
    for r in new_list:
        if r in Verbs['1 conjugation']:
            if r =='行く':
                hir =  r + ' -> ' + '行って'+', '+ 'いって'
            else:
                end = r[-1]
                r_without_end = r[:-1]
                hir_2 = Verbs_hir[r][:-1] + te['1 conjugation'][end]
                hir = r + ' -> ' + r_without_end + te['1 conjugation'][end]+', '+hir_2
            rus = Verb_translation[r]
            r = r +' - '+ Verbs_hir[r]
            sp.append((r,hir,rus))
        elif r in Verbs['2 conjugation']:
            end = r[-1]
            r_without_end = r[:-1]
            rus = Verb_translation[r]
            hir_2 = Verbs_hir[r][:-1] + te['2 conjugation'][end]
            hir = r + ' -> ' + r_without_end + te['2 conjugation'][end]+', '+hir_2
            r = r +' - '+ Verbs_hir[r]
            sp.append((r,hir,rus))
        elif r in Verbs['suru']:
            end = r[-2:]
            r_without_end = r[:-2]
            rus = Verb_translation[r]
            hir_2 = Verbs_hir[r][:-2] + te['suru'][end]
            hir = r + ' -> ' + r_without_end + te['suru'][end]+', '+hir_2
            r = r +' - '+ Verbs_hir[r]
            sp.append((r,hir,rus))
    return sp